{"title":"Pump Up The Volume [1990] Subs, Soundtrack, Extra Cuts","uid":8579171,"size":1418998177,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:015794f8bf7d73cccb267af834e93d7288a9ee6b&amp;dn=Pump+Up+The+Volume+%5B1990%5D+Subs%2C+Soundtrack%2C+Extra+Cuts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1371378339,"description":"Pump Up The Volume\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 972 MiB\nDuration                                 : 1h 41mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 718 pixels\nHeight                                   : 466 pixels\nDisplay aspect ratio                     : 1.85:1\nFrame rate mode                          : Variable\nScan type                                : Progressive\nWriting library                          : x264 core 120\nSubtitles                                : English\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0100436/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0100436/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/851a7f266face5a8634e6682428da12c3b5f16d8.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/851a7f266face5a8634e6682428da12c3b5f16d8.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Pump_Up_the_Volume_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Pump_Up_the_Volume_(film)&lt;/a&gt;\n\nNOTE - I have included the original soundtrack in FLAC, as well as copies of songs shown in the film, but missing from the soundtrack.\n\n\nMain cast\n\nChristian Slater as Mark Hunter\nSamantha Mathis as Nora Diniro\nMimi Kennedy as Marla Hunter\nScott Paulin as Brian Hunter\nCheryl Pollak as Paige Woodward\nAnnie Ross as Loretta Creswood\nAhmet Zappa as Jaime\nBilly Morrissette as Mazz Mazzilli\nSeth Green as Joey\nRobert Schenkkan as David Deaver\nEllen Greene as Jan Emerson\nAndy Romano as Mr. Murdock\nAnthony Lucero as Malcolm Kaiser\nLala Sloatman as Janie\nJames Hampton as Arthur Watts\n\nPump Up the Volume failed to catch on at the box office. When it was released on August 24, 1990, in 799 theaters, it grossed USD $1.6 million in its opening weekend. It went on to make $11.5 million in North America.\n\nThe film received generally positive reviews from critics and is currently rated 78% at Rotten Tomatoes. In his review for the New York Times, Stephen Holden wrote, &quot;Much like Heathers, Pump Up the Volume doesn't know how to draw out its premise, once that premise has been thoroughly explored. As the film accelerates toward its conclusion, the strands of its clever plot are too hastily and perfunctorily resolved . . . Working within the confines of the teen-age genre film, however, Pump Up the Volume still succeeds in sounding a surprising number of honest, heartfelt notes&quot;. USA Today gave the film three-and-a-half stars out of four, praising the film's conclusion: &quot;the ending, though in part contrived, doesn't cop out&quot;.\n\nThe soundtrack features several covers. The Cowboy Junkies' contribution to the soundtrack is a remake of a Robert Johnson song, while the Bad Brains and Henry Rollins track is a cover of the MC5 anthem. &quot;Stand&quot; by Liquid Jesus is a new version of the 1969 song by Sly &amp; the Family Stone.\n\nPeter Murphy's exclusive track was later included on a special reissue of his 1988 album, Love Hysteria, while Sonic Youth's song appeared on their 1990 release, Goo.\n\nAn earlier version of Soundgarden's &quot;Heretic&quot; appears on the 1985 Seattle band compilation album Deep Six. Concrete Blonde revisited &quot;Everybody Knows&quot; on their 2003 album, Live in Brazil. The original, upbeat version of &quot;Wave of Mutilation&quot; appears on Doolittle, the third studio album by Pixies.\n\nA number of songs prominently featured in the film did not appear on the officially released soundtrack, including the original version of &quot;Everybody Knows&quot; by Leonard Cohen, which appeared on his 1988 album, I'm Your Man. Although Cohen's version serves as the theme song for Mark's pirate radio program during most of the film, he opens his final broadcast with the Concrete Blonde cover that appears on the soundtrack. Also present in the film but absent from the soundtrack are &quot;Dad, I'm in Jail&quot; by Was (Not Was) from their 1988 album What Up, Dog?, &quot;Fast Lane&quot; by Urban Dance Squad from their 1990 album Mental Floss for the Globe, &quot;Weinerschnitzel&quot; by The Descendents from their 1981 EP Fat, &quot;Love Comes in Spurts&quot; by Richard Hell and the Voidoids from their 1977 album Blank Generation, and &quot;Talk Hard,&quot; by Stan Ridgway, the original version of which has never been released (though Ridgway has released a live version of the song).\n\nNot as prominently featured is a legendary early track by the Beastie Boys entitled &quot;The Scenario&quot;. Although the song appears only briefly in Pump Up the Volume, it is notable because it never appeared in any official release, however is available on hard to find bootleg recordings. The song was cut from the Beastie's Def Jam album Licensed to Ill after being deemed too explicit. Christian Slater's character explains this when he introduces it on the air saying, &quot;Now here's a song from my close personal buddies, the Beastie Boys...a song that was so controversial they couldn't put it on their first album.&quot;","torrent":{"xt":"urn:btih:015794f8bf7d73cccb267af834e93d7288a9ee6b","amp;dn":"Pump+Up+The+Volume+%5B1990%5D+Subs%2C+Soundtrack%2C+Extra+Cuts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"015794f8bf7d73cccb267af834e93d7288a9ee6b","infoHashBuffer":{"type":"Buffer","data":[1,87,148,248,191,125,115,204,203,38,122,248,52,233,61,114,136,169,238,107]},"announce":[],"urlList":[]}}