{"title":"Ballet Adagios","uid":6087524,"size":187760790,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:01b84ad6fe62f0bfc7e850999eb025b72d39e144&amp;dn=Ballet+Adagios&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"fanclubt","files":25,"time":1294399137,"description":"Ballet Adagios.2009\n\nCD1\n01. Tchaikovsky: The Sleeping Beauty: Rose Adagio National Philharmonic Orchestra - Richard Bonynge\n02. Saint-SaÃƒÂ«ns: Carnival of the Animals: The Swan Julian Lloyd Webber - English Chamber Orchestra - Nicholas Cleobury\n03. Massenet: Le Vierge: The Last Sleep of the Virgin New Symphony Orchestra of London - Raymond Agoult\n04. Chopin, arr. Douglas: Les Sylphides: Nocturne National Philharmonic Orchestra - Richard Bonynge\n05. Gounod: Faust: Ballet music: Adagio Rotterdam Philharmonic Orchestra - David Zinman\n06. Czibulka: Love\\'s Dream after the Ball London Symphony Orchestra - Richard Bonynge\n07. Delibes: CoppÃƒÂ©lia: Act 3: Peace L\\'Orchestre de la Suisse Romande - Richard Bonynge\n08. Stravinsky: The Firebird: Berceuse Detroit Symphony Orchestra - Antal Dorati\n09. Massenet: La Cigale: Valse tres lente National Philharmonic Orchestra - Richard Bonynge\n10. Rossini arr. Britten: Matin?es musicales: Nocturne National Philharmonic Orchestra - Richard Bonynge\n11. Strauss arr. Desormiere:Le Beau Danube Andantino--Tempo di valse National Philharmonic Orchestra - Richard Bonynge\n12. Tchaikovsky: Melody (Souvenir d\\'un lieu shere, op. 42 no. 3) John Georgiadis - London Symphony Orchestra - Richard Bonynge\n13. Prokofiev: Romeo and Juliet: The Last Farewell Orchestre symphonique de Montreal - Charles Dutoit\n\nCD2\n01. Massenet: Thais: Meditation John Georgiadis - London Symphony Orchestra - Richard Bonynge\n02. Khachaturian: Spartacus: Adagio of Spartacus and Phrygia Wiener Philharmoniker - Aram Khachaturian\n03. Chopin, arr. Douglas: Les Sylphides: Waltz National Philharmonic Orchestra - Richard Bonynge\n04. Tchaikovsky: Swan Lake: Act 3: Black Swan London Symphony Orchestra - Richard Bonynge\n05. Massenet: Le Roi de Lahore: Entr\\'acte (Act V) * Valse (Act III) London Symphony Orchestra - Richard Bonynge\n06. Tchaikovsky: The Nutcracker: Waltz of the Flowers Orchestre symphonique de Montreal - Charles Dutoit\n07. Khachaturian: Gayaneh: Gayaneh\\'s adagio Wiener Philharmoniker - Aram Khachaturian\n08. Massenet: Scenes alsaciennes: I Dimanche matin London Symphony Orchestra - Richard Bonynge\n09. Prokofiev: Cinderella: Valse The Cleveland Orchestra - Vladimir Ashkenazy\n10. Tchaikovsky: Swan Lake: Act 1: Finale Orchestre symphonique de Montreal - Charles Dutoit\n","torrent":{"xt":"urn:btih:01b84ad6fe62f0bfc7e850999eb025b72d39e144","amp;dn":"Ballet+Adagios","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b84ad6fe62f0bfc7e850999eb025b72d39e144","infoHashBuffer":{"type":"Buffer","data":[1,184,74,214,254,98,240,191,199,232,80,153,158,176,37,183,45,57,225,68]},"announce":[],"urlList":[]}}