{"title":"Perfect World Private - ¤ The Complete PW Package &amp;curren","uid":9445988,"size":21979620044,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:027c43fd4aaa7f9e852bfed999d9d8800d414611&amp;dn=Perfect+World+Private+-+%26curren%3B+The+Complete+PW+Package+%26curren&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThreeFourThree","files":-1,"time":1389095374,"description":"Perfect World Private - Â¤ The Complete PW Package Â¤\n\nThis is a complete package of the game &quot;Perfect World&quot; for PC\n\nThe server from this package runs on Ubuntu 12.04.3 LTS x64\nThe client runs on WinXP+ operating systems\nThere is also a 'tools' disc included (pw_dev.iso) so that one can modify the server/client to their liking\n\nThe server has been made a simple and straightforward installation. All you have to do to install the server is mount/burn the ISO and run the corresponding installation for it. &quot;./install-pw&quot; will install v136, &quot;./install-131&quot; will install v131, &quot;./install-146&quot; will install v146, and &quot;./install-fw&quot; will install fw(v0517). v136 is the &quot;base&quot; package and REQUIRED to install any of the &quot;addons&quot; which include v131, v146, and fw(v0517). All can be installed at the same time but they cannot be ran simultaneously (only one can be ran at a time). There is a service included to switch between the active installed versions called pwversion (merely type &quot;service pwversion&quot; in the Linux terminal to switch between active versions). These can also be installed as a system service/daemon (if you have a worthy system [with enough RAM]) so that there is NO human interaction required to boot up the server besides pressing the power button (or starting up the virtual machine). Note: If you don't have a good enough system or just don't desire to run as a system service/daemon you can simply navigate a web browser to your server @ http://your.server.ip.address/admin to start one game map at a time. The servers HTTPD, MySQL, Tomcat, etc, are all started automatically no matter what (for this reason).\n\nThe client doesn't really need 'instructions' whatsoever, just mount/burn the ISO and install, then it's ready to launch/play. You only need to set the IP of the server to connect to in serverlist.txt (server.lua for FW). For more advanced users there is an auto patcher (CPW) with this package and the two files: updateserver.txt and mainuni.xml also need the IP of the server set in them for the patcher to work.\n\nThere is an entire WEALTH of knowledge about this package in a file called &quot;adminnotes.txt&quot; that can actually be found in two locations. A copy of adminnotes.txt is included with pw_dev.iso in a directory named AdminNotes and with the v136 base installation package in /root/notes/\n\nSome of the more technical aspects/details:\n\nThis (server) package (and all of the 'addons') *MUST* be installed as the root user/account of Linux!\n\nThis (server) package MUST be installed on Ubuntu 12.04.3 LTS x64 (included)!\n\nPorts (what ports this package will utilize):\n-29000 this is the game port (server-client game communications)\n-80 a basic website that is ran on the server so that accounts can be registered (and more even including a help desk)\n-8080 a tomcat JSP container for the above website and administrator controls\n-3306 the MySQL database for user accounts (should not be open to WAN if running a public server)\n\nDefault passwords (CaSe SeNsItIvE):\nMySQL = username:root password:root (access from localhost ONLY)\nMySQL = username:pwAdmin password:root (access from ANY host)[ie... for BatGM, or Navicat]\n.htaccess (/opt/lampp/security/restricted.users &amp; restricted.groups) = username:pwAdmin password:root\npwAdmin = root\nhesk (help desk/ticket system) = username:Administrator password:admin\n\nIf you need any further information or assistance with this download please visit - http://forum.ragezone.com/f452/complete-pw-package-736572-post6233347/#post6233347","torrent":{"xt":"urn:btih:027c43fd4aaa7f9e852bfed999d9d8800d414611","amp;dn":"Perfect+World+Private+-+%26curren%3B+The+Complete+PW+Package+%26curren","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"027c43fd4aaa7f9e852bfed999d9d8800d414611","infoHashBuffer":{"type":"Buffer","data":[2,124,67,253,74,170,127,158,133,43,254,217,153,217,216,128,13,65,70,17]},"announce":[],"urlList":[]}}