{"title":"Portico Quartet - Isla [FLAC] TQMP","uid":5937004,"size":311309630,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:02a06cc918defea5eea59347a7cefaa2c86a3d8a&amp;dn=Portico+Quartet+-+Isla+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1289003864,"description":"Portico Quartet - Isla\n2009\n\nTheir sound has been referred to as &quot;post-jazz&quot; influenced by &quot;ÃƒÂ  Steve Reich, Miles Davis, Philip Glass and Toumani Diabate.&quot;\n-- Africa Is A Country\n\nBelieve the hype. These kids are awesome.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nReview --\n\nHaving created a seismic sensation in Britain with its first album, Knee Deep In The North Sea (Babel, 2007)--which was a Mercury Prize Album Of The Year in 2008--Portico Quartet now releases that &quot;difficult&quot; second album. Can the group better its precocious debut? Yes it can. Portico has grown, as a collective entity and as individual musicians, and it's associating, rewardingly, with some heavy hitters: signed to Peter Gabriel's Real World Records and produced by John Leckie, whose credits include Doves, Radiohead and The Stone Roses. \n\nPortico gathered much of its early media attention from the use of hangs--tuned percussion instruments which in appearance resemble a pair of cooking woks. Portico was the first British band, maybe the first band in the world, to use hangs, and the novelty served it well. \n\nWith a character of their own, hangs nevertheless carry traces of Tibetan prayer bells, steel drums, gamelan gongs, tubular bells, cymbals and xylophones. Their sound is pure and mellifluous, but without the sustained resonance of real bells; they are percussive, but without the hard-edged impact of cymbals or xylophones. Hangs don't work as washes of chill-out ambient sound, but they lend themselves perfectly to riffs and ostinatos, producing rapid-fire rhythms with attractively rounded edges. \n\nOne of the strengths of Isla is that the hangs aren't treated like exclamation marks; their particular attributes have become more fully integrated into the group sound. The basic Portico paradigm has hang players Nick Mulvey and Duncan Bellamy, who also plays kit drums, working in tandem with double bassist Milo Fitzpatrick to produce interconnecting layers of beats and melodic motifs. Some might call this &quot;trance,&quot; but there's too much evolution going on to merit that generic description. Saxophonist and (less is more) loopist Jack Wyllie rides the waves, stating most of the themes and taking most of the formal solos. He sticks mainly to prettily played and gently handled soprano, but adds some rough, broken-note strewn alto or tenor to the racing &quot;Clipper.&quot; \n\nThe album is characterized by a brisk liveliness: even when a top line is slow and leisurely, as for instance in the extenuated soprano notes which state &quot;Line,&quot; the underlying patterns played by the hangs and/or the drums and bass are frequently in double or quadruple time. Melodies are attractive and catchy. Rhythms are insistent. Improvisation is to the fore. Isla is the nuts.\n-- All About Jazz\n\n-=-=-= From the Press =-=-=-\n\n&quot;Wholly original, 21st-century experimentalism that stirs both body and soul.&quot; ÃƒÂ» *The Washington Post*\n\n&quot;Portico Quartet's bewitching mix can sound like a noirish jungle cruise scored by Wayne Shorter and Steve Reich.&quot; *- LA Times (3/4 stars)*\n\n&quot;Breathtaking and cinematic&quot; - *Pop Matters (8/10 stars)*\n\n&quot;As compelling as its acclaimed predecessor.&quot; -*Paste (8.6/10)*\n\n&quot;Each of its nine tracks represents something different, giving listeners the impression that 'Isla' is telling one over-arching, very pretty, mystical story.&quot; - *CMJ*\n\n&quot;Start with Miles Davis circa 'Great Expectations,' throw in Reich's 'Music for 18 Musicians,' and a healthy dose of the last great wave of British jazz musiciansÃƒÂ  and then season with the more recent ambient textures of spacey alt-rockers Sigur Ros, and you get at least a rough idea of what Portico Quartet tastes like.&quot; -* Buffalo News*\n\n&quot;Strikes a balance between calm, circular cadences and wild soloing.&quot; *- Alarm Press*\n\nTrack List\n01 - Paper Scissors Stone\n02 - The Visitor\n03 - Dawn Patrol\n04 - Line\n05 - Life Mask (Interlude)\n06 - Clipper\n07 - Life Mask\n08 - Isla\n09 - Shed Song (Improv. No 1)\n\nEAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:02a06cc918defea5eea59347a7cefaa2c86a3d8a","amp;dn":"Portico+Quartet+-+Isla+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02a06cc918defea5eea59347a7cefaa2c86a3d8a","infoHashBuffer":{"type":"Buffer","data":[2,160,108,201,24,222,254,165,238,165,147,71,167,206,250,162,200,106,61,138]},"announce":[],"urlList":[]}}