{"title":"Armin van Buuren Armin Only Imagine [2 DVD][Trance][NTSC][2008]","uid":5951082,"size":11029571366,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0365d2068a723b17eca58dfe3af1cb949d6b0ed7&amp;dn=Armin+van+Buuren+Armin+Only+Imagine+%5B2+DVD%5D%5BTrance%5D%5BNTSC%5D%5B2008%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BHypseus","files":63,"time":1289530550,"description":"ARMIN VAN BUUREN - ARMIN ONLY - IMAGINE - 2008 (ISO DVD-R) - DVD DUPLO\n\nEleito por 3 vezes consecutivas como o DJ nÃƒÂºmero 1 do mundo, Armin van Buuren apresenta o mega show de seu ÃƒÂºltimo CD, &quot;Imagine&quot;! Uma grande festa, para mais de 16.000 pessoas e Armin tocando por 9 horas consecutivas. Dois anos de trabalho duro veio junto em uma noite mÃƒÂ¡gica, no Jaarbeurs em Utrecht, na Holanda. Armin van Buuren convidou todos os artistas que contribuÃƒÂ­ram para o seu terceiro ÃƒÂ¡lbum &quot;Imagine&quot; e eles participaram das suas faixas durante o show. A combinaÃƒÂ§ÃƒÂ£o da mÃƒÂºsica, os efeitos especiais, os recursos visuais e muitas caracterÃƒÂ­sticas fizeram o tema da noite: &quot;Imagine&quot;.\n&quot;Armin Only - Imagine&quot;, tem sido o destaque absoluto da minha carreira. Compartilhar as faixas do meu ÃƒÂ¡lbum com uma audiÃƒÂªncia como esta foi incrÃƒÂ­vel. &quot;Imagine&quot; pra mim significa a forma que eu visualizo a mÃƒÂºsica quando eu a ouÃƒÂ§o, e muitas pessoas tÃƒÂªm aquela mesma conexÃƒÂ£o com a mÃƒÂºsica, especialmente trance que ÃƒÂ© tÃƒÂ£o emocionante. MÃƒÂºsica ÃƒÂ© muito pessoal para todo mundo, e o que eu idealizei das minhas viagens ÃƒÂ© que a mÃƒÂºsica trancende tudo - a mesma mÃƒÂºsica pode tocar pessoas do mundo todo. VocÃƒÂª nÃƒÂ£o pode julgar alguÃƒÂ©m pelo seu gosto musical, e vocÃƒÂª nÃƒÂ£o pode influenciÃƒÂ¡-las para curtir mÃƒÂºsica que nÃƒÂ£o ÃƒÂ© para eles - somente algo que ressona em cada indivÃƒÂ­duo&quot;, afirma Armin. Uma das coisas belas sobre o ser humano ÃƒÂ© que podemos imaginar, criar e escapar atrÃƒÂ¡s da nossa imaginaÃƒÂ§ÃƒÂ£o quando queremos reviver uma sensaÃƒÂ§ÃƒÂ£o ou inventar algo novo... Sou realmente seguro de que este DVD mostra todas as extensÃƒÂµes de dentro e fora, especialmente para mim, este evento ÃƒÂ© muito especial!&quot;, finaliza o Top DJ.\nO DVD Armin Only - Imagine, ÃƒÂ© Duplo. No DVD 1 vocÃƒÂª encontra o registro ao vivo de &quot;Armin Only - Imagine&quot;, realizada no dia 19 de abril de 2008 no Jaarbeurs em Utrecht, na Holanda. No DVD 2 vocÃƒÂª tem uma variedade de caracterÃƒÂ­sticas especiais, como: nos bastidores e o making of do Armin Only, entrevistas exclusivas com os artistas e os clipes de Armin van Buuren. Vale muito a pena conferir!\n\nDVD 1\n\n01. Armin Van Buuren - Face To Face \n02. Armin Van Buuren FT. Jennifer Rene - Fine without You (Live Performance By Jennifer Rene) \n03. Armin Van Buuren - Armin Only: Imagine Intro 2008 \n04. Armin Van Buuren - Inmagine (Live Performance By Eller Van Buuren) \n05. Leon Bolier - Ocean Drive Boulevard \n06. Petr Martijn Wijna Presents Majetsa - Not The End Vs. Dj Shah FT. Adrina Thorpe- Who wil find Me (Acapella) (Armin Van Buuren Mashup) \n07. Alex M.O.R.P.H - Walk To The Edge (Alex M.O.R.P.H. B2B Woody Van Eyden Remix) \n08. Armin Van Buuren &amp; Dj Shah FT. Chris Jones - Going Wrong (Live Performance By Dj Shah &amp; Chris Jones) \n09. Armin Van Buuren FT. susana - If You Should Go (Aly &amp; Fila Remix) (Live Performance By Susana) \n10. Luke Warner &amp; Mat Lock - Deep Psychosis (Daniel Kandi's Cure Remix) \n11. Armin Van Buuren FT. Jacqueline Govaert - Never Say Never (Live Performance By Benno De Goeij &amp; Jacqueline Govaert) \n12. W&amp;W - Arena \n13. Armin Van Buuren - Who is Watching (Remy &amp; Roland Klinkenberg Remix \n14. Armin Van Buuren Ft. Gabriel &amp; Dresden - Zocalo (Armin In Mexico Mix) (Live Performance By Eller Van Buuren) \n15. Armin Van Buuren - Controlfreak (Sander Van Doorn Remix) \n16. Armin Van Buuren Vs. Rank 1 FT. Kush - This World Is Watching Me (Cosmic Cate Remix) \n17. Armin Van Buuren - Shivers (Alex M.O.R.P.H.'S Red Light Dub) (Live Performance By Susana) \n18. Armin Van Buuren - Sail \n19. Armin Van Buuren FT. Jan Vayne - Serenity \n20. Armin Van Buuren FT. Ray Wilson - Yet Another Day (Hiver &amp; Hammer Remix) \n21. Armin Van Buuren FT. Justine suissa - Burned with Desire (Rising Star Remix) \n22. Armin Van Buuren - Comunication Part 3 \n23. John O'Callaghan FT. Audrey Gallagher - Big Sky (Agnelli &amp; Nelson Remix) (Live Performance By Audrey Gallagher) \n24. Armin Van Buuren FT. Audrey Gallagher - Hold On To Me (Live Performance By Audrey Gallagher) \n25. Dj Eco &amp; Martin Roth - Tonight Is Forever (Martin Roth Edit) \n26. Armin Van Buuren FT. Cathy Burton - Rain (Live Performance By Carol) \n27. Ernesto &amp; Bastian - Thrill \n28. D-Unity - Area 57 \n29. Bissen Presents The Crossover - Quicksand (Joint Operations Centre Remix) \n30. Armin Van Buuren - Rush Hour \n31. Veracocha - Carte Blanche (Cosmic Gate Remix)\n\nDVD 2\n\nThis disc includes: \nBehind The Scenes Armin Only 2008 \nPhoto Report \nMusic Vedios \nThe sound Of Goodbye \nGoing Wrong \nMaking Of Going Wrong \nDeleted Scenes \nUnforgivable (Live At Armin Only) \nThe Sound Of Goodbye (Live At Armin Only) \nTrailer \nDiscography","torrent":{"xt":"urn:btih:0365d2068a723b17eca58dfe3af1cb949d6b0ed7","amp;dn":"Armin+van+Buuren+Armin+Only+Imagine+%5B2+DVD%5D%5BTrance%5D%5BNTSC%5D%5B2008%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0365d2068a723b17eca58dfe3af1cb949d6b0ed7","infoHashBuffer":{"type":"Buffer","data":[3,101,210,6,138,114,59,23,236,165,141,254,58,241,203,148,157,107,14,215]},"announce":[],"urlList":[]}}