{"title":"Dr Doom (Chronology &amp; extras)","uid":10263657,"size":5267160895,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:03909ad31970f853a062b2dd2a30cc342bcd13d3&amp;dn=Dr+Doom+%28Chronology+%26amp%3B+extras%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"nemesis43","files":419,"time":1401496492,"description":"Dr Doom (Chronology &amp; extras) \n\nOrigin\n\nVictor was the child of Gypsy travelers in Latveria, a small European country. Victor's mother, Cynthia, was killed soon after she called upon the demon Mephisto for power. She left Victor with his father, asking him to protect him from Mephisto. Victor's father, Werner, was a doctor who was called upon by King Vladimir of Latveria to treat his wife. Unable to do so, Werner fled with Victor and died soon afterward trying to protect his son. Victor was left with his father's best friend Boris. Victor later discovered his mother's mystical books and artifacts. With them he was able to teach himself sorcery. He made several unsuccessful attempts to free his mother's soul from Mephisto.\n\nVictor excelled in science, developed several inventions, and was eventually given a scholarship to Empire State University. While attending this school Victor met Reed Richards, who would later become his enemy, Mr. Fantastic. In school, they were considered scholarly rivals. One day, Victor designed an invention to rescue his mother which would become his greatest downfall. Richards attempted to warn Victor of an error in his calculations. However, Von Doom's arrogance refused to let him listen. The machine then exploded, scarring his face, and led to his expulsion from the university.\n\nVon Doom later went to Tibet and found an old order of monks. He practiced their ways enough for him to become their leader. Von Doom then asked them to make his first suit of armor. Eager to wear the suit, Doom placed the still-hot steel faceplate to his face, making him even more scarred than before. As Dr. Doom, he then killed Baron Vladimir and imprisoned his son Rudolfo, and gained control over Latveria. Rudolfo would escape and lead a rebellion and become a thorn in Doom's side for years till his death. Later, Rudolfo's younger brother Zorba would take over where his brother left off. Doom using his intellect and inventions, turned Latveria into a thriving nation.\n\nCreation\n\nDoctor Doom was created by Stan Lee and Jack Kirby in Fantastic Four #5. The primary inspiration for Doctor Doom was Doc Savage's archenemy John Sunlight.\n\nCharacter Evolution\n\nSilver Age\nDoctor Doom fought the Fantastic Four many times in this era.\n\nBronze Age\nDoctor Doom starred with Namor the Sub-Mariner, and other characters, in Super-Villain Team Up, as well as a few graphic novels such as Emperor Doom and Triumph and Torment. The idea of the Doombot is expanded.\n\nModern Age\nDoctor Doom's magical abilities are explored more and his plans take on a more global aspect with his membership in the Cabal and his attack on Wakanda.","torrent":{"xt":"urn:btih:03909ad31970f853a062b2dd2a30cc342bcd13d3","amp;dn":"Dr+Doom+%28Chronology+%26amp%3B+extras%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03909ad31970f853a062b2dd2a30cc342bcd13d3","infoHashBuffer":{"type":"Buffer","data":[3,144,154,211,25,112,248,83,160,98,178,221,42,48,204,52,43,205,19,211]},"announce":[],"urlList":[]}}