{"title":"Mageborn 1 - 4","uid":9580135,"size":3039014894,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:045bc7e878d9631ab5dc4dd9aebbb4e4c96136db&amp;dn=Mageborn+1+-+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sabbith303","files":-1,"time":1391747181,"description":"The Blacksmith's Son: Mageborn, Book 1\n\nMordecai's simple life as the son of a blacksmith is transformed by the discovery of his magical birthright. As he journeys to understand the power within him he is drawn into a dangerous plot to destroy the Duke of Lancaster and undermine the Kingdom of Lothion. Love and treachery combine to embroil him in events he was never prepared to face. What he uncovers will change his understanding of the past, and alter the future of those around him.\n\nThe Line of Illeniel: Mageborn, Book 2\n\nMordecai has discovered his heritage and must take up the mantle of a lord of the realm, while figuring out what it really means to be a mage of the line of Illeniel. He is beset on both sides by allies and enemies trying to control or destroy his future. Gods and kings both seek to manipulate him for their own ends, and no matter what he chooses his loved ones will suffer. Will he risk destroying his love with a bond that might be her death, or face the madness that comes to wizards who embrace power without restraint?\n\nThe Archmage Unbound: Mageborn, Book 3\n\nMordecai's growing power and success have made him a threat, not just to the gods and their minions, but also to the king of Lothion. An unholy bargain has been struck to bring him to heel and increasingly it seems that victory may not be worth the price, not if the cost is measured in the blood of his family. Wizard, lord, husband, father, and now archmage...no man can balance so many roles without sacrificing something.\n\nWill the world be worth saving if it costs him the very reasons he has for living in it?\n\nThe God-Stone War: Mageborn Series, Book 4\n\nSeven years have passed since Mordecai's battle with the Shining God, Celior, and since that time his control of his abilities has vastly improved. He has at last envisioned a use for the 'God-Stone,' but the gods want vengeance and now seek to destroy everything he has built. The secrets of the past threaten the future of his kingdom, his family, and perhaps humanity itself, unless Mordecai can discover the meaning of 'Illeniel's Doom.' How far will a desperate wizard go to protect his children...or will his efforts merely damn them all\n\n\n\n\n\n","torrent":{"xt":"urn:btih:045bc7e878d9631ab5dc4dd9aebbb4e4c96136db","amp;dn":"Mageborn+1+-+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"045bc7e878d9631ab5dc4dd9aebbb4e4c96136db","infoHashBuffer":{"type":"Buffer","data":[4,91,199,232,120,217,99,26,181,220,77,217,174,187,180,228,201,97,54,219]},"announce":[],"urlList":[]}}