{"title":"Lowrance_J_D_-Logans_Reaper.epub","uid":9223269,"size":135625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05346fb4a03dc81e463252c71351f8a3bb41e2c6&amp;dn=Lowrance_J_D_-Logans_Reaper.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1384970292,"description":"I hear the rumble of the pipes before I even saw the motorcycles. I closed my eyes and savored the sound. I loved it and always found myself pausing when I heard one. I fell in love with the sound when daddy brought his bike home that first time. Other kids covered their ears and ran to stand behind their momma's, but not me. I raced towards the sound with my arms and eyes wide open never wanting it to stop.\n\nLogan Jones is hiding in a small town with her sister Campbell. Their gorgeous neighbor of the duplex they just rented is no other than the Soul Reapers' VP Colton Murphy. Her life was too complicated to add another layer of hot-ass biker to the mix.\n\nColton\n\nShe kept sneaking peeks at me from under her long lashes to see if my attention has moved on but after having seen her I did not think it would ever move on again.\n\nColton Murphy has a good life with plenty of everything coming his way - woman, money, booze. He has plenty of time to settle down in a few years. That is until he returns from a run to find the long-legged, auburn beauty, Logan Jones, that has moved in next door.\n\n***Author's note: This novel contains scenes of a sexual nature, violent themes, and coarse language. It is intended for mature reader","torrent":{"xt":"urn:btih:05346fb4a03dc81e463252c71351f8a3bb41e2c6","amp;dn":"Lowrance_J_D_-Logans_Reaper.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05346fb4a03dc81e463252c71351f8a3bb41e2c6","infoHashBuffer":{"type":"Buffer","data":[5,52,111,180,160,61,200,30,70,50,82,199,19,81,248,163,187,65,226,198]},"announce":[],"urlList":[]}}