{"title":"LeBor - Milosevic - A Biography (2003).pdf","uid":4831085,"size":2536799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05d2f63f27f5ca207847372e65de1dfb12fece09&amp;dn=LeBor+-+Milosevic+-+A+Biography+%282003%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Djofullinn","files":1,"time":1239130509,"description":"From Publishers Weekly\nDrawing on pithy interviews with key players, LeBor (Hitler's Secret Bankers), who covered the Yugoslav wars for the Independent and the London Times, traces Milosevic's rise from a provincial childhood to leader of the Serbian Communist Party and then the Serbian presidency. LeBor absorbingly details Milosevic's self-serving strategizing in the independence movements in Slovenia, Croatia and Bosnia; his manipulation of Serb nationalist fervor; and his shadowy network of agents and gangsters. Firsthand interviews with Milosevic's wife and collaborator, Mira Markovic, allow LeBor to infuse his account of the Milosevic-Markovic &quot;personal para-state&quot; with insights into the couple's oddly contradictory ideological stances. He depicts their insular family life with obvious distaste for their seeming indifference to the tragic events around them. LeBor presents the West's attempts to abate war in the region as dynamic, if at times misguided; following his account of the peace accords negotiated at Dayton, Ohio, where Milosevic was an honored guest, he soberly remarks that between &quot;statesman or war criminal,&quot; finally, &quot;much of the difference, it seems, is in the eye of the beholder.&quot; Milosevic's involvement in ethnic cleansing emerges even more explicitly in the endgame of his rule, as Serbia battles the Kosovo Liberation Army. An afterword delivers further proof of Milosevic's guilt from his ongoing trial for genocide at the Hague. This disciplined, dispassionate portrait focuses on the actions of &quot;an autocrat motivated by power.&quot; It does not attempt psychological speculation or a more theorized portrait. Highly readable, yet savvy about regionally specific realpolitik, this political biography will greatly enhance the lay reader's understanding of recent events in Yugoslavia. Illus. not seen by PW; maps.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\n\nFrom Booklist\nWhat manner of man is Slobodan Milosevic, the Serbian leader during Yugoslavia's bloody disintegration who is currently on trial for war crimes? Not a man of principle or warmth, according to LeBor's biography, but rather one dedicated to the attainment and retention of political power. After Milosevic rigged one election too many, a popular uprising ejected him from office in 2000, a vertiginous fall from the summit for the career communist turned Serb nationalist. Outside of Milosevic's determination to keep Kosovo, however, LeBor discovers much information that casts Milosevic as an exploiter rather than a champion of Serb nationalism. His thorough research indicates how Milosevic would as easily stiff his Serbian clients doing the fighting and ethnic cleansing as toss back a brandy. Embroidering these deadly political machinations with Milosevic's domestic life, an uxorious one centered on his wife, LeBor depicts a consummate opportunist who succeeded, for a while, in riding high while a country disintegrated and an economy descended into gangsterism. A vital addition to the literature on Yogoslavia's catastrophic end. Gilbert Taylor\nCopyright Ã‚Â© American Library Association. All rights reserved ","torrent":{"xt":"urn:btih:05d2f63f27f5ca207847372e65de1dfb12fece09","amp;dn":"LeBor+-+Milosevic+-+A+Biography+%282003%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05d2f63f27f5ca207847372e65de1dfb12fece09","infoHashBuffer":{"type":"Buffer","data":[5,210,246,63,39,245,202,32,120,71,55,46,101,222,29,251,18,254,206,9]},"announce":[],"urlList":[]}}