{"title":"Apex Video Converter Super v8.18 Incl Crack [TorDigger]","uid":8044132,"size":19691904,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:061adf649ab1fdd4c72173c883b62fb39e9b376f&amp;dn=Apex+Video+Converter+Super+v8.18+Incl+Crack+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"TorDigger","files":10,"time":1358709458,"description":"Apex Video Converter Super\n\nApex Video Converter Super - Convert video to avi mpeg mov rm wmv iPod swf flv 3gp mp3 mp4 apple tv iphone Zune\n\nApex Video Converter Super is designed to meet all your needs of convert file .It supports to convert your favorite video from AVI, MOV, QuickTime, MPEG, WMV, ASF, RM, RMVB, VCD, DVD to AVI, MPEG, VCD, DVD, MOV, RM, RMVB, WMV, ASF, iPod, PSP, 3GP, Xbox, PPC, PMP, Zune, Apple TV, iPhone, Flash SWF, Flash FLV, Youtube FLV, MP3 Audio, WMA Audio, WAV Audio, MP2 Audio, GIF Animation and GIF, BMP EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K Picture formats. \nExtremely fast conversion speed and friendly user interface let you convert video files between many formats with ease. The powerful features and unbeatable price make Apex Video Converter Super an affordable and powerful video conversion solution on personal computer.\n\nKey Features of Apex Video Converter Super:\n\nSupport MOV, MPEG, VCD, DVD, WMV, ASF, RM, RMVB, AVI, DIVX, PPC, iPod, Flash SWF, Flash FLV, Gif Animation, PSP, 3GP, Xbox, PMP video converter;\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Apple iPod, Sony PSP, Cell Phone 3GP, Microsoft Zune Player, Microsoft Xbox, Pocket PC, Portable Media Player ect. Mobile video.\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to AVI, Divx, Xvid, MPEG, MOV, WMV, RM, RMVB etc. PC Video.\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Flash SWF, Youtube FLV, Flash FLV .\nVCD Ripper -- Support ripper VCD movies from dat to any pop video formats\nDVD Ripper -- Support ripper unprotected DVD movies from vob to any pop video formats \nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to MP3, WMA, WAV, MP2 Audio \nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Gif Animation and GIF, BMP, EPS, JPG, PCX, PSD, PDF, TIFF, WMF, EMF, PNG, J2K IMAGE\nSupport converting video from AVI, Divx, ASF, WMV, WMA, MPEG, MOV, QT, RM, RMVB, VCD, DVD file to Apple TV, iPhone\n\nWhy Choose Apex Video Converter Super ?\n\nExtreme fast Conversion speed;\nUser-friendly UI with &quot;easy&quot; procedures .\nSupport batch files conversion.\nSpecifies start and end position while convert\nSupport large video files, even large then 2GB.\nSelect to automatically shut down your PC after conversion.\n\nSupported OS:\n\nWindows All\n\nHomepage: http://www.tompegx.com/video-converter-super.html\n\nInstallation Instructions:\n\n- Install program.\n- Copy content from crack folder and paste into default installation directory.\n- Run application and Register with any name and key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:061adf649ab1fdd4c72173c883b62fb39e9b376f","amp;dn":"Apex+Video+Converter+Super+v8.18+Incl+Crack+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"061adf649ab1fdd4c72173c883b62fb39e9b376f","infoHashBuffer":{"type":"Buffer","data":[6,26,223,100,154,177,253,212,199,33,115,200,131,182,47,179,158,155,55,111]},"announce":[],"urlList":[]}}