{"title":"CSI 3 Nieuwe Boeken (E-Books)NLT-Release","uid":7052140,"size":1212514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0677d16a088e5691f7fc5295cacd4b857d2b5706&amp;dn=CSI+3+Nieuwe+Boeken+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1329992705,"description":"CSI 3 Nieuwe Boeken (E-Books)NLT-Release\n\n\nCSI Miami - Slangenest\n\n\nBeschrijving\n \nEen vuurgevecht in een casino. Al snel intdekken Grissom en zijn team dat de twee slachtoffers van dit geweld beslist geen onschuldige toeschouwers waren. Een van hen is namelijk een machtige gangleader, en de ander kan in verband gebracht worden met en gruwelijke executie die kortgeleden heeft plaatsgevonden... \n\nCSI: Slangennest is een superspannende thriller van Max Allan Collins, gebaseerd op de in Amerika met vele prijzen bekroonde televisieserie.\n\n\nCSI Miami - Doelwit \n\n\nBeschrijving\n \nInspecteur Horatio Crane staat aan het hoofd van een topteam van forensische wetenschappers dat de sporen van de misdaad volgt in het tropische Florida. Samen verzamelen en analyseren ze bewijsmateriaal dat de waarheid aan het licht moet brengen en dat recht moet doen aan hen die in de meeste gevallen niet voor zichzelf kunnen opkomen: de slachtoffers.. \n\nTopcrimineel Kurt Wallace moet alles op alles zetten om zijn enorme misdaadimperium bijeen te houden ' totdat een paar goedgeplaatste kogels zijn strijd beÃƒÂ«indigen. En meteen verschijnen er talloze kapers op de kust die hun stukje van de onderwereld van Miami willen opeisen. Het is nu de taak van Horatio Cranes CSI-team om uit te vinden wie de moord pleegde waarvoor iedereen in Miami het motief had om hem te plegen'\n\n\nCSI Miami - Daad van Terreur\n\n\nBeschrijving\n \nFebruari in Miami. Een scÃƒÂ¨ne die alles heeft van een mislukt terreurincident. De plaats van de aanslag ligt bezaaid met lijken en er wordt bloed gevonden dat wordt geÃƒÂ¯dentificeerd als dat van ene Abdus Sattar Pathan. Horatio Caine is ervan overtuigd dat hij dezelfde is als een internationaal gezochte terrorist, bijgenaamd de Haas. Maar hoe kan hij dit bewijzen?\n\n\n\nHashcode:\n0677D16A088E5691F7FC5295CACD4B857D2B5706\n\nVOOR DE NIEUWSTE FILMS, MUZIEK EN BOEKEN GA JE NAAR NLT-RELEASE:\n &lt;a href=&quot;\nhttp://www.nlt-release.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt-release.nl&lt;/a&gt;\n\nBy Linday\n\n","torrent":{"xt":"urn:btih:0677d16a088e5691f7fc5295cacd4b857d2b5706","amp;dn":"CSI+3+Nieuwe+Boeken+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0677d16a088e5691f7fc5295cacd4b857d2b5706","infoHashBuffer":{"type":"Buffer","data":[6,119,209,106,8,142,86,145,247,252,82,149,202,205,75,133,125,43,87,6]},"announce":[],"urlList":[]}}