{"title":"Skyrim Modded Game Save (Xbox 360)","uid":8691045,"size":3534848,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:07239f5e5890872a22192c4cc1ebc64804aaae22&amp;dn=Skyrim+Modded+Game+Save+%28Xbox+360%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Neoleviathan","files":1,"time":1373886995,"description":"Before you start download and install a program called Horizon. You will need this to explore your Xbox 360 files. \n\nYou will start in a room with different chests that contain all the items in the game. You will be able to come back to this room anytime\n\nThis Mod will get you:\n\nUnlimited Money\nUnlimited Stamina\nUnlimited Carry Weight\nUnlimited Health\nUnlimited Dragon Souls\nAll Spells \nAll Items\nAll Locations\nAll your shouts should be maxed. If its not then that's where the Unlimited Dragon Souls will come in handy.\n\n\n\nTo play on the modded character do the following:\n\n1. Insert flash drive to Xbox 360 and make it compatible \n\n2. Make A game save that you wont need in the future in any game and move to flash drive\n\n3. Put flash drive back into your computer and open up Horizon. You do not need to update Horizon or get Horizon Diamond to do this. \n\n4. Along the top of Horizon you will see multiple tabs. Click on the one that says tools and then Device explorer. This will open up a tab to the side (Unless its already open). \n\n5. Click on the tab that says games and then find the game that you created your unneeded game save in and click on it. \n\n6. Take the game save and drag it into the middle of Horizon (The grey area). Move it a bit to the side so you have more space.\n\n7. Find the modded Skyrim game save from this download and drag that into the Horizon as well. \n\n8. Copy your Profile ID, Device ID and Console ID from your unneeded game save to the modded Skyrim game save.\n\n9. once that is done you can close the unneeded game save but keep the modded Skyrim one open. On the Modded Skyrim one click Save, rehash, and resign and then save to Device and Select your flash drive. If anything comes up click Yes Or Ok.\n\n10. When its done, take your Flash drive out and put it back into your Xbox 360. Start up Skyrim and when it asks you to select storage device choose your Flash Drive.\n\n11. open up the game save that says (Save 24 - nordm god nospeed.exs) or something similar. \n\n12. Enjoy your delicious mods.\n\n\n ","torrent":{"xt":"urn:btih:07239f5e5890872a22192c4cc1ebc64804aaae22","amp;dn":"Skyrim+Modded+Game+Save+%28Xbox+360%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07239f5e5890872a22192c4cc1ebc64804aaae22","infoHashBuffer":{"type":"Buffer","data":[7,35,159,94,88,144,135,42,34,25,44,76,193,235,198,72,4,170,174,34]},"announce":[],"urlList":[]}}