{"title":"Sweet Smell of Success 1957 BrRip Avi Lee1001","uid":9826149,"size":1554448072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:085c96eaeb072c0f46304040165c11cd159ae671&amp;dn=Sweet+Smell+of+Success+1957+BrRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"xultfoad","files":2,"time":1395782154,"description":"Sweet Smell of Success 1957 BrRip Avi Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0051036/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0051036/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Sweet_Smell_of_Success&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Sweet_Smell_of_Success&lt;/a&gt;\nFor his American debut, Ealing director Mackendrick upped the ante on the palpable darkness that had informed his gently anti-social comedies such as &quot;The Lady Killers&quot;. His work dared to expose the rotten core at the heart of Broadway and the American entertainment press industry.\n\nErnest Lehman and Clifford Odets' wonderfully sharp script pulls no punches, while James Wong Howe's stunning film noir cinematography (the streets of New York rarely looked so mean) and Elmer Bernstein and Chico Hamilton's swinging score provides pleasure aplenty.\n\nBut the real muscle of the film is the bristling lead performances: Lancaster, cold, cruel, and cynical and Curtis (rarely better), blinded by ambition, and ravenous for the success of the title. A powerful mediation on greed, power, and immorality, &quot;Sweet Smell Of Success&quot; is a magnificent, sobering work with a heart of darkness. \n\nThe two men in &quot;The Sweet Smell of Success&quot; relate to each other like junkyard dogs. One is dominant, and the other is a whipped cur, circling hungrily, his tail between his legs, hoping for a scrap after the big dog has dined. The dynamic between a powerful gossip columnist and a hungry press agent, is seen starkly and without pity. The rest of the plot simply supplies events to illustrate the love-hate relationship.\n\nWhen &quot;The Sweet Smell of Success&quot; was released in 1957, it was seen as a thinly-veiled attack on Walter Winchell, who for decades had been the most famous and reviled gossip columnist in America. Forty years later Winchell is mostly forgotten (he died in 1972), but the film lives on--sharp-edged, merciless. The performances by Burt Lancaster and Tony Curtis have not dated or grown soft; although both men were dismissed as studio stars at the time, can we think of a &quot;serious actor&quot; who could have played either role so well?\n\nA film noir from the Ealing funny man? But Mackendrick's involvement with cosy British humour was always less innocent than it looked: remember the anti-social wit of The Man in the White Suit, or the cruel cynicism of The Ladykillers? Sweet Smell of Success was the director's American debut, a rat trap of a film in which a vicious NY gossip hustler (Curtis) grovels for his 'Mr Big' (Lancaster), a monster newspaper columnist who is incestuously obsessed with destroying his kid sister's romance... and a figure as evil and memorable as Orson Welles in The Third Man or Mitchum in The Night of the Hunter. The dark streets gleam with the sweat of fear; Elmer Bernstein's limpid jazz score (courtesy of Chico Hamilton) whispers corruption in the Big City. The screen was rarely so dark or cruel. \n\nThe film is a masterpiece, intelligent Hollywood cinema at its best. \nSizzling dialogue, incendiary performances. \nTony Curtis' greatest performance.\n\nVIDEO\nSize.... 1.44gb\nDuration.... 01:36:40\nCodec.... divx\nFrame Width..... 848\nFrame Height.... 508\nData Rate.... 2015kbps\nFrame Rate.... 23 F/S\nAUDIO\nBit Rate.... 128kbps.... MP3\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:085c96eaeb072c0f46304040165c11cd159ae671","amp;dn":"Sweet+Smell+of+Success+1957+BrRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085c96eaeb072c0f46304040165c11cd159ae671","infoHashBuffer":{"type":"Buffer","data":[8,92,150,234,235,7,44,15,70,48,64,64,22,92,17,205,21,154,230,113]},"announce":[],"urlList":[]}}