{"title":"The Homoerotics of Orientalism by Joseph Allen Boone","uid":9705581,"size":64813190,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:08ef164956a9343ddb67116caf6726efe624e49e&amp;dn=The+Homoerotics+of+Orientalism+by+Joseph+Allen+Boone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sidmal","files":-1,"time":1394057590,"description":"\nThe Homoerotics of Orientalism by Joseph Allen Boone\n English | 2014 | ISBN: 0231151101 | ISBN-13: 9780231151108 | 520 pages | PDF | 61,8 MB\n\n One of the largely untold stories of Orientalism is the degree to which the Middle East has been associated with &quot;deviant&quot; male homosexuality by scores of Western travelers, historians, writers, and artists for well over four hundred years. And this story stands to shatter our preconceptions of Orientalism.\n\n To illuminate why and how the Islamicate world became the locus for such fantasies and desires, Boone deploys a supple mode of analysis that reveals how the cultural exchanges between Middle East and West have always been reciprocal and often mutual, amatory as well as bellicose. Whether examining European accounts of Istanbul and Egypt as hotbeds of forbidden desire, juxtaposing Ottoman homoerotic genres and their European imitators, or unlocking the homoerotic encoding in Persian miniatures and Orientalist paintings, this remarkable study models an ethics of crosscultural reading that exposes, with nuance and economy, the crucial role played by the homoerotics of Orientalism in shaping the world as we know it today.\n\n A contribution to studies in visual culture as well as literary and social history, The Homoerotics of Orientalism draws on primary sources ranging from untranslated Middle Eastern manuscripts and European belles-lettres to miniature paintings and photographic erotica that are presented here for the first time.\n\n","torrent":{"xt":"urn:btih:08ef164956a9343ddb67116caf6726efe624e49e","amp;dn":"The+Homoerotics+of+Orientalism+by+Joseph+Allen+Boone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08ef164956a9343ddb67116caf6726efe624e49e","infoHashBuffer":{"type":"Buffer","data":[8,239,22,73,86,169,52,61,219,103,17,108,175,103,38,239,230,36,228,158]},"announce":[],"urlList":[]}}