{"title":"American Idol Greatest Moments 320cbr Kelly Nikki Justin Ryan Ta","uid":9431651,"size":124512910,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:093756c862de530b941780b8f245776b3af19ea1&amp;dn=American+Idol+Greatest+Moments+320cbr+Kelly+Nikki+Justin+Ryan+Ta&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"Big-Papi","files":-1,"time":1388819291,"description":"Source: 2002 CD\n\nAmerican Idol Greatest Moments 320cbr (Big Papi) 2002 Kelly Nikki Justin Ryan Tamyra\n\n\n\n\nTracks\n\n1. (You Make Me Feel Like A) Natural Woman - Kelly Clarkson\n2. Respect - Kelly Clarkson\n3. For Once In My Life - Justin Guarini\n4. Get Here - Justin Guarini\n5. Piece Of My Heart - Nikki McKibbin\n6. A House Is Not a Home - Tamyra Gray\n7. Lately - RJ Helton\n8. Ain't No Sunshine - Christina Christian\n9. If You Really Love Me - Ryan Star\n10. My Cherie Amour - A.J. Gill\n11. I'll Be - E.J. Day\n12. Easy - Jim Verraros\n13. California Dreamin' - The Finalists\n14. A Moment Like This (Bonus Track) - Kelly Clarkson\n15. Before Your Love (Bonus Track) - Kelly Clarkson\n-\n-\n-\nBy A Customer\n...The people on this CD went threw hell to get as far as they did, so wether you like them or not, you have to give credit where credit is due.\n1. Natural Woman-Kelly Clarkson- Her live performance rocked the house and the cd track was no exception. Let's face it the girl can blow! The only disapointment was I really wanted to hear the Mariah Carey high note on the cd (like she did on the show) but they toned it down a bit.\n\n2. Respect-Kelly Clarkson- again, awesome job but I feel that her live performance of this song is way better than the cd song.\n\n3.For Once in My Life-Justin Guarini-I think he is a great live performer. He has excellent stage presence and he is totally at home on stage, the cd makes him sound so much better than his live performances. He did a great job on this song.\n\n4.Get Here-Justin Guarini- Always loved it when he performed this song and the cd version is great. He sounds completly professional,again great job.\n\n5. Piece of my Heart- Nikki McKibbin-not a big Nikki fan. I feel to appreciate her voice you'd have to catch her singing in the shower. Did not like the song, a little to rough sounding for me but out of everyone on the show, no one handled Simon's critisicm better than she did. She did her thing, and I respect that, just have never really liked her voice.\n\n6. A house is not a home- Tamayra Gray- this chick is going places. She ripped this song up and made it her own. I think that America screwed up when they voted her off but hey that is the way it goes, nontheless she performed this song beautifully!\n\n7. Lately-R.J. Helton- what a cutie!! I always liked him. The song on the cd wasn't the best, but his voice is real pure and he never has to strain to hit the notes.\n\n8. Ain't no Sunshine-Christina Christian- By far my favorite song on the entire album.\n9. If you really love me-Ryan Starr- hated it.To me it sounds like she alters her voice into something it's really not. She slurs on the word &quot;clearly&quot; in the middle of the song and it sounds like she has a bull in her throat, I just wish that she would sing her age.\n\n10.My Chere Amor-A.J. Gill-I'm sure he has a heart of Gold but it's a little to &quot;Backstreet&quot; for me. Wasn't crazy about this song or his singing.\n\n11.I'll Be- E.J. Day- What was America thinking when they voted off E.J.? He was by far the best male singer of the group. He rocked this song and I like it better than the original. He was underestimated and I think that if he would have gotten past the first week, he would have been the one standing next to Kelly at the end.\n\n12. Easy-Jim Veraross- Simon was right when he said Jim was out of his league- His top ten spot definitly could have gone to someone else. He just doesn't have the range like the others and although he sounds okay on the cd, it just didn't do much for me.\n\n13. California Dreaming-Group- Would have rather heard &quot;Joy to the World&quot; but I liked the harmonies and I think that they sing good together, very impressed by the song.\n\n14. A Moment Like This-Kelly Clarkson- this song was made for her. Her range and tone is unbelivable and this song gives me goose bumps.\n\n15. Before your Love-Kelly Clarkson- this girl could sing the back of a Corn Flakes Box and it would probably make it to number 1. I like this song even better than &quot;A Moment Like This&quot; and I am so glad that America voted her as the American Idol","torrent":{"xt":"urn:btih:093756c862de530b941780b8f245776b3af19ea1","amp;dn":"American+Idol+Greatest+Moments+320cbr+Kelly+Nikki+Justin+Ryan+Ta","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"093756c862de530b941780b8f245776b3af19ea1","infoHashBuffer":{"type":"Buffer","data":[9,55,86,200,98,222,83,11,148,23,128,184,242,69,119,107,58,241,158,161]},"announce":[],"urlList":[]}}