{"title":"Darkdawn Encounters APK","uid":9300068,"size":44640738,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:09c00b46af0bd6a4926c2e3919a2d2f0a5a1a7c6&amp;dn=Darkdawn+Encounters+APK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"machos213","files":1,"time":1386227765,"description":"Darkdawn: Encounters is a game of 3D, tactical starship combat. Captain frigates, cruisers, and battleships into combat with enemy fleets. Fight off multiple enemies as you angle your shields to meet the onslaught, and return fire with your own powerful weapon batteries. Outfit your ship with secondary armaments such as missiles and particle beams, and install advanced equipment, like engine boosters and the exotic overshield. Then take the battle to the enemy! Learn their strengths and, and blast them where their defenses are weak. \nDarkdawn: Encounters has been designed to provide deep, tactical combat while still being streamlined for short play sessions and touch controls. You are a starship captain, and quick decisions will serve you better than twitchy fingers as you take command of a massive Rampart-class battleship. But make no mistake, this is no &quot;tap and watch&quot; game; it's your hands on the controls, captain.\nEARLY ACCESS INFO: Darkdawn: Encounters is still in active development. Over the coming months, expect some balance changes as we incorporate player feedback, as well as add additional content culminating with the 1.0 &quot;Launch Edition&quot;, which will include a multi-mission story campaign. \nIf you have any concerns and/or to make bug reports, please visit www.darkdawn.co/forum/\nWe will do our best to assist you!\n\nRequires Android: 2.3 and Up\n\nVersion: 0.6b \n\nseed and enjoy\n\na comment on my torrents would be nice\n\ninstall and play","torrent":{"xt":"urn:btih:09c00b46af0bd6a4926c2e3919a2d2f0a5a1a7c6","amp;dn":"Darkdawn+Encounters+APK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09c00b46af0bd6a4926c2e3919a2d2f0a5a1a7c6","infoHashBuffer":{"type":"Buffer","data":[9,192,11,70,175,11,214,164,146,108,46,57,25,162,210,240,165,161,167,198]},"announce":[],"urlList":[]}}