{"title":"Maaf Jika Aku Tak Sempurna- Lana, Acik -Kaki Novel- ebook","uid":8141928,"size":966214,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0aaf9b6ded5e1d624f65b4c876f977a7c26f34bf&amp;dn=Maaf+Jika+Aku+Tak+Sempurna-+Lana%2C+Acik+-Kaki+Novel-+ebook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1360833476,"description":"Melina adalah seorang gadis kota yang baru meningkat dewasa. Kehidupannya dipenuhi dengan perkara yang mengasyikkan sehingga dia lupa akan dosa dan pahala. Sikapnya itu telah menimbulkan rasa gundah dalam hati kedua ibu bapanya. Dalam terpaksa dan rasa malu papanya, Datuk Zakri telah meminta jasa baik Luqman untuk membantunya mengawasi setiap tindak-tanduk Melina. Setiap hari pasti ada sahaja pertengkaran yang berlaku antara mereka. Perbezaan cara hidup dan latar belakang antara Melina dan Luqman boleh diibaratkan bagai langit dengan bumi. Sebelum Datuk Zakri menghembuskan nafas yang terakhir, beliau telah menitipkan wasiat kepada bapa Luqman, Rashid. Atas dasar wasiat dan janji oleh kedua ibu bapa Luqman dan Melina, mereka ditemukan dalam satu ikatan suci yang tidak pernah mereka setujui. Walaupun ikatan perkahwinan itu dibina tanpa rasa cinta di hati, namun Luqman tetap menerima Melina seadanya sebagai seorang isteri. Dari hari ke hari, rasa benci yang selama ini menguasai kedua hati kini sudah bertukar kepada rasa cinta dan sayang yang tidak boleh dipisahkan lagi. Setelah rasa bahagia dikecapi, tiba pula badai yang menguji kesabaran kedua hati. Satu per satu dugaan datang menguji kasih sayang kedua insan ini. Mampukah mereka mengharungi segala dugaan ini? Mampukah mereka mempertahankan ikatan kasih suci yang sudah terpatri?","torrent":{"xt":"urn:btih:0aaf9b6ded5e1d624f65b4c876f977a7c26f34bf","amp;dn":"Maaf+Jika+Aku+Tak+Sempurna-+Lana%2C+Acik+-Kaki+Novel-+ebook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aaf9b6ded5e1d624f65b4c876f977a7c26f34bf","infoHashBuffer":{"type":"Buffer","data":[10,175,155,109,237,94,29,98,79,101,180,200,118,249,119,167,194,111,52,191]},"announce":[],"urlList":[]}}