{"title":"EnigmaT Set Rips { Cuts } - September 19th, 2013","uid":8936805,"size":886612005,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0b9ab03926ed70e7524dde07cb82a1cade02a1ec&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+19th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":99,"time":1379586394,"description":"5th Dimension - Hypnotical Fusion (Original Mix) (Cut From OzzyXPM Set)-enTc.mp3\nAfternova - Into the Sky (Original Mix) (Cut From Uplift Set)-enTc.mp3\nAkira Kayosa &amp; Hugh Tolland - Piha (Daniel Skyver Remix) (Cut From Saux Set)-enTc.mp3\nAl Sandu - Sartoris (Cut From Rank 1 Set)-enTc.mp3\nAlae Khaldi - Tangler (Cut From Rank 1 Set)-enTc.mp3\nAlter Future - Special Thing (Cut From Mad-Core Set)-enTc.mp3\nAndy Moor feat. Carrie Skipper - Elysian Fields (Mike Foyle Remix) (Cut From Rank 1 Set)-enTc.mp3\nAriel and Danilo - Shock Time (Cut From Lange Set)-enTc.mp3\nArmin van Buuren - Pulsar (Nurettin Colak Remix) (Cut From OzzyXPM Set)-enTc.mp3\nAxwell &amp; Sick Individuals feat Taylr Renee - I Am (Original Mix) (Cut From Shiver Set)-enTc.mp3\nBassjackers - Zing (Cut From W&amp;W Set)-enTc.mp3\nBlue Twinkle - Last Promise (Hypaethrame Remix) (Cut From Saux Set)-enTc.mp3\nBoyan &amp; Boyer - Swagger (Cut From Andi Set)-enTc.mp3\nBrainbug - Nightmare (Lee John 2013 Remix) (Cut From Jules Set)-enTc.mp3\nBrian Flinn - Windmill (Original Mix) (Cut From El Jay Set)-enTc.mp3\nCassius - Sound of Violence (Eddie Thoneick Anthem Mix) (Set Rip)-enTc.mp3\nChris Cockerill feat. Karen - Chasing Stars (Photographer Remix) (Cut From Cold Set)-enTc.mp3\nChris North - For The Moment (Cut From A&amp;F Set)-enTc.mp3\nCosmic Heaven - Unforgettable Moments (Hypaethrame Remix) (Cut From Muhib Set)-enTc.mp3\nDaddy's Groove feat. Mindshake - Surrender (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nDamian Wasse - My Heart (Astuni &amp; Manuel Le Saux Re-Lift) (Cut From Saux Set)-enTc.mp3\nDaniel Skyver - Astronomical (Beatsole Intro Mix) (Cut From Luke Terry Set)-enTc.mp3\nDaniel Skyver - Astronomical (Beatsole Remix) (Cut From Uplift Set)-enTc.mp3\nDaniel Skyver - Astronomical (Tommy Johnson Remix) (Cut From Anderson Set)-enTc.mp3\nDanny Howard - Spire (Cut From Jules Set)-enTc.mp3\nDave Cold - Waku Doki (Original Mix) (Cut From First Effect Set)-enTc.mp3\nDeep Voices - De-Tune (Set Rip)-enTc.mp3\nDeep Voices feat. Alexander KG Klaus - Words Don't Cry (Beach Mix) (Set Rip)-enTc.mp3\nDelAir - Affection (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDimitri Vegas &amp; Like Mike vs. Sander Van Doorn - Project T (Martin Garrix Remix) (Cut From W&amp;W Set)-enTc.mp3\nDriftmoon - Mesmerized (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nEstiva - Hippodrop (Original Mix) (Cut From Tritonal Set)-enTc.mp3\nFreefall feat. Jan Johnston - Skydive (I Feel Wonderful) (Philip Estevez Remix) (Cut From Healy Set)-enTc.mp3\nFrench Skies - Blaster (Abandoned Rainbow Remix) (Cut From El Jay Set)-enTc.mp3\nFull Tilt - Ignite (Cut From O'Neil Set)-enTc.mp3\nGreenflash - Bitches &amp; Money (Cut From Ferry Set)-enTc.mp3\nHypaethrame - Last Shadow (Reiklavik Remix) (Cut From Sty Set)-enTc.mp3\nID - Noise (Cut From W&amp;W Set)-enTc.mp3\nJ Michael Kober - Chugger (Original Mix) (Cut From Grandaddy Set)-enTc.mp3\nJohn Ashby - Kordz (Cut From O'Neil Set)-enTc.mp3\nJohn Christian - Flight 643 (Cut From W&amp;W Set)-enTc.mp3\nJohn Newall - Here For You (Cut From Lynam Set)-enTc.mp3\nJonathan Carvajal - Spring Valley (Cut From A&amp;F Set)-enTc.mp3\nJordi Roure pres. Chene &amp; Ross - Enterprise (Original Mix) (Cut From Tayle Set)-enTc.mp3\nJulie Thompson &amp; Super8 &amp; Tab - Your Secret's Safe (Andy Duguid Remix) (Set Rip)-enTc.mp3\nKoen Groeneveld - Jetblast (Cut From W&amp;W Set)-enTc.mp3\nLee Miller - Black Light (Casey Rasch Remix) (Cut From El Jay Set)-enTc.mp3\nMajor Lazer - Bubble Butt (Dada Life Remix) (Cut From W&amp;W Set)-enTc.mp3\nManu Riga - Cimmerian (van Bellen Remix) (Cut From Solarstone Set)-enTc.mp3\nMatthew Norrs - Sunlight (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMauxis - Dreams Come True (Original Mix) (Cut From Coastline Set)-enTc.mp3\nMaxim Klein - Sunday Night (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMcAree &amp; Clancy - This Is Permanent (Cut From A&amp;F Set)-enTc.mp3\nMike Meade - Sacred Spaces (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMoxa - Dreamcatcher 2013 (Ambu-Lans &amp; Demunck Remix) (-OvErSpAmMeD- Cut From Sty Set)-enTc.mp3\nMoxa - Dreamcatcher 2013 (Simmon G Remix) (Cut From El Jay Set)-enTc.mp3\nNaughty Boy feat. Sam Smith - La La La (Maor Levi Bootleg Mix) (Cut From W&amp;W Set)-enTc.mp3\nNeologic - Long Ride (Cut From Koglin Set)-enTc.mp3\nNERVO &amp; Ivan Gough feat. Beverley Knight - Not Taking This No More (Cut From Xabi Set)-enTc.mp3\nNicky Romero, Sunnery James &amp; Ryan Marciano - Jack To The Sound Of The Underground (Cut From First State Set)-enTc.mp3\nNigel Good - Come Home (LTN Remix) (Cut From Shiver Set)-enTc.mp3\nNordic Coast - Sunrise in Brisbane (Original Emotional Mix) (Cut From El Jay Set)-enTc.mp3\nO.B.M Notion with Mostfa &amp; Mostfa - The Land Of Myths (Sunflare Remix) (Cut From A&amp;F Set)-enTc.mp3\nPaul Thomas &amp; Labcraft - Going Back (Cut From Koglin Set)-enTc.mp3\nPhilip Mayer - Centaur (Original Mix) (Cut From Suzy Set)-enTc.mp3\nPlatinum Monkeys - Black Sun (Cut From M.PRAVDA Set)-enTc.mp3\nPurple Stories - Metro 244 (Cut From Mad-Core Set)-enTc.mp3\nRikkaz feat. Hannah Ray - Waste It (Cut From Koglin Set)-enTc.mp3\nRodrigo Deem &amp; Vitodito - Cheaters (Original Mix) (Cut From Anderson Set)-enTc.mp3\nRymania - Pure Emotion (Original Mix) (Cut From Uplift Set)-enTc.mp3\nSaman &amp; Farzam vs Venom - Project Persia (Original Mix) (Cut From Saux Set)-enTc.mp3\nSander Van Dien - Drop Tech Now (Original Mix) (Cut From Shiver Set)-enTc.mp3\nSartek - Apocalypse (Cut From First State Set)-enTc.mp3\nSava - Volga (Original Mix) (Cut From Uplift Set)-enTc.mp3\nSettleR - Antares (Dave Cold Remix) (Cut From Cold Set)-enTc.mp3\nShermanology feat. Amba Shepherd - Who We Are (Cut From W&amp;W Set)-enTc.mp3\nSimmon G - Illusions (Moxa Remix) (Cut From Jerom Set)-enTc.mp3\nSimon Moon - Polish Langauge (Akku Remix) (Cut From Ciacomix Set)-enTc.mp3\nSmith &amp; Pledger pres. White Water feat. Melinda Gareh - The Unknown (Bryan Kearney Rework) (Cut From Lynam Set)-enTc.mp3\nSolar Sky - Star Traveling (Original Mix) (Cut From Muhib Set)-enTc.mp3\nSpencer &amp; Hill - Washed Out Road (First State Remix) (Cut From First State Set)-enTc.mp3\nStevy Forello - Shaded Starlight (Las Salinas Remix) (Cut From Genix Set)-enTc.mp3\nStevy Forello - Shaded Starlight (Original Mix) (Cut From Tayle Set)-enTc.mp3\nSunlight Project - Stars (Jon Medina Remix) (Cut From Anderson Set)-enTc.mp3\nSunny Lax - Excelsior (Original Mix) (Cut From Anderson Set)-enTc.mp3\nSunny Lax - Marvel (Cut From Koglin Set)-enTc.mp3\nSunstate - Panama (Mac &amp; Monday Remix) (Cut From Sty Set)-enTc.mp3\nTalla 2XLC - Shine (Daniel Kandi's Proglift 2013 Rewamp) (Cut From Kandi Set)-enTc.mp3\nTangle - Impulse (Original Mix) (Cut From El Jay Set)-enTc.mp3\nTecnomind - Nonstop Dreaming (Orchestral Intro Mix) (Cut From Langham Set)-enTc.mp3\nTellur, Sound Quelle - Integra (Original Mix) (Cut From Shiver Set)-enTc.mp3\nThomas Newson &amp; John Dish - Kalavela (Cut From W&amp;W Set)-enTc.mp3\nTilted Horizon - Elevate (Original Mix) (Cut From Grandaddy Set)-enTc.mp3\nTuomas.L - Northern Sky (Maxima Remix) (Cut From Cold Set)-enTc.mp3\nVadim Soloviev - Can't Get Enough (Original Mix) (Cut From Anderson Set)-enTc.mp3\nVicetone feat. Daniel Gidlund - Chasing Time (Cut From W&amp;W Set)-enTc.mp3\nVince Aoun - Rumble (Original Mix) (Cut From Ekman Set)-enTc.mp3\nWalden - First Day (Cut From First State Set)-enTc.mp3\nYuji Ono - Far East (Cut From O'Neil Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:0b9ab03926ed70e7524dde07cb82a1cade02a1ec","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+19th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b9ab03926ed70e7524dde07cb82a1cade02a1ec","infoHashBuffer":{"type":"Buffer","data":[11,154,176,57,38,237,112,231,82,77,222,7,203,130,161,202,222,2,161,236]},"announce":[],"urlList":[]}}