{"title":"The Garbo Silent Collection Disk 2  - The Mysterious Lady (1928)","uid":9321061,"size":4561164288,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0c160cf2c2357158805c117569ffac8c635c6688&amp;dn=The+Garbo+Silent+Collection+Disk+2++-+The+Mysterious+Lady+%281928%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1386552843,"description":"The Garbo Silent Collection Disk 2 - The Mysterious Lady (1928) - DVD5 Silent Classic [DDR]\n\nThe Mysterious Lady (1928) is an MGM silent film starring Greta Garbo, Conrad Nagel, and Gustav von Seyffertitz, directed by Fred Niblo, and based on the novel War in the Dark by Ludwig Wolff.\n\nCAST:-\nGreta Garbo as Tania Fedorova\nConrad Nagel as Captain Karl von Raden\nGustav von Seyffertitz as General Boris Alexandroff\nAlbert Pollet as Max Heinrich\nEdward Connelly as Colonel Eric von Raden\nRichard Alexander as General's Aide\n\nDirected by Fred Niblo\nWritten by Bess Meredyth, Marian Ainslee and Ruth Cummings (titles), Ludwig Wolff \n\nMOVIE REVIEW:- The Mysterious Lady (1928) SIlent Film\nIn Vienna, Captain Karl von Raden (Conrad Nagel) purchases a returned ticket to a sold-out opera and finds himself sharing a loge with a lovely woman (Greta Garbo). Though she repulses his first advance, she does spend an idyllic day with him in the countryside.\n\nKarl is called away to duty, however. Colonel Eric von Raden (Edward Connelly), his uncle and the chief of the secret police, gives him secret plans to deliver to Berlin. He also warns his nephew that the woman is Tania Fedorova, a Russian spy. Tania comes to him aboard the train, professing to love him, but he tells her he knows who she is. Dejected, she leaves.\n\nThe next morning, when Karl wakes up, he finds the plans have been stolen. As a result, he is sentenced to military degradation and imprisonment for treason. However, Colonel von Raden visits him in prison and arranges for his release. He sends his nephew to Warsaw, posing as a Serbian pianist, to seek out the identity of the real traitor and thus exonerate himself.\n\nIn Warsaw, by chance, Karl is asked to play at a private party where he once again crosses paths with Tania. She is being escorted by General Boris Alexandroff (Gustav von Seyffertitz), the infatuated head of the Russian Military Intelligence Department. Foolhardily, Karl plays a tune from the opera they attended together. She recognizes it, but does not betray him. As the party goers are leaving, she slips away for a few stolen moments with her love. The jealous Alexandroff suspects their feelings for each other. He hires Karl to play the next day at a ball he is giving at his mansion for Tania's birthday.\n\nWhile Alexandroff and Tania are alone in his home office, he receives a parcel containing the latest secrets stolen by the traitor, whom he casually identifies as Max Heinrich. Later, Tania steals the documents, gives them to Karl, and sends him out via a secret passage. However, it is all a trap. Alexandroff comes in and tells Tania that what she stole was mere blank paper; he shows her the real documents. He pulls out a gun and announces that he intends to use it on Karl, who has been captured outside. She struggles with Alexandroff and manages to fatally shoot him; the sound goes unheard amidst the merriment of the party. When the guards bring the prisoner, she pretends the general is still alive and wants to see him alone. She and Karl escape with the incriminating documents and get married.\n\nSYNOPSIS:-The Mysterious Lady (1928) SIlent Film\nAustrian Captain Karl von Raden attends the opera one evening, and meets Tania. After the performance, he takes her home, and the two of them spend the next day on a romantic outing. That evening, Karl must deliver some important plans to Berlin. Just before boarding his train, he learns that Tania is really a Russian spy. She comes to see him aboard the train, and admits that she set things up on purpose so as to meet him, but she also insists that she truly has fallen in love with him. When Karl rebuffs her coldly, she steals the plans, which leads to him being court-martialed and imprisoned. Karl's influential uncle is able to provide him with one last chance to clear his name.\n\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 4999 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: Silent with English Intertitles\nRunTime 96 mins\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 96 mins","torrent":{"xt":"urn:btih:0c160cf2c2357158805c117569ffac8c635c6688","amp;dn":"The+Garbo+Silent+Collection+Disk+2++-+The+Mysterious+Lady+%281928%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c160cf2c2357158805c117569ffac8c635c6688","infoHashBuffer":{"type":"Buffer","data":[12,22,12,242,194,53,113,88,128,92,17,117,105,255,172,140,99,92,102,136]},"announce":[],"urlList":[]}}