{"title":"Douglass - AIDS &amp; Biological Warfare (2003)","uid":4981869,"size":1016102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ef262132c9f0f68c050760e396075e8c127dce4&amp;dn=Douglass+-+AIDS+%26+Biological+Warfare+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1246367920,"description":"This is William Campbell Douglass's shocking book AIDS and Biological Warfare (2003) which reveals what is really going on behind the scenes of the greatest biological disaster in the history of mankind - AIDS. It covers the history of plagues from the past to today's global confrontation with AIDS - the prince of plagues. Completely documented, it helps you make your own decisions about how to survive in a world ravaged by this horrible plague. You will learn that AIDS is not a naturally occuring disease process as you have been led to believe, but a man-made biological nightmare that has been unleashed and is now threatening the very existence of human life on the planet. There is a smoke screen of misinformation clouding the AIDS issue. Now, for the first time, learn the truth about the nature of the crisis our planet faces: its origin -- how AIDS is really transmited and alternatives for treatment. Find out what they are not telling you about AIDS and biological warfare, and how to protect yourself and your loved ones. AIDS is a serious problem worldwide, but it is no longer the major threat. You need to know the whole story. To protect yourself, you must know the truth about biological warfare. AIDS and Biological Warfare starts out with a historical perspective about disease and how it shaped history. As you continue reading and learning about the modern science of biological warfare, you'll be amazed with the deadly truth and the lies that we have been told about HIV and AIDS. 255 pages, few pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:0ef262132c9f0f68c050760e396075e8c127dce4","amp;dn":"Douglass+-+AIDS+%26+Biological+Warfare+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ef262132c9f0f68c050760e396075e8c127dce4","infoHashBuffer":{"type":"Buffer","data":[14,242,98,19,44,159,15,104,192,80,118,14,57,96,117,232,193,39,220,228]},"announce":[],"urlList":[]}}