{"title":"Etoile De Dakar - Once Upon A Time In Senegal [FLAC] TQMP","uid":5764198,"size":983049882,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0faa2b88a971cfadfb6be80c8d2f9c48d2bc7c53&amp;dn=Etoile+De+Dakar+-+Once+Upon+A+Time+In+Senegal+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pastafari","files":-1,"time":1281825424,"description":"Etoile de Dakar featuring Youssou N'Dour \nOnce Upon a Time in Senegal: The Birth of Mbalax 1979-1981\n2010\n\n\nFor three amazingly fertile years Etoile de Dakar held the pulse of a nation. Their \nstyle was a brash blend of African, Latin and psychedelia that later became known as mbalax. Their recordings were instant hits and their shows the stuff of legend.\n-- CD liner notes.\n\n\nBrought to you by TQMP\nThe Quality Music Project\n\n\nOn one level the 2CDs of 'Once Upon A Time In Senegal' form a chapter in the story of who Youssou N'Dour is and how he got there. But on another they show him simply as an equal member of a band - a band in the right place at the right time and doing the right things. That brief but vital moment in time is captured in these 23 tracks selected from the cassettes that Etoile de Dakar recorded between 1979 and 1981. Several have never been released outside of Senegal, and all have been sensitively re-mastered from the earliest available audio source. These are the best sounding recordings of this material available - bar none!\n-- sternsmusic.com\n\n\nReview --\nThe birth of mbalax in Senegal towards the close of the 1970s, and a 2010 highlife/funk hybrid from south London, show how the embrace of imported styles by African musicians can enrich the continent's music.\n\nDigging into Senegalese singer Youssou N'Dour's back catalogue is a fun exercise on two fronts. The recordings he made with the original Etoile de Dakar lineup between 1979-81 are a delight in their own right; and listening to them again in 2010 demonstrates how far N'Dour has travelled over the last 30 years. The punky, psychedelia-drenched proto-mbalax heard on Once Upon a Time in Senegal: The Birth of Mbalax 1979-1981 is in almost total contrast to the nuanced elegance of Egypt (Nonesuch, 2004) or the bland and over-polished vibe of Dakar-Kingston (Decca, 2010).\n\nAnd yet there have been some constants over the decades. Etoile de Dakar's lead guitarist, Jimi Mbaye, and tama drummer, Assane Thiam, have remained at N'Dour's side since becoming founder members of his Super Etoile de Dakar, the breakaway group he founded in 1981. Bassist Kabou Gueye was another founder member of Super Etoile; now a freelance songwriter and producer based in Dakar, he and N'Dour co-wrote the material featured on Egypt (check theclip of that wonderful album's &quot;Cheikh Ibra Fall&quot; below). Then, of course, there is N'Dour's voice, no longer as raw as in the Etoile de Dakar years, but in its maturity, still every bit as spellbinding.\n\nEtoile de Dakar had the good fortune to emerge shortly after the technology to mass produce cheap, cassette-only albums reached Senegal, enabling emerging artists to achieve some measure of independence from the old-time labels and their financiers. Etoile recorded six such albums between 1979-81: Absa Gueye, Thiapathioly, Tolou Badou N'Diaye, Lay Suma Lay, Khaley Etoile and Maleo, all self-produced and released on the Touba Auto Cassettes label. (Artists had to move fast though; official releases would be followed by even cheaper pirate versions within days).\n\nOnce Upon A Time In Senegal cherry picks all six albums, with the tracks programmed chronologically. A brash mÃƒÂ©lange of Senegambian melodies and folklore, Cuban percussion, the Senegalese tama drum (a small squeeze drum employed as a lead instrument), highlife and Latin-inspired horns, and distorted, acid rock-derived guitars?and the varied styles of lead singers N'Dour, El Hadji Faye, Eric M'Backe N'Doye and Mar Seck-Etoile's early recordings outraged Senegal's conservative musical establishment as much as they electrified the country's youth. The word mbalax was yet to be coined to describe the music, but its signature elements are all in place in these recordings.\n\nThe Sterns label's admirable collections of archive recordings from West Africa always include informative liner notes, and Mark Hudson's notes for Once Upon A Time In Senegal are no exception, putting the music into the context of its time and charting in some detail the break-up of Etoile de Dakar and the formation of Super Etoile.\n\nA word of warning, however: in basing itself on interviews with singer El Hadji Faye and guitarist Badou N'Diaye, neither of whom were invited by N'Dour to join Super Etoile, the story is inevitably unbalanced. N'Diaye left Etoile in early 1981 following a massive, dope-induced freak-out shortly before going onstage one day. He reemerged with Faye in the briefly successful rival band Etoile 2000. Both men have axes to grind, and the story would be more rounded if N'Dour and Kabou Gueye, or Jimi Mbaye and Assane Thiam, or some other combination of the four, were also heard. That said, Hudson and his fellow researcher, Katerina Loebeck, are to be congratulated on tracking down the largely forgotten Faye and N'Diaye and getting their versions of events.\n-- All About Jazz\n\n\nTrack List\nDisc 1\n01- Thiely\n02- Dom Sou Nare Bakh\n03- Esta China\n04- Mane Khouma Khol Thi Yan\n05- Jalo\n06- Absa Gueye\n07- Thiapa Thioly\n08- Dagotte\n09- Dounya\n10- Diandioli\n11- Kine Kine\n12- M'Badane\n\nDisc 2\n01- Tolou Badou N'Diaye\n02- Nit Kou N'Gnoul\n03- Yalaye Dogal\n04- My Wa Wa\n05- Lay Suma Lay\n06- Diankha Demal\n07- Khaley Etoile\n08- Sama Guenth-Gui\n09- M'Baye Gueye\n10- Titeur\n11- Maleo\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafariCubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:0faa2b88a971cfadfb6be80c8d2f9c48d2bc7c53","amp;dn":"Etoile+De+Dakar+-+Once+Upon+A+Time+In+Senegal+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0faa2b88a971cfadfb6be80c8d2f9c48d2bc7c53","infoHashBuffer":{"type":"Buffer","data":[15,170,43,136,169,113,207,173,251,107,232,12,141,47,156,72,210,188,124,83]},"announce":[],"urlList":[]}}