{"title":"Moorhuhn.Tiger.and.Chicken-HI2U","uid":8980843,"size":2114703054,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0fe66e91e523958b0ca9a0330b4ce08012fc1697&amp;dn=Moorhuhn.Tiger.and.Chicken-HI2U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1380562951,"description":"HI2U\n\nMoorhuhn: Tiger and Chicken (c) Koch Media GmbH\n\nRelease Date : 30th of September, 2013\nProtection   :\nType         : Action\nSize         : 17 x 50mb\n\nDescription\n\nCaptured and enslaved in a mine, the young grouse lives a sad\nexistence. The labor camp is rough and brutal, the grouse are\nsuppressed and forced to chickens despising work. Your task\nto find a lost artifact that gives its owner the infinite power\nof the Dragon. A cute chicken in bondage girl is the only bright\nspot of our hero. The young lady is one day in a dangerous\nsituation and while the grouse they defended it discovered\nits first combat skills\n\nIn dramatic fashion, the grouse freed from captivity and escapes\nwhile he has to leave the grouse girls. In his escape he encounters\nChi Master Ken, the manager of a monastery. Here the grouse learns\nthe arts of combat, takes on the life of the monks and matures\nto a warrior. His background and his love has never forgotten\nbut during all these years\n\nBefore the grouse can free his beloved, it must still exist many\nadventures and to take the final exams to the Shaolin monk\nNote the spirit of an ancestor nachgehend, the grouse one day\nfinds a secret hidden in the monastery, which change the fate\nof the enslaved chickens and the fulfillment of a great prophecy\nwill get the ball rolling. Can the grouse fulfill the prophecy\nand defeat the mysterious and evil terracotta king?\n\nFeatures\n\nThe legend for the first time in a big action role-playing game\nWith skill system\nLovable 3D graphics\nMany different weapons\nParts of the soundtrack was specially recorded by an orchestra\nDeveloper Deck 13, makers of Ankh and Venetica\n\nInstall\n\nUnrar, mount/burn, install. Enjoy\n","torrent":{"xt":"urn:btih:0fe66e91e523958b0ca9a0330b4ce08012fc1697","amp;dn":"Moorhuhn.Tiger.and.Chicken-HI2U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe66e91e523958b0ca9a0330b4ce08012fc1697","infoHashBuffer":{"type":"Buffer","data":[15,230,110,145,229,35,149,139,12,169,160,51,11,76,224,128,18,252,22,151]},"announce":[],"urlList":[]}}