{"title":"Jazz ~ The Modern Jazz Quartet","uid":3499113,"size":3920515211,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1097981dd860f62c440c49a561919124b49043a3&amp;dn=Jazz+%7E+The+Modern+Jazz+Quartet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"honda93","files":19,"time":1151453100,"description":"The pleasure of seeing the Modern Jazz Quartet again, in this live concert, will be tinbged with sadness for most viewers. The MJQ existed from 1952 to 1974, and again from 1981 to 1995. Over the years it took such deep root in the consciousness of jazz fans that, quite irrationally, we believed it and its members were immortal. The past few years have proved us wrong. all four of the gentlemen have left us for ever, the last being Percy Heath, who finally laid down his bass in 2005.\n\nPlease take into account that the MJQ has been probably my favorite jazz group all my life when I say this is the most enjoyable jazz concert on DVD I have ever seen.  It was expertly taped during a music festival in Freiburg Germany in l987 and memorializes the world?s longest-running jazz combo in great form. They were together for so long that some of us thought they would always be around; yet sadly all four of them have now passed on.\n\nJohn Lewis was the leader of the MJQ and composed most of the music.  He made no bones about strongly appreciating European classical music and especially Bach, and his music is full of classical forms such as fugues.  The MJQ epitomized the ?chamber jazz? style, and not only in their sound.  Lewis insisted from the start that they wear tuxedos and carry themselves onstage as if they were a string quartet.  This was criticized by some jazz aficionados but raised the MJQ in the minds of most audiences and got their more serious listening attention.  In the 50s and 60s they were right up there with the Dave Brubeck Quartet in popularity. \n\nTracks:\n\n1. &quot;Rockin&amp;#039; in Rhythm&quot;\n2. &quot;Echoes&quot;\n3. &quot;Kansas City Breaks&quot;\n4. &quot;Django&quot;\n5. &quot;Summertime&quot;\n6. &quot;Bags&amp;#039; Groove&quot;\n7. &quot;A Day in Dubrovnik&quot;\n\nLPCM Stereo - Natural sound/Music\nDolby Digital 5.1 - Natural sound/Music\nDTS 5.1 - Natural sound/MusicDolby Digital 5.1 / 2.0 Mix\n57 min Full DVD5 - 4:3 - NTSC*\n* Please note that most common DVD-Player nowadays, can play any system. So, check you player again ...\n* Neue DVD-Player koennen NTSC, SECAM oder PAL-Aufnahme spielen. Bitte testen Sie Ihre Geraete.\n* Considerad que los nuevos DVD de sobremesa pueden tratar NTSC/PAL o SECAM indistintamente.\n","torrent":{"xt":"urn:btih:1097981dd860f62c440c49a561919124b49043a3","amp;dn":"Jazz+%7E+The+Modern+Jazz+Quartet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1097981dd860f62c440c49a561919124b49043a3","infoHashBuffer":{"type":"Buffer","data":[16,151,152,29,216,96,246,44,68,12,73,165,97,145,145,36,180,144,67,163]},"announce":[],"urlList":[]}}