{"title":"Jessie J - Do It Like A Dude (Explicit Version) (Xvid-2nafish)","uid":6020459,"size":54570218,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1103d65aae01bc664f7ecae9ffb94251b689913e&amp;dn=Jessie+J+-+Do+It+Like+A+Dude+%28Explicit+Version%29+%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291787571,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:03:20\n\n[Video]\nResolution : 640x360\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 2051 Kbps\nQuality Factor : 0.30 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 44100 Hz\nBitRate : 128 Kbps\n\n\nThis video has no logos or titles and is the explicit version.\n\n\n&quot;Do It Like a Dude&quot; is a song by British recording artist Jessie J. This dance-pop track was co-written by George Astasio, Jason Pebworth, Jon Shave, Kyle Abrahams and Peter Ighile and it is receiving a positive reception from music critics. It was released in 2010 in her homeland and later in North America. It has peaked at number 25 on the UK Singles Chart.\n\nJessie J (born Jessica Cornish, 27 March 1988) is a singer/songwriter from Essex, in the United Kingdom. She is signed to the UK label Island Records and the U.S. label Lava Records, distributed by the Universal Music Group.\n\nCornish is from Essex, and acted on stage as an eleven year old in Andrew Lloyd Webber's West End production of Whistle Down the Wind. At the age of 16 she began studying at the BRIT School, and joined a girl group at the age of 17. She was signed to Gut Records, recording an album for the label, but Gut Records went bankrupt before releasing any of her music. After suffering heart trouble and a minor stroke at the age of 18 Cornish found success as a songwriter, gaining a Sony ATV publishing contract , and a co-writing the Miley Cyrus hit &quot;Party in the USA&quot; with producer Doctor Luke, and writing for Justin Timberlake, Chris Brown (with whom she toured Europe), and Christina Aguilera. She has been hailed by Timberlake as &quot;the best singer in the world right now&quot;.\n\nJessie J released her single &quot;Do It Like a Dude&quot; in the UK on 21 November 2010; where it was positively received by BBC Radio 1, who added it to their B Playlist. She claimed that she had written the song for Rihanna but decided to release it herself. The single debuted at number 25 on the UK Singles Chart. A track entitled &quot;Price Tag&quot; was promoted by Jessie on Later Live with Jools Holland on 9 November. The song is scheduled to be released as a single featuring Atlanta-based rapper B.o.B. in March 2011. Her dubut album, Who You Are, is due to be released in 2011.\n\nOn 6 December 2010, the BBC announced that Jessie J had been nominated for the BBC's Sound of 2011 poll.\n\nHer track &quot;Sexy Silk&quot; appears on the soundtrack to the 2010 comedy film Easy A. Her song &quot;Who You Are&quot; was used in the third installment of the Step Up series, Step Up 3D (2010).\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:1103d65aae01bc664f7ecae9ffb94251b689913e","amp;dn":"Jessie+J+-+Do+It+Like+A+Dude+%28Explicit+Version%29+%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1103d65aae01bc664f7ecae9ffb94251b689913e","infoHashBuffer":{"type":"Buffer","data":[17,3,214,90,174,1,188,102,79,126,202,233,255,185,66,81,182,137,145,62]},"announce":[],"urlList":[]}}