{"title":"Jesus Before Christianity [mp3] Albert Nolan - ScanSoft Daniel r","uid":8363620,"size":197008101,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:111ab7193b7326012b799202e64f4f8aa8bff9a9&amp;dn=Jesus+Before+Christianity+%5Bmp3%5D+Albert+Nolan+-+ScanSoft+Daniel+r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":41,"time":1365704256,"description":"Jesus Before Christianity - Albert Nolan - ScanSoft Daniel reads\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE UnviolentPeacemaker torrents.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?  Thanks.  UnviolentPeacemaker\n\n\nNOTICE: WHY SCREW THE PUBLISHERS, WRITERS, CREATORS?  When you have the $$$, buy this download, preferably from a locally owned store.  &quot;Universal Family&quot; is the ONLY Revolution.  Hypocrisy kills.\n\n\nNOTICE: This book is read by the HQ ELECTRONIC VOICE SCANSOFT DANIEL.  Don't like that?  Don't download it.  Don't complain.  Don't get in the way.\n\n\nThis book from the\n\nLIBRARY OF UNVIOLENT REVOLUTION - AGAPE, UNIVERSAL FAMILY\n\n'UnviolentPeacemaker' on ThePirateBay.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt;\n\nHundreds more like it, in that library UnviolentPeacemaker.\n\n\nTHOSE CLUELESS TO THE PLANETARY EMERGENCY OF IMPENDING ECOCIDE SHOULD GO ELSEWHERE.  These uploads were created for me, to equip me to Wage All-out Unviolent War for my current and future 204 billion children.  If you are looking for style over substance this site and these materials are not for you.  THE PRESENT AND FUTURE KIDS ARE SCREAMING AT US TO SAVE THEIR FUTURE, not whether there are typos, hugely rough parts, audio artifacts, pauses, footnote numbers, etc.  HAVE THE DECENCY NOT TO COMPLAIN.\n\n\nALSO, CUT ME SOME SLICK.  THIS UPLOAD WAS PREPARED ON 04.11.13, THIS DAY 14 OF MY 'ECOCIDE'S DEATH FAST, ZERO CALORIES,' RACING TO FINISH THIS PROJECT SO I CAN ABSTAIN FROM LIQUIDS AS WELL BY MIDNIGHHT SUNDAY NIGHT. GOOGLE 'start loving.' Also GOOGLE, 'tracking plan b'  So, I'm working with a 23,400 calorie deficit, and a sleep deficit the last 4 days of near 8 hrs x 4 = 32 hours, so I can get this done, before I am.  (Hmmm, you too are this committed to averting ecocide so out kids and grandkids have a Life, like you and I did, right?)\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?\n\n----------------\n\nNolan's portrait introduces readers to Jesus as He was before He became enshrined in doctrine, dogma, and ritual, a man deeply involved with the real problems of His time, which are the real problems of our time as well.\n  &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Albert_Nolan&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Albert_Nolan&lt;/a&gt;\n\nLife\n\nNolan was born in Cape Town, South Africa, as a fourth-generation South African of English descent. Reading the works of Thomas Merton, Nolan became attracted to the idea of religious life (i.e. joining a religious order). Eventually he joined the Dominican Order in 1954, and studied in South Africa and Rome, where he received a doctorate.\n\nIn the 1960s, he taught theology at the Dominican training institution in South Africa, associated with the University of Stellenbosch. In the 1970s, he became the national chaplain to the National Catholic Federation of Students.\n\nFrom 1976 to 1984, he was Vicar-General of the Dominicans in South Africa. In 1983, he was elected Master of the Order of Preachers. He however declined the office which would have meant transferring to his order's Rome headquarters, preferring to remain in South Africa during this decade of intense political and social transition. During this period he worked for the Institute for Contextual Theology, and was involved in the circle of pastors and theologians who started the process that led to the Kairos Document in 1985.\n\nIn the 1990s, as a result of his conviction that theology must come from the grassroots level and not an academic, he started a radical church magazine called Challenge, of which he was the editor for many years. From 2000-2004, Nolan served a third term as Vicar-General of the Dominicans in South Africa.\nWritings\n\nNolan became famous for his 1976 book, Jesus before Christianity, in which he presented an account of Jesus' radical involvement in the struggle for full humanity in the context of first-century Palestine: he &quot;challenged the rich to identify in solidarity with the poor, a spirituality of solidarity that resonated with white Catholics seeking a new, progressive direction&quot; (Egan 1999). The book was translated into nine languages, and a 15th anniversary edition appeared in the early 1990s.\n\nNolan published his second major work, God in South Africa in 1988. At one point during the writing process he 'went underground' to hide from the Security Forces during the State of Emergency in South Africa. God in South Africa is a primary example of contextual theology: written as a theology for that particular moment, without a claim to its possible relevance in other times and places. In 2006, Nolan published his Jesus Today: A Spirituality of Radical Freedom (Orbis Books).\t\t","torrent":{"xt":"urn:btih:111ab7193b7326012b799202e64f4f8aa8bff9a9","amp;dn":"Jesus+Before+Christianity+%5Bmp3%5D+Albert+Nolan+-+ScanSoft+Daniel+r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"111ab7193b7326012b799202e64f4f8aa8bff9a9","infoHashBuffer":{"type":"Buffer","data":[17,26,183,25,59,115,38,1,43,121,146,2,230,79,79,138,168,191,249,169]},"announce":[],"urlList":[]}}