{"title":"PSP Killzone Liberation [TANKATORRENTS-com]","uid":4730471,"size":508595302,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:11208f52a841ea28bd92a3c1be6f85103938908e&amp;dn=PSP+Killzone+Liberation+%5BTANKATORRENTS-com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iskan78","files":2,"time":1234992010,"description":"    Lang: ENG\n    * SCEA\n    * Guerrilla\n    * Sci-Fi Shooter\n    * Release: Oct 31, 2006 Ã‚Â»\n    * ESRB: Teen\n\n\n\nSEED after download\n\nvisit www tankatorrents com (for more MOVIES, GAMES, TV-SERIES)\n\n\n\nIn Killzone: Liberation, two months after the events of Killzone, most of southern Vekta is still under Helghast control. The rules of war have been cast aside with the Helghast General, Metrac, employing brutal measures in order to seize the initiative and strengthen his position further. Returning as Templar, players will be sent on a mission to undertake a covert operation to save hostages captured by Metrac, while ISA troops continue the fight for liberty.\n\nKEY FEATURES\n\n    * Unique Third Person Camera: This new intelligent camera system gives the player the best overview capturing all of the intense action, enabling them to make tactical decisions before engaging in a firefight.\n    * New and Returning Characters: The player reprises the role of the battle hardened Templar (although other familiar characters appear including Rico) as he attempts to save ISA hostages taken captive by the evil General Metrac and leads the battle to gain the liberation of Southern Vekta. The player will have to overcome all new Helghast enemies including bodyguards (complete with riot shield defence) and trained killer dogs.\n    * Missions: The fight against the new, sinister General spans over 16 missions in a variety of new environments.\n    * Weaponry: Players will be able to utilize a wide range of weaponry including sniper rifles and a crossbow with explosive tipped arrows and more.\n    * Tactical Command System: At specific points in the game, players will be able to use a new Tactical Command System to give orders to an AI buddy during frantic firefights.\n    * Vehicles: Killzone: Liberation also allows players to drive vehicles including tanks and hovercrafts to help defeat the powerful and intelligent enemy.\n    * Challenge Games: Players can compete in challenge games to sharpen their skills and earn new abilities.\n    * Multiplayer Functionality: The multiplayer functionality in Killzone: Liberation takes full advantage of the wireless capabilities of the PSP hardware, with two distinct styles of gameplay: 1) Two player cooperative gameplay in the single player mission 2) One to six player games over six multiplayer maps.\n    * Gameshare Mode: Killzone: Liberation will feature gameshare mode where players can share demo levels of the game with other PSP system owners.\n\n\n\nEnjoy :)\n\n\t","torrent":{"xt":"urn:btih:11208f52a841ea28bd92a3c1be6f85103938908e","amp;dn":"PSP+Killzone+Liberation+%5BTANKATORRENTS-com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11208f52a841ea28bd92a3c1be6f85103938908e","infoHashBuffer":{"type":"Buffer","data":[17,32,143,82,168,65,234,40,189,146,163,193,190,111,133,16,57,56,144,142]},"announce":[],"urlList":[]}}