{"title":"It Ain't Half Hot Mum - The Complete Collection DVDRip","uid":6591084,"size":24720057414,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:11f8feb4decbfed05030dae3d8dfed93a948abf4&amp;dn=It+Ain%5C%27t+Half+Hot+Mum+-+The+Complete+Collection+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sweetchuk","files":-1,"time":1312827930,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0081878/episodes&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0081878/episodes&lt;/a&gt;\n\nThis complete collection contains all eight series of It Ain\\\\\\'t Half Hot Mum, the classic BBC comedy series which follows the exploits of a Royal Artillery Concert Party in India (and later, Burma) during the Second World War.\n\nRunning from 1974 until 1981, It Ain\\\\\\'t Half Hot Mum was one of the most popular and funniest comedies on British television. David Croft and Jimmy Perry, writers of Dad\\\\\\'s Army, once again established a brilliant group of comic characters, including the bombastic, eye rolling Battery Sergeant Major \\\\\\'Ole Shutup\\\\\\' Williams; Indian Bearer Rangi Ram; drag artist Bombardier \\\\\\'Gloria\\\\\\' Beaumont; dimunitive Gunner \\\\\\'Lofty\\\\\\' Sugden with a hauntingly beautiful singing voice, as well as a fantastic cast of ensemble supporting actors.\n\nI\\\\\\'ve taken this collection directly from my DVD collection and the quality is about as good as it is likely to get - it is absolutely DVDRip quality, NOT sourced from TV episodes.\n\nThis is the first time to my knowledge that the Complete Collection of all seasons of It Ain\\\\\\'t Half Hot Mum has been presented for download anywhere, so I hope you all enjoy this legendary series ... it was always one of my personal favourites, and all I ask is that you please give consideration to seeding back to allow others the pleasure of re-living the magic of this show for years to come.\n\nI will seed this non-stop for at least 1 month ... if I see Hit &amp; Runners dominating this torrent, I will cease supporting it after that, because the spirit of this site should be sharing equitably, not being self-centred &amp; selfish.\nIf it is seeding slowly - as is expected until more seeders jump on and assist with this - please be patient. As I have stated, I will keep this seeding for at least a month, non-stop.\n\nCheers &amp; enjoy","torrent":{"xt":"urn:btih:11f8feb4decbfed05030dae3d8dfed93a948abf4","amp;dn":"It+Ain%5C%27t+Half+Hot+Mum+-+The+Complete+Collection+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11f8feb4decbfed05030dae3d8dfed93a948abf4","infoHashBuffer":{"type":"Buffer","data":[17,248,254,180,222,203,254,208,80,48,218,227,216,223,237,147,169,72,171,244]},"announce":[],"urlList":[]}}