{"title":"Cultural Contact and the Making of European Art since the Age of","uid":10003814,"size":22163050,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12eca25a0e8c3a6f95ce07aa68f3d3519bc65ab2&amp;dn=Cultural+Contact+and+the+Making+of+European+Art+since+the+Age+of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":-1,"time":1398023255,"description":"Mary D. Sheriff / University of N Carolina / 2010 / English / Pag 236 / 21MB / pdf\n\nClaire Farago, University of Colorado at BoulderJulie Hochstrasser, University of IowaChristopher Johns, Vanderbilt UniversityCarol Mavor, University of North Carolina at Chapel HillArt historians have long been accustomed to thinking about art and artists in terms of national traditions. This volume takes a different approach, suggesting instead that a history of art based on national divisions often obscures the processes of cultural appropriation and global exchange that shaped the visual arts of Europe in fundamental ways between 1492 and the early twentieth century. Essays here analyze distinct zones of contact--between various European states, between Asia and Europe, or between Europe and so-called primitive cultures in Africa, the Americas, and the South Pacific--focusing mainly but not exclusively on painting, drawing, or the decorative arts. Each case foregrounds the centrality of international borrowings or colonial appropriations and counters conceptions of European art as a &quot;pure&quot; tradition uninfluenced by the artistic forms of other cultures. The contributors analyze the social, cultural, commercial, and political conditions of cultural contact--including tourism, colonialism, religious pilgrimage, trade missions, and scientific voyages--that enabled these exchanges well before the modern age of globalization.Contributors: Claire Farago, University of Colorado at BoulderElisabeth A. Fraser, University of South FloridaJulie Hochstrasser, University of IowaChristopher Johns, Vanderbilt UniversityCarol Mavor, University of North Carolina at Chapel HillMary D. Sheriff, University of North Carolina at Chapel HillLyneise E. Williams, University of North Carolina at Chapel Hill","torrent":{"xt":"urn:btih:12eca25a0e8c3a6f95ce07aa68f3d3519bc65ab2","amp;dn":"Cultural+Contact+and+the+Making+of+European+Art+since+the+Age+of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12eca25a0e8c3a6f95ce07aa68f3d3519bc65ab2","infoHashBuffer":{"type":"Buffer","data":[18,236,162,90,14,140,58,111,149,206,7,170,104,243,211,81,155,198,90,178]},"announce":[],"urlList":[]}}