{"title":"Coast to Coast AM 2012.02.05 Wisdom of Elders","uid":7029101,"size":27534838,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:13c848ff62b72cfc09db96d06d9e6e85889acfa9&amp;dn=Coast+to+Coast+AM+2012.02.05+Wisdom+of+Elders&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1329172008,"description":"Coast to Coast AM 2012.02.05 Wisdom of Elders\n\nHost: \tGeorge Noory\nGuests: Karl Pillemer, John Reigstad\n\nJoining George Noory, Professor of Gerontology at the Weill Cornell Medical College, Dr. Karl Pillemer, discussed his research on older people. He interviewed more than 1,000 Americans over the age of 65 about various topics, and they shared with him the wisdom and life lessons they've acquired. One of his surprising findings was that people over the age of 70 have higher rates of life satisfaction than younger people, even if they have a chronic disease. They're aware they have a &quot;limited time horizon,&quot; and this helps them make better choices, he explained. Many of the people in the 90-100 age range conveyed to him the idea that &quot;life is incredibly short.&quot;\n\nSome of the other lessons they shared were:\n\n    Train yourself to reduce or eliminate worry.\n    Avoid regret by saying yes to opportunities, following your dreams, or trying something different.\n    Travel more-- people and experiences end up mattering more than material possessions.\n    In choosing a mate, find someone who shares your values and interests, and will make a suitable companion when the sex and romance fades.\n\nThe biggest area of sadness in their lives was when there was a rift in their family that wasn't repaired, Pillemer reported. He also talked about the problems of ageism-- few elderly people are depicted in films and TV, and a coming epidemic of Alzheimer's that will hit as Boomers continue to grow older. Past the age of 85, one out of 2 seniors will experience dementia, and the American healthcare system is not prepared for this, he lamented.\nPhilosophy of Religion\n\nFirst hour guest, philosophy professor John Reigstad pondered the &quot;Science of God,&quot; and shared his concept of religion, which he related to the affirmation of ultimate values in a person's life, such that an agnostic or atheist could have religious practices. He also spoke about respecting &quot;enlightened pluralism,&quot; which he defined as &quot;the affirmation of your own religious tradition and the tradition of your ancestors, while remaining sympathetic to the peaceful traditions of others.&quot;\n\nNews segment guests: Greg Hunter, Richard C. Hoagland\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://legacyproject.human.cornell.edu&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://legacyproject.human.cornell.edu&lt;/a&gt;\n\nBook(s):\n\n30 Lessons for Living: Tried and True Advice from the Wisest Americans\n\t &lt;a href=&quot;\nhttp://www.amazon.com/30-Lessons-Living-Advice-Americans/dp/1594630844/c2cam-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/30-Lessons-Living-Advice-Americans/dp/1594630844/c2cam-20&lt;/a&gt;\n\nBecome A Coast Insider: http://www.coasttocoastam.com/coastinsider","torrent":{"xt":"urn:btih:13c848ff62b72cfc09db96d06d9e6e85889acfa9","amp;dn":"Coast+to+Coast+AM+2012.02.05+Wisdom+of+Elders","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c848ff62b72cfc09db96d06d9e6e85889acfa9","infoHashBuffer":{"type":"Buffer","data":[19,200,72,255,98,183,44,252,9,219,150,208,109,158,110,133,136,154,207,169]},"announce":[],"urlList":[]}}