{"title":"(PSP-PSX) Ace Combat Collection GOREslinger","uid":4775011,"size":1271287610,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:148aa345079bc545d6c3c988d0fb7fe94ac31d15&amp;dn=%28PSP-PSX%29+Ace+Combat+Collection+GOREslinger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoreTBP","files":5,"time":1237179974,"description":"Game: Air Combat (Ace Combat 1), Ace Combat 2, Ace Combat 3: Electrosphere\nRegion: ALL NTSC-U\nYear: 1995, 1997, 1999\nProducer: Namco Limited, Production I.G, Inc.\n\nDescription:\nAir Combat (Ace Combat 1)\nOne of the first 3rd party games for the PlayStation.\n\nYou play as a freelance mercenary hired by world governments to strike against terrorists. The missions get harder as you proceed, but the money you earn for completing each mission makes it worthwhile. You can purchase additional aircraft and arms as you go along, as well as hire wingmen to make the going easier.\n\nAce Combat 2\nSequel to Namco's groundbreaking PSX combat flight simulator. Ace Combat 2 puts you back in the cockpit as a mercenary pilot out to foil a world-threatening terrorist plot. You'll proceed through 30 missions in which your success will allow you to buy weapon upgrades, parts and other gimmicks just like in the original. \n\nAC2 offers sharper graphics and sounds, more planes and options, dual shock support as well as adding a much-needed analog joystick support.\n\nAce Combat 3: Electrosphere\nYou are an ace fighter pilot who works for an organization called &quot;UPEO&quot;. The player has to accomplish various missions, from taking out a special aircraft carrier, to taking out enemy satellite systems in orbit around earth. The player can earn ratings from A to D. The higher the rating, the higher the chance that the player can acquire new kinds of planes. The game has many enviroments. From normal arial missions to Stratospereric missions and even outer space missions.\n\nGOREslinger's Opinion:\nI personally love the Ace Combat Series. Some may argue that the games really don't change that much. That is what happens when you perfect a game. That is what Namco has done and is continuing to do with Ace Combat. Ohh and make sure to pick-up Ace Combat X: Skies of Deception. It is a fantastic game.\n\nEnjoy the game!\n\nGORESlinger\nHELP KEEP THE HOMEBREW SCENE ALIVE!!! SEED!!!\nI appreciate any comments that you have to offer!!!","torrent":{"xt":"urn:btih:148aa345079bc545d6c3c988d0fb7fe94ac31d15","amp;dn":"%28PSP-PSX%29+Ace+Combat+Collection+GOREslinger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"148aa345079bc545d6c3c988d0fb7fe94ac31d15","infoHashBuffer":{"type":"Buffer","data":[20,138,163,69,7,155,197,69,214,195,201,136,208,251,127,233,74,195,29,21]},"announce":[],"urlList":[]}}