{"title":"Bertrice Small - 5 Novels","uid":9135978,"size":6511161,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:149f27bc407f865b20a2133d2dc8d8d1ea564573&amp;dn=Bertrice+Small+-+5+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":15,"time":1383414115,"description":"Born in Manhattan, Bertrice Small has lived on eastern Long Island for 36 years, and she loves it! She is a Sagittarian, married to a Pisces, with an Aries son. Her greatest passions are her family; Finnegan and Sylvester, the family cats; her garden; her work, and just life in general.\nShe is the author of 52 novels. 40 are Historical Romance, 6 are Fantasy Romance, and 6 are Erotic Contemporary. She has also written 4 erotic novellas.\n\nBeloved (1983)\nThe daughter of a powerful desert cheiftain, beautiful raven-haired Zenobia, a descendent of Cleopatra, witnesses at an early age the shocking brutality of renegade Roman soldiers and vows to hate all of the blue-eyed strangers forever. Despite that pledge, she falls hopelessly and passionately in love with Marcus Alexander Britanus, a Roman. And it will take all her cunning and skill in war to keep the precious erotic rapture she can find only in his arms....\n\nEnchantress Mine (1987)\nFrom the golden pleasure domes of Constantinople to the barbaric pomp of Malcolm of Scotland's court, this is the magical tale of ravishingly beautiful Mairin of Aelfleah, called &quot;Enchantress&quot; by the three men who loved her: Basil, Prince of Byzantium; Josselin, gallant night; and the tragic Eric Longsword.\n\nTo Love Again (1993)\nBeautiful, headstrong, and defiant, Cailin Drusus possesses the pride of her Celtic-born mother, though she has been reared amid her Roman father's wealth and privilege. When Cailin's family is destroyed and their farmland seized, she marries Wulf Ironfist, a Saxon of enormous strength and power--a gentle giant who opens the door to a world of heady sensuality. But her happiness is short-lived. For an unknown enemy drugs her as she labors in childbirth--and she awakens to find herself sold to a slave merchant and transported to Byzantium, not knowing what happened to her child. . . .\n\nThe Love Slave (1995)\nVowing to never surrender her body to a man willingly, Regan, a Celtic beauty, finds her determination faltering at the hands of Karim al Malina, an Arabian master of the erotic arts who trains Regan to be a king's consort.\n\n\nThe Dragon Lord's Daughters (2004)\nFollows the sensual adventures of Maia, Averil, and Junia--the daughters of King Arthur's descendant, Lord Pendragon--as they search for love and passion in a land rife with political intrigue, danger, and magic.\n","torrent":{"xt":"urn:btih:149f27bc407f865b20a2133d2dc8d8d1ea564573","amp;dn":"Bertrice+Small+-+5+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"149f27bc407f865b20a2133d2dc8d8d1ea564573","infoHashBuffer":{"type":"Buffer","data":[20,159,39,188,64,127,134,91,32,162,19,61,45,200,216,209,234,86,69,115]},"announce":[],"urlList":[]}}