{"title":"Exploding Sun (2013) DVD2(dvd5)(Nl subs) RETAIL SAM TBS","uid":8935021,"size":3872425887,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:15991e067d48248c4d73c23cc2486ee9ed1b8f35&amp;dn=Exploding+Sun+%282013%29+DVD2%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Sammynet","files":-1,"time":1379543166,"description":"Exploding Sun (2013) DVD 2 / 2\n\nDutch\nCraig Bakus is het brein achter de Roebling Clipper, het eerste ruimteschip waarmee\npassagiers in een paar uur een retourvlucht naar de maan kunnen maken. Aan boord voor\nde eerste vlucht is een bont gezelschap van prominenten. Onder hen ook de man die ooit\nCraig's beste vriend was: Don Wincroft, wetenschappelijk adviseur van de president en\ntegenwoordig getrouwd met Craig's ex Cheryl. De vlucht lijkt goed te verlopen, maar bij\nhet verlaten van de dampkring wordt het schip plotseling getroffen door een hoge dosis\nzonnestraling die de motoren op hol doet slaan. Vanaf dat moment schiet de Clipper met\neen enorme snelheid richting de maan. Pogingen om het probleem vanaf de aarde op te\nlossen mogen niet baten. Al gauw wordt duidelijk dat er een ramp dreigt. Alles duidt\nerop dat de Clipper straks rechtstreeks naar de zon zal worden gekatapulteerd. En dat\nzou niet alleen het einde van het schip betekenen, maar ook van al het leven op aarde...\n\nEnglisch\nA privately owned spaceship with passengers, among them the president's wife, is on its\nmaiden flight around the Moon and back to Earth. When a massive solar storm blows the\nrocket off course, the ship moves forward out of control on a direct path toward the Sun,\nand eventually burns up. The Quantum scalar drive powering the ship, which is engineered\nto withstand extreme temperatures, survives solar impact and puts the Sun into a\nhyperactive phase, causing massive bursts of radiation that have a devastating effect on\nEarth. The second half of the movie depicts these effects and peoples' struggles to find\nshelter and survive. It is revealed that the US military has copied and militarized the\nQuantum scalar drive, and built a spaceship powered by Nuclear Pulse Propulsion to propel\nthe weapon into orbit. The creator of the scalar drive teams up with a NASA astronaut to\nreconfigure the weapon so as to counteract the effects of the first one as it drops into\nthe Sun. The Sun cools down and the Earth is saved from destruction.\n\nSpot Information\nSource............: RETAIL\nFormaat...........: DVD5 /ISO\nVideo.............: PAL / 16:9\nGenre.............: Sci-Fi / Adventure\nMenu..............: Yes\njaar uitgave......: 2013\nCover &amp; label.....: Yes\nAudio.............: Dutch\nSpeelduur.........: 240 minuten (miniserie, 2 delen) / 180 minuten (dvd)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2277932/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2277932/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/92296&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/92296&lt;/a&gt;\n\nSeeden wordt op prijs gesteld, om deze torrent in leven te houden\n\nDon`t quit after you finished the download, but keep seeding.","torrent":{"xt":"urn:btih:15991e067d48248c4d73c23cc2486ee9ed1b8f35","amp;dn":"Exploding+Sun+%282013%29+DVD2%28dvd5%29%28Nl+subs%29+RETAIL+SAM+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15991e067d48248c4d73c23cc2486ee9ed1b8f35","infoHashBuffer":{"type":"Buffer","data":[21,153,30,6,125,72,36,140,77,115,194,60,194,72,110,233,237,27,143,53]},"announce":[],"urlList":[]}}