{"title":"THE.KING.OF.FIGHTERS.XIII.STEAM.Closed.Beta.V6-3DM","uid":8865901,"size":2190172123,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:15f56fe65baf47449557a3fc141094399753e00a&amp;dn=THE.KING.OF.FIGHTERS.XIII.STEAM.Closed.Beta.V6-3DM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1377905526,"description":"THE KING OF FIGHTERS XIII , SNK PLAYMORE s flagship 2D versus fighting title returns in an ultimate version on Steam!!\nThe many features exclusive to the console version of the game, such as the ONLINE Mode that allows you to enjoy smooth online versus matches with rivals from around the world, the Tutorial Mode which can be enjoyed by KOF novice players, and the Story Mode which features several exclusive episodes in a Visual Novel format, have been improved are still available in  THE KING OF FIGHTERS XIII Steam Edition !\nIn addition, &quot;Iori with the Power of Flames ,  NESTS Style Kyo , and  Mr. Karate&quot; DLC characters are now playable from the start, for a total roster of 36 characters!\nThe time has come to face rivals worldwide!\nMAIN FEATURES\n 3-ON-3 TEAM BATTLE:\nChoose a default team of 3 characters or make your own team by picking up 3 characters of your choice, and fight against teams until victory! Develop your own team strategy by choosing the best characters for you!\n\n STORY \nIn this mode, you will experience a variety of background stories not touched upon in the game s original Arcade Version. Discover the truth about KOF s  Ash Saga  and its secrets through the eyes of the main character, Ash Crimson, and other characters who were not directly participating in the tournament. Your decisions and battle results may lead you to discovering new story elements; try out all the different options and every scene!\n\n NETWORK:\n&quot;THE KING OF FIGHTERS XIII Steam Edition&quot; now features vastly improved netcode that will provide you with the most comfortable online experience yet! The new netcode features improved communication speeds between you and your opponent, and also tailors your online experience according to your PC environment!\n\n THE KING OF FIGHTERS XIII Steam Edition  features three different types of ONLINE VERSUS Matches, allowing players to challenge other rivals worldwide in endless and intense battles:\n   Ranked Match : fight under specified regulations, and your results will be reflected in the rankings.\n-  Player Match : playing in this mode will not affect your results. You can fight against others casually.\n-  Friend Match : invite online players and challenge them through this mode for heated competition!\n\n MISSION:\nTackle three different kinds of missions in this mode, and improve your skills!\n-  TIME ATTACK : Defeat all CPU opponents in the shortest time you can.\n-  SURVIVAL : Select a character and fight your way through as many CPU opponents as you can.\n-  TRIAL : In this mode, each character has 10 tasks, which mainly focus on combos. By the time you complete all 10 tasks, you will have mastered some combos for that character.\n\n TUTORIAL:\nRose Bernstein, hostess of the tournament, will teach you the basic techniques as well as explain the gauges and their uses. First time KOF players should start here to get used to the game.\n\n CUSTOMIZE:\nThis mode allows you to edit your online profile and change character color palette. You can create a team to use online, add icons collected while playing, or enter a preset message that you want to use in your profile. For each character, you can make up to five custom color patterns. Show off your personality on the worldwide stage!\n\n OPTION:\nA  GRAPHICS OPTION  feature, allowing the players to switch between different frame rates and simplify backgrounds, has been newly added.\n\nInstructions:\n\n1. Extract game\n2. Extract patch files\n3. Play\n\nFor Multiplayer Instructions:\n\n1. Extract KOFXIIIBSWFPSC.rar to game folder\n2. Run Steam\n3. Play\n\nsteam_api.dll may get blocked by your antivirus . It's a false positive!","torrent":{"xt":"urn:btih:15f56fe65baf47449557a3fc141094399753e00a","amp;dn":"THE.KING.OF.FIGHTERS.XIII.STEAM.Closed.Beta.V6-3DM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15f56fe65baf47449557a3fc141094399753e00a","infoHashBuffer":{"type":"Buffer","data":[21,245,111,230,91,175,71,68,149,87,163,252,20,16,148,57,151,83,224,10]},"announce":[],"urlList":[]}}