{"title":"Successful Science Communication Telling It Like It Is By D.Benn","uid":7557993,"size":3653603,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:162ba9e5af8b273ad71a13ecdbe7b14ef6626544&amp;dn=Successful+Science+Communication+Telling+It+Like+It+Is+By+D.Benn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buzyverny","files":2,"time":1345668530,"description":"In the 25 years since the 'Bodmer Report' kick-started the public understanding of science movement, there has been something of a revolution in science communication. However, despite the ever-growing demands of the public, policy-makers and the media, many scientists still find it difficult to successfully explain and publicise their activities or to understand and respond to people's hopes and concerns about their work. Bringing together experienced and successful science communicators from across the academic, commercial and media worlds, this practical guide fills this gap to provide a one-stop resource covering science communication in its many different forms. The chapters provide vital background knowledge and inspiring ideas for how to deal with different situations and interest groups. Entertaining personal accounts of projects ranging from podcasts, to science festivals, to student-run societies give working examples of how scientists can engage with their audiences and demonstrate the key ingredients in successful science communication.","torrent":{"xt":"urn:btih:162ba9e5af8b273ad71a13ecdbe7b14ef6626544","amp;dn":"Successful+Science+Communication+Telling+It+Like+It+Is+By+D.Benn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162ba9e5af8b273ad71a13ecdbe7b14ef6626544","infoHashBuffer":{"type":"Buffer","data":[22,43,169,229,175,139,39,58,215,26,19,236,219,231,177,78,246,98,101,68]},"announce":[],"urlList":[]}}