{"title":"Get Down and Make Out EP","uid":9442406,"size":24309983,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:16dce5d343455dcdd71b6faaa0423c9d42e48cf2&amp;dn=Get+Down+and+Make+Out+EP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shewhornjonez","files":1,"time":1389035548,"description":"it's hard to describe the range of emotion that went into this composition. needless to say the work speaks for itself so i don't have to. in 2014 this description box acts much in the same way as the liner notes on a record. with that in mind i have tried to write something that will give the listeners some bit of information that will help them better understand this record and hopefully all records across time. we have not made it very far and still we never thought we would make it this far so first of all we would like to say thank you for listening and supporting our cause. as products of our environment we consider this record to be a response to the social and political changes of our time. everyone who worked on this record is too young to remember what this country was like before 9/11. this record reflects a desire for peace and happiness but most of all it invites the world to become more aware. more than anything this work is a philosophical manifesto, a new study of morals and ethics in the 21st century. through these four songs we present a framework for proper ethical action in a post-moral society. no single force in our modern society has the power to control human action. to quote the talking heads &quot;science can't change you, religion can't change you, drugs can't change you&quot; without any sort of ethical authority governing the youth of modern America this record was only inevitable no body of church or state or for that matter any sort of higher being or cosmological force could have determined the direction of these three young men's moral compass. rather the youth of America now determine their sense of right and wrong from within. to quote peter &quot;do what you want to do, do what you want to do, do what you want to do, do what you want to do.&quot;\n\ninitially we had considered bringing in guest vocalists and producers for this album but in the end we decided that it wouldn't be fair to the listener. the modern consumer gets what they pay for and in this case they are getting a digital file. the internet has proved that the value of art is nothing the only thing with any intrinsic worth is artifice. plastic has value, paper has value, polyvinyl chloride has value, paint has value, magnetic tape has value, live performance has value but art has no financial value only a spiritual one. simply listening to a song has no worth and no entity has a right to charge money for that. the internet has created a medium through which people who couldn't otherwise afford to have massive libraries of music can now experience an enormous range of treasured sound. likewise artists who would normally not get discovered are now exposed to a wider audience. THIS IS A GOOD THING. regardless of what record labels and record snobs would want you to believe free sound files are a good thing, a way of preserving our culture. this record advocates for americans to stop paying for something that doesn't exist. the Unibroz will never charge money for our digital music.\n\nmusic presents a challenge as an art form because it does not have a physical location. unlike art it does not rest in one place like a museum or a home, rather it lives in the hearts and souls of all those who have treasured it or perhaps even hated it. we have decided to put this record on pirate bay because that is the closest thing  we will get to having a consistent physical location. most likely if you are downloading this record right now it is coming straight off of my computer onto yours.\n\nthank you,\n\n-shj","torrent":{"xt":"urn:btih:16dce5d343455dcdd71b6faaa0423c9d42e48cf2","amp;dn":"Get+Down+and+Make+Out+EP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16dce5d343455dcdd71b6faaa0423c9d42e48cf2","infoHashBuffer":{"type":"Buffer","data":[22,220,229,211,67,69,93,205,215,27,111,170,160,66,60,157,66,228,140,242]},"announce":[],"urlList":[]}}