{"title":"LAST DAYS - ENG/SPA","uid":3848553,"size":4686012525,"categoryP":"porn","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:175fa8e84995f9f4de0af66744d32037dd6c8589&amp;dn=LAST+DAYS+-+ENG%2FSPA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"arrobar","files":54,"time":1192799696,"description":"ORIGINAL TITLE: Last Days \nYEAR: 2005 \nRUNNING TIME: 97 min. \nCOUNTRY: United States \nDIRECTOR: Gus Van Sant \nSCREENWRITER: Gus Van Sant \nCOMPOSER: Rodrigo Lopresti \nCINEMATOGRAPHER: Harris Savides \nCAST: Michael Pitt, Lukas Haas, Asia Argento, Scott Green, Nicole Vicius, Ricky Jay, Ryan Orion, Harmony Korine, Kim Gordon, Andy Friberg \nSTUDIO/PRODUCER: HBO Films \nOFFICIAL WEB:\nGENRE: Drama \nSYNOPSIS/PLOT: LAST DAYS is filmmaker Gus Van Sant&amp;#039;s meditation on the inner turmoil that engulfs a brilliant, but troubled, musician in the final hours of his life. Michael Pitt (THE DREAMERS, HEDWIG AND THE ANGRY INCH) stars as Blake, an introspective artist who is buckling under the weight of fame, professional obligations, and a mounting feeling of isolation. \n\nLAST DAYS follows Blake through a handful of hours he spends in and near his wooded home, a fugitive from his own life. It is a period of random moments and fractured consciousness, fused by spontaneous bursts of rock &amp; roll. Expanding on the elliptical style forged in his two previous films, GERRY and the Palme d&amp;#039;Or-winning ELEPHANT, Van Sant layers images and sounds to articulate an emotional landscape, creating a dynamic work about a soul in transition. Dwarfed by towering trees, Blake slowly makes his way through dense woods. He scrambles down an embankment to a fresh spring, and undresses for a short swim. The next morning, he returns to his house, an elegant, if neglected, stone mansion. \n\nMany people are looking for Blake - his friends, his managers and record label, even a private detective - but he does not want to be found. In the haze of his final hours, Blake will spend most of his time by himself. He avoids the people who are living in his house, who approach him only when they want something, be it money or help with a song. He hides from one concerned friend, and turns away another. He visits politely with a stranger from the Yellow Pages sales department, and he ducks into an underground rock club. He wanders through the woods, and he plays a new song, one last rock &amp; roll blow out. Finally, alone in the greenhouse, Blake will look and listen - and seek release. \n\nAlthough this film is inspired by the last days of Kurt Cobain, it is a work of fiction and none of the characters or events portrayed in the film are real. \n\n--- THE DVD --- \n\nSYSTEM: PAL \n\nAUDIO: Spanish Dolby Digital 5.1, English Dolby Digital 5.1 \n\nSUBTITULES: Spanish, Catalonian \n\nIMAGE: 4:3  \n\nFORMAT: DVD9 =&gt; DVD5 \n\nCOMPRESSION: DVDFAB DECRYPTER + DVDREMAKE PRO + DVDREBUILDER PRO + HC 2PASS \n\nIn Spain this DVD doesn&amp;#039;t bring english menu  \n\nVisitthe best Spanish site for DVD&amp;#039;S \n\nPREMIERE QUORUM TEAM \n","torrent":{"xt":"urn:btih:175fa8e84995f9f4de0af66744d32037dd6c8589","amp;dn":"LAST+DAYS+-+ENG%2FSPA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"175fa8e84995f9f4de0af66744d32037dd6c8589","infoHashBuffer":{"type":"Buffer","data":[23,95,168,232,73,149,249,244,222,10,246,103,68,211,32,55,221,108,133,137]},"announce":[],"urlList":[]}}