{"title":"The Merseybeats - The Merseybeats (1964)","uid":8636771,"size":237251137,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:182c2f8b728300aa13267674c4b28e3f2334e83e&amp;dn=The+Merseybeats+-+The+Merseybeats+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":24,"time":1372774187,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Merseybeats - The Merseybeats (1964)\n &lt;a href=&quot;\nhttp://www.rock.co.za/files/fontana_merseybeats.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.rock.co.za/files/fontana_merseybeats.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com) DVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail)\nAMG Bio.txt\nAMG Review.txt\ninfo.txt (which is simply these notes included in the torrent)\n\nFirst biography paragraph from All Music (by Bruce Eder &amp; Richie Unterberger):\n\nThe Merseybeats were one of the better quartets to come out of the British Invasion without ever making a dent on the charts in the United States -- along with the Roulettes, the Chants, and the Undertakers, they represent an undeservedly lost chapter in early-'60s British rock &amp; roll. Although they enjoyed a little less than a year of serious chart success, the Merseybeats were unable to pull together the various facets of their sound into a cohesive, coherent whole in the manner of the Beatles or the Hollies, and into something lasting, in part because of a lack of original songwriting ability in their ranks. The group's roots go back to the early '60s in Liverpool, and a band originally known as &quot;the Mavericks,&quot; comprised of Tony Crane (lead guitar, vocals), Billy Kinsley (bass, vocals), David Elias (rhythm guitar, vocals), and Frank Sloane (drums). They were doing well but soon found the name to be a drag on their success, making people think that they were a country &amp; western band. They briefly used the name &quot;the Pacifics,&quot; and then became the Merseybeats -- evidently their timing was such that they grabbed the name, previously a local music reference, ahead of anyone else in a city boiling over with musical activity.\n\nRead all of the bio at: &lt;a href=&quot;\nhttp://www.allmusic.com/artist/the-merseybeats-p4903/biography&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/artist/the-merseybeats-p4903/biography&lt;/a&gt;\n\nAll Music Album Reviews:\n\nAMG Review by Bruce Eder\n\nThe Merseybeats' only original album, recorded in mid-1964 with John Gustafson in their lineup in place of co-founder Billy Kinsley on bass, is a strange hybrid of originals that move between solid harmony-based Liverpool pop/rock (&quot;Milkman,&quot; &quot;Really Mystified&quot;) and Bo Diddley-influenced rockers (&quot;Funny Face&quot;), juxtaposed with an odd selection of covers, ranging from &quot;Bring It On Home to Me&quot; and &quot;He Will Break Your Heart&quot; (which do work) to an odd selection of show tunes. The better of the latter is a reasonably successful rendition of &quot;Hello Young Lovers&quot; done with rockabilly guitar and some way too busy percussion; much less successful is a soft a cappella rendition of &quot;The Girl That I Marry.&quot; The ballad &quot;Lavender Blue&quot; offers a Gustafson arrangement that isn't terribly interesting, and Gustafson's &quot;Jumpin' Jonah&quot; is even more of a ripoff of &quot;Long Tall Sally&quot; (especially as done by the Beatles) than the Beatles' &quot;I'm Down&quot; was. The resulting album, with the Beatlesque single side included, was neither fish nor fowl, and insufficiently strong in any direction other than what their singles already pointed toward to gain the band a wider audience.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-merseybeats-r12974&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-merseybeats-r12974&lt;/a&gt;\n\n=========\n\nAMG Review by Bruce Eder\n\nThe Merseybeats' 1964 LP was reissued on CD in 1990 by Phonogram in this expanded edition. In addition to the original album's dozen songs, the earlier singles &quot;It's Love That Really Counts&quot; b/w &quot;Fortune Teller&quot; and &quot;I Think of You&quot; b/w &quot;Mister Moonlight&quot; were added, along with the slightly later single sides &quot;Wishin' and Hopin'&quot; and &quot;Last Night (I Made a Little Girl Cry).&quot; The songs add some much-needed consistency to an entertaining but rather variable album, although this release pales next to Bear Family Records' 2002 collection of the group's complete output.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/album/the-merseybeats-bonus-tracks-r740520&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/album/the-merseybeats-bonus-tracks-r740520&lt;/a&gt;\n\n\nTrack List:\n\n01. Milkman\n02. Hello, Young Lovers\n03. He Will Break Your Heart\n04. Funny Face\n05. Really Mystified\n06. The Girl That I Marry\n07. Fools Like Me\n08. My Heart And I\n09. Bring It On Home To Me\n10. Lavender Blue\n11. Jumping Jonah\n12. Don't Turn Around\n13. It's Love That Really Counts\n14. The Fortune Teller\n15. I Think Of You\n16. Mister Moonlight\n17. Whishin' And Hopin'\n18. Last Night (I Made A Little Girl Cry)\n","torrent":{"xt":"urn:btih:182c2f8b728300aa13267674c4b28e3f2334e83e","amp;dn":"The+Merseybeats+-+The+Merseybeats+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"182c2f8b728300aa13267674c4b28e3f2334e83e","infoHashBuffer":{"type":"Buffer","data":[24,44,47,139,114,131,0,170,19,38,118,116,196,178,142,63,35,52,232,62]},"announce":[],"urlList":[]}}