{"title":"VMware Workstation v9.0.1 Build 894247 Final","uid":7820903,"size":744635498,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:19400408f68919f0ffb6d9972a89ace039782f2b&amp;dn=VMware+Workstation+v9.0.1+Build+894247+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NepsterJay","files":26,"time":1352817566,"description":"Software name: VMware Workstation\nProgram Version: 9.0.1 Build 894247\nOfficial site: VMware\nLanguage: English / Russian\nTreatment: Present / cured\n\n\n\nSystem requirements:\n\n64-bit x86 Intel Core Processor, AMD Athlon 64 FX Dual Core Processor\n1.3GHz or faster core speed\n1GB RAM minimum / 2GB RAM recommended\nNVIDIA GeForce 8800GT or later or an ATI Radeon HD 2600 or later\n1.2 GB of available disk space\n\n\n\nDescription:\n\nVMware Workstation - known program for virtualization. VMware Workstation is a powerful solution for software developers and system administrators who are creating and testing fully-integrated network applications server-class operating in different environments.\n\nThe unique technology of VMware MultipleWorlds isolates operating systems and applications within virtual machines, and the disposal of each virtual machine is a standard PC x86, with its own processor and memory.\n\nWith this solution you can on a single computer to conduct processes of development, testing, debugging and running multi-tier browser-based applications that exploit the new operating systems and legacy applications on one computer, install new or upgrade existing operating systems without performing partitioning operations and restart the computer.\n\n\n\n\nKey features:\n\nThe simultaneous launch of multiple guest operating systems on one computer\nRunning a virtual machine in windows desktop core operating system and full screen\nInstalling virtual machines without re-partitioning\nStarting already installed on your computer operating system without reinstalling or re-configure\nLaunching Applications Windows operating system on a Linux box and vice versa\nCreating and testing applications simultaneously for different systems\nRunning is not tested applications without the risk of endangering the stability of the system or lose critical data\nSharing files and applications to different virtual machines by using a virtual network\nRun the client-server and Web applications on one PC\nRunning on the same PC multiple virtual computers and modeling of network\n\nWhat's new in:\nWindows 8\nGraphics Improvements\nOpenGL for Linux Guests\nRestricted Virtual Machines\nWSX\nDownloading Virtual Machines from vSphere\nUSB 3.0\nNested Virtualization\nHyper-V\nVirtual Performance Counters\nRemoting Improvements\nDisk Cleanup\nQuick Switch II\nThumbnail Actions\nSaved Filters\nVMware Player\n\n\nFeatures Lite by qazwsxe:\n\nMain features:\n\n- Interface - English or Russian (translated from loginvovchyk revised 07/11/2012). Interface language VMware Workstation, selected at the beginning of the installation\n- Does not require registration\n- Includes only the Tools-Windows-9.2.2 (for other OS can be downloaded separately)\n- Apply a patch that makes it possible to install Mac OS X (Tools-Mac OS X present in the assembly)\n- Added the / FindDel, is designed to solve the problem with the removal of VMware Workstation. When using the key, the search VMware Workstation, and if the system is found VMware Workstation, you are asked to remove the VMware Workstation\n","torrent":{"xt":"urn:btih:19400408f68919f0ffb6d9972a89ace039782f2b","amp;dn":"VMware+Workstation+v9.0.1+Build+894247+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19400408f68919f0ffb6d9972a89ace039782f2b","infoHashBuffer":{"type":"Buffer","data":[25,64,4,8,246,137,25,240,255,182,217,151,42,137,172,224,57,120,47,43]},"announce":[],"urlList":[]}}