{"title":"Analytical Methods in Petroleum Upstream Applications","uid":12734057,"size":26281735,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a4a032791d8945cffae173a43dedb052f663d40&amp;dn=Analytical+Methods+in+Petroleum+Upstream+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1447153151,"description":"Analytical Methods in Petroleum Upstream Applications (CRC, 2015).pdf\r\n\r\nISBN 9781482230888\r\n\r\nEffective measurement of the composition and properties of petroleum is essential for its exploration, production, and refining; however, new technologies and methodologies are not adequately documented in much of the current literature. Analytical Methods in Petroleum Upstream Applications explores advances in the analytical methods and instrumentation that allow more accurate determination of the components, classes of compounds, properties, and features of petroleum and its fractions.\r\n\r\n\r\n\r\nRecognized experts explore a host of topics, including:\r\n\r\nA petroleum molecular composition continuity model as a context for other analytical measurements\r\n\r\nA modern modular sampling system for use in the lab or the process area to collect and control samples for subsequent analysis\r\n\r\nThe importance of oil-in-water measurements and monitoring\r\n\r\nThe chemical and physical properties of heavy oils, their fractions, and products from their upgrading\r\n\r\nAnalytical measurements using gas chromatography and nuclear magnetic resonance (NMR) applications\r\n\r\nAsphaltene and heavy ends analysis\r\n\r\nChemometrics and modeling approaches for understanding petroleum composition and properties to improve upstream, midstream, and downstream operations\r\n\r\n\r\n\r\nDue to the renaissance of gas and oil production in North America, interest has grown in analytical methods for a wide range of applications. The understanding provided in this text is designed to help chemists, geologists, and chemical and petroleum engineers make more accurate estimates of the crude value to specific refinery configurations, providing insight into optimum development and extraction schemes","torrent":{"xt":"urn:btih:1a4a032791d8945cffae173a43dedb052f663d40","amp;dn":"Analytical+Methods+in+Petroleum+Upstream+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a4a032791d8945cffae173a43dedb052f663d40","infoHashBuffer":{"type":"Buffer","data":[26,74,3,39,145,216,148,92,255,174,23,58,67,222,219,5,47,102,61,64]},"announce":[],"urlList":[]}}