{"title":"Foyle's War S1E4(2002)[NL subs][NLtoppers][TVSerieSpot]","uid":7504230,"size":1239963318,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1a8c346f862b0d227f98b78666265cf79977309e&amp;dn=Foyle%27s+War+S1E4%282002%29%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":11,"uploader":"chamond42","files":-1,"time":1344116727,"description":"Foyle's War S1E4(2002)[NL subs][NLtoppers][TVSerieSpot]\n\nIMDb rating: 9,8\nreviews: http://www.imdb.com/title/tt0310455/\nepisode list: http://www.imdb.com/title/tt0310455/episodes\n\nDirector: Anthony Horowitz\nStars: Michael Kitchen, Honeysuckle Weeks en Anthony Howell\n\nFoyle's War Season 1 Episode 4: Eagle Day (17 november 2002) \n\nPlot:\nIn 19410 staat Engeland bijna alleen tegenover de Nazi-bezetters van het Europese continent. De verschrikkingen van de nachtelijke bombardementen worden alleen overtroffen door de vrees en hysterie van de bevolking voor een schijnbaar onontkoombare Duitse invasie. Het is in die omstandigheden dat Hoofdinspecteur Christophere Foyle van de recherche afdeling van de Hastings politie in zuid Engeland moet werken.\n\nEpisode 4:\nNa een bombardement van Hastings wordt een man in het puin met een steekwond in zijn hart dood aangetroffen. Foyle vindt snel uit dat de man een vrachtwagenchauffeur was die waardevolle schilderijen in veiligheid bracht naar Wales.\nAndrew, de zoon van Foyle, krijgt een vriendin bij de WAAF en ontdekt dat een van haar vriendinnen zelfmoord heeft gepleegd.\nWanneer hij probeert om daarover meer te weten te komen proberen zijn hoger geplaatste officieren hem van spionage te betichten.\nSam's vader, een dominee, bezoekt haar en vraagt haar om thuis te komen en geeft haar vertrouwelijke informatie die de moord op de vrachtwagenchauffeur tot oplossing brengt. \nDat maakt het voor Foley tevens mogelijk om de opgeklopte aanklacht tegen Andrew, zijn zoon, te weerleggen. Wat blijkt is dat de bevelvoerder van het radarstation de geheimzinnige waas die er is rondom de radarinstallatie, heeft gebruikt om de vrouwelijke staf sexueel te misbruiken.  \n\nCategorie.......... Crime/Drama\nSource............. DVDRip\nRuntime............ 1:37:42 minutes\nSize............... 1,15 GB\nForm............... DivX MP4\nResolution......... 720x576\nFrames/s........... 25\nAudio Language..... English\nAudio code......... 2 Stereo 48kHz\nSubtitles: Dutch - Nederlands\n\nSeason 1:\nIt is 1940 and Britain stands almost alone against the might of Nazi Germany across the continent. The terrors of nightly bombing raids are only matched by the fear and hysteria of the population at the prospect of the seemingly inevitable German invasion. \n\nEpisode 4:\nAfter a bombing raid on Hastings, a man is found dead in the rubble - but from a stab wound to the heart. Foyle soon finds that the dead man was a lorry driver who had been moving valuable paintings to a place of safety in Wales. Andrew befriends a WAAF and finds out about her friend who killed herself. Sam's clergyman father visits her to ask her to come home, and he offers the insight which solves the murder of the lorry driver. That then helps Foyle to crack the trumped-up charges against Andrew. It turns out that the radar station commander had been using the strict veil of secrecy surrounding the installation to exploit female staff sexually.","torrent":{"xt":"urn:btih:1a8c346f862b0d227f98b78666265cf79977309e","amp;dn":"Foyle%27s+War+S1E4%282002%29%5BNL+subs%5D%5BNLtoppers%5D%5BTVSerieSpot%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a8c346f862b0d227f98b78666265cf79977309e","infoHashBuffer":{"type":"Buffer","data":[26,140,52,111,134,43,13,34,127,152,183,134,102,38,92,247,153,119,48,158]},"announce":[],"urlList":[]}}