{"title":"Story of a Death Foretold (2013) Oscar Guardiola-Rivera (multi)","uid":9421667,"size":5040897,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1b026371f99ed8d7432211b4901f5d2d23e5e8d1&amp;dn=Story+of+a+Death+Foretold+%282013%29+Oscar+Guardiola-Rivera+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1388602210,"description":"\nStory of a Death Foretold by Oscar Guardiola-Rivera\n\n\nFormat: mobi/epub/azw3\nLength: 496 pages\nGenre: History\nDate: 5 November 2013\n\nOn September 11, 1973, President Salvador Allende of Chile was deposed in a violent coup led by General Augusto Pinochet. The coup had been in the works for months, even years. Shortly after giving a farewell speech to his people, Allende died of gunshot wounds - whether inflicted by his own hand or an assassin's remains uncertain. Pinochet ruled Chile for a quarter century, but the short rise and bloody fall of Allende is still the subject of fierce historical debate.\n\nIn a world in the throes of the Cold War, the seeming backwater of Chile became the host of a very hot conflict - with Henry Kissinger and the Western establishment aligned with Pinochet's insurgents against a socialist coalition of students, workers, Pablo Neruda, and folk singers, led by the brilliant ideologue Allende. Revolution and counterrevolution played out in graphic detail, moving the small South American nation to the center of the world stage in the dramatic autumn of 1973.\n\nAuthor:\n\nOscar Guardiola-Rivera teaches International Law and International Affairs at Birkbeck College, University of London. He also served as an aide to the Colombian Congress, as a consultant for a unit of the United Nations in the region. He is recognised as one of the foremost younger voices in Latin American philosophy.","torrent":{"xt":"urn:btih:1b026371f99ed8d7432211b4901f5d2d23e5e8d1","amp;dn":"Story+of+a+Death+Foretold+%282013%29+Oscar+Guardiola-Rivera+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b026371f99ed8d7432211b4901f5d2d23e5e8d1","infoHashBuffer":{"type":"Buffer","data":[27,2,99,113,249,158,216,215,67,34,17,180,144,31,93,45,35,229,232,209]},"announce":[],"urlList":[]}}