{"title":"Debbie Gibson - Out Of The Blue (1987) [EAC CUE LOG FLAC]","uid":4450149,"size":287645090,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1c60f269a71739ed30c44618b395b4d31512928a&amp;dn=Debbie+Gibson+-+Out+Of+The+Blue+%281987%29+%5BEAC+CUE+LOG+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sharky110","files":17,"time":1224225361,"description":"RIPPED FROM MY RETAIL CD, ARTWORK DOWNLOADED FROM INTERNET. \n\nA nice, easy listening album which will probably bring back good memories to the ones of you who were teenagers in 1987. She was just 17 when she recorded this album. For the ones who don&amp;#039;t know her, she can be a proof that to be famous in the 80&amp;#039;s it was more important to have a good voice and talent in writing and singing songs then just to be good at &quot;shaking a naked ass&quot; singing in playback as today (See Britney Spears and not only...)  \n\n--------------- \nDebbie Gibson was born in Brooklyn, New York.She grew up in the Long Island suburb of Merrick, New York. At the age of five, she began performing in community theater with her sisters and wrote her first song &quot;Make Sure You Know Your Classroom.&quot; When she was eight, she sang in the children&amp;#039;s chorus at the Metropolitan Opera House in New York. She began playing the ukulele and taking piano lessons soon thereafter, including with the noted American pianist Morton Estrin. Gibson has stated that her household was probably the only one where you would hear kids fighting over piano playing time. \n\nGibson spent years knocking on doors and handing her demos to every director, agent, and producer with whom she came into contact. Eventually, at the age of sixteen, with the help of manager of Doug Breitbart, she caught the attention of Atlantic Records, and thus began her successful pop music career. \n\nWhilst performing around the United States at nightclub venues, Gibson was also recording what would become her debut album, Out Of The Blue. The album was recorded in a total of 4 weeks. Gibson personally wrote all ten songs on this album, \n\nFour singles from Out Of The Blue reached the Top 5 of the Billboard Top 100: &quot;Only in My Dreams,&quot; &quot;Shake Your Love,&quot; &quot;Out Of The Blue,&quot; and the number-one hit &quot;Foolish Beat,&quot; followed by &quot;Staying Together,&quot; which performed more modestly, reaching #22. &quot;Foolish Beat&quot; set a record for Gibson, making her the youngest female artist ever to write, produce, and perform on a Billboard number-one single, a record which stands to this day. By the time Out Of The Blue was established as a hit album, and she had considerable success in the UK, as well as in Japan and southeast Asia, with stadium tours. \n\nOut of the Blue made #7 on the U.S. Billboard Hot Albums chart and #26 on the U.K. album chart. The album became Gibson&amp;#039;s best-selling album to date, selling over 3 million copies in the United States (over 8 million worldwide) and was certified 3x Platinum by the Recording Industry Association of America. \n\n\nIF YOU ENJOY THIS ALBUM PLEASE REMAIN IN SEED AND IF YOU HAPPEN TO SAY THANKS I WON&amp;#039;T GET OFFENDED....  :-)","torrent":{"xt":"urn:btih:1c60f269a71739ed30c44618b395b4d31512928a","amp;dn":"Debbie+Gibson+-+Out+Of+The+Blue+%281987%29+%5BEAC+CUE+LOG+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c60f269a71739ed30c44618b395b4d31512928a","infoHashBuffer":{"type":"Buffer","data":[28,96,242,105,167,23,57,237,48,196,70,24,179,149,180,211,21,18,146,138]},"announce":[],"urlList":[]}}