{"title":"TrueCrypt 6.0","uid":4282212,"size":26857575,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:1d04e5d0838129641dad7c29a178a3a7f37905dc&amp;dn=TrueCrypt+6.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"yojkijha","files":19,"time":1215478378,"description":"From the official Project Page at http://www.truecrypt.org/:\n\n\n---------------------------------------------------------------------------------\n\n\nFree open-source disk encryption software for Windows Vista/XP, Mac OS X, and Linux\nMain Features:\n\n    * Creates a virtual encrypted disk within a file and mounts it as a real disk.\n\n    * Encrypts an entire partition or storage device such as USB flash drive or hard drive.\n\n    * Encrypts a partition or drive where Windows is installed (pre-boot authentication).\n\n    * Encryption is automatic, real-time (on-the-fly) and transparent.\n\n    * Provides two levels of plausible deniability, in case an adversary forces you to reveal the password:\n\n      1) Hidden volume (steganography) and hidden operating system.\n\n      2) No TrueCrypt volume can be identified (volumes cannot be distinguished from random data).\n\n    * Encryption algorithms: AES-256, Serpent, and Twofish. Mode of operation: XTS.\n\n\n-----------------------------------------------------------------------------------\n\n\nNew features:\n\n    * Parallelized encryption/decryption on multi-core processors (or multi-processor systems). Increase in encryption/decryption speed is directly proportional to the number of cores and/or processors.\n\n      For example, if your computer has a quad-core processor, encryption and decryption will be four times faster than on a single-core processor with equivalent specifications (likewise, it will be twice faster on dual-core processors, etc.)\n\n    * Ability to create and run an encrypted hidden operating system whose existence is impossible to prove (provided that certain guidelines are followed).  For more information, see the section Hidden Operating System.   (Windows Vista/XP/2008/2003)\n\n      For security reasons, when a hidden operating system is running, TrueCrypt ensures that all local unencrypted filesystems and non-hidden TrueCrypt volumes are read-only. (Data is allowed to be written to filesystems within hidden TrueCrypt volumes.)\n\n      Note: We recommend that hidden volumes are mounted only when a hidden operating system is running. For more information, see the subsection Security Precautions Pertaining to Hidden Volumes.\n\n    * On Windows Vista and Windows 2008, it is now possible to encrypt an entire system drive even if it contains extended/logical partitions. (Note that this is not supported on Windows XP.)\n\n    * New volume format that increases reliability, performance and expandability:\n          o Each volume created by this or later versions of TrueCrypt will contain an embedded backup header (located at the end of the volume). Note that it is impossible to mount a volume when its header is damaged (the header contains an encrypted master key). Therefore, embedded backup headers significantly reduce this risk. Also note that a backup header is not a copy of the original volume header because it is encrypted with a different header key derived using a different salt. For more information, see the subsection Tools &gt; Restore Volume Header.\n\n            Note: If the user fails to supply the correct password (and/or keyfiles) twice in a row when trying to mount a volume, TrueCrypt will automatically try to mount the volume using the embedded backup header (in addition to trying to mount it using the primary header) each subsequent time that the user attempts to mount the volume (until he or she clicks Cancel). If TrueCrypt fails to decrypt the primary header and then decrypts the embedded backup header successfully (with the same password and/or keyfiles), the volume is mounted and the user is warned that the volume header is damaged (and informed as to how to repair it).\n\n          o The size of the volume header area has been increased to 128 KB. This will allow implementation of new features and improvements in future versions and ensures that performance will not be impaired when a TrueCrypt volume is stored on a file system or device that uses a sector size greater than 512 bytes (the start of the data area will always be aligned with the start of a host-filesystem/physical sector).\n\n      For more information about the new volume format, see the section TrueCrypt Volume Format Specification.\n\n      Note: Volumes created by previous versions of TrueCrypt can be mounted using this version of TrueCrypt.\n    * Parallelized header key derivation on multi-core processors (one algorithm per core/thread). As a result, mounting is several times faster on multi-core processors.  (Windows)\n\n\n    * Ability to create hidden volumes under Mac OS X and Linux.\n\n    * On Linux, TrueCrypt now uses native kernel cryptographic services (by default) for volumes encrypted in XTS mode. This increases read/write speed in most cases. However, the FUSE driver must still be used when the volume is encrypted in a deprecated mode of operation (LRW or CBC), or when mounting an outer volume with hidden-volume protection, or when using an old version of the Linux kernel that does not support XTS mode.  (Linux)\n\n      Improvements:\n\n    * Up to 20% faster resuming from hibernation when the system partition/drive is encrypted. (Windows Vista/XP/2008/2003)\n\n    * Many other improvements.  (Windows, Mac OS X, and Linux)\n\n      Removed features:\n\n    * Encrypted system partitions/drives can no longer be permanently decrypted using the TrueCrypt Boot Loader (however, it is still possible using the TrueCrypt Rescue Disk). (Windows Vista/XP/2008/2003)\n\n      Note: This was done in order to reduce the memory requirements for the TrueCrypt Boot Loader, which was necessary to enable the implementation of support for hidden operating systems.\n\n      Bug fixes:\n\n    * When Windows XP was installed on a FAT16 or FAT32 partition (as opposed to an NTFS partition) and the user attempted to encrypt the system partition (or system drive), the system encryption pretest failed. This will no longer occur.\n\n    * Many other minor bug fixes and security improvements (preventing e.g. denial-of-service attacks). (Windows, Mac OS X, and Linux)\n","torrent":{"xt":"urn:btih:1d04e5d0838129641dad7c29a178a3a7f37905dc","amp;dn":"TrueCrypt+6.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d04e5d0838129641dad7c29a178a3a7f37905dc","infoHashBuffer":{"type":"Buffer","data":[29,4,229,208,131,129,41,100,29,173,124,41,161,120,163,167,243,121,5,220]},"announce":[],"urlList":[]}}