{"title":"Fallen DVDRip.XviD [.avi]","uid":9239140,"size":1467840557,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1d6263186b60f3d1351e64bcfc59b37a86cfe600&amp;dn=Fallen+DVDRip.XviD+%5B.avi%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":3,"time":1385230258,"description":"An erotic masterpiece comes to life as award winning director Brad Armstrong tells the tale of Angel (jessica drake), a fallen Gregorian Angel who has been banished to earth and stripped of her wings after the accidental death of the young woman she was sent to watch over. Alone and desperate for companionship, she finds it in the city s seedy underworld, far from the idyllic heavens she once knew. Follow Angel on her dark journey through some of the most sinful and perverse places this world has to offer. As she continues her fall into darkness, she discovers a glimmer of light in Keith (Brad Armstrong), a handsome mortal that she is inexplicitly drawn to. As Keith helps guide her back towards the light, a secret from the past comes back to haunt the duo, threatening to tear them apart. Can Angel regain her wings and soar once again? Or has she fallen for the last time, doomed to live out her days trapped in the purgatory she now calls home Destined to become an adult classic, Armstrong s stunning visual style, combined with drake s top-notch performance, mind-blowing sex scenes and a screenplay that delivers till the very last frame, Fallen is an unforgettable film.\n\nCast:\nJessica Drake, Kirsten Price, Alektra Blue, Angie Savage, Barrett Blade, Barry Scott, Brad Armstrong, Derrick Pierce, Eric Masterson, Gianna Lynn, Herschel Savage, Hunter Bryce, Jada Fire, Jenaveve Jolie, Jenna Haze, Jennifer Dark, Lana Croft, Lexxi Tyler, Marcus London, Michelle McLaren, Niko, Randy Spears, Ryder Skye, Shyla Stylez, Steven St. Croix, Tommy Gunn\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=93392085997137792859.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=93392085997137792859.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=96115808730128735441.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=96115808730128735441.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:1d6263186b60f3d1351e64bcfc59b37a86cfe600","amp;dn":"Fallen+DVDRip.XviD+%5B.avi%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d6263186b60f3d1351e64bcfc59b37a86cfe600","infoHashBuffer":{"type":"Buffer","data":[29,98,99,24,107,96,243,209,53,30,100,188,252,89,179,122,134,207,230,0]},"announce":[],"urlList":[]}}