{"title":"James Taylor and J. D. Souther - Her Town Too (2nafish)","uid":5639017,"size":176519172,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1e602eb019f0a01a43dc4a1a7fba4b5436ff274b&amp;dn=James+Taylor+and+J.+D.+Souther+-+Her+Town+Too+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1277013785,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nDad Loves His Work is singer-songwriter James Taylor's tenth studio album. Released in 1981, it is best remembered for the duet with J. D. Souther &quot;Her Town Too&quot;, which reached number 11 on the Billboard Pop Singles Chart, &quot;I Will Follow&quot;, &quot;London Town&quot; and the haunting &quot;That Lonesome Road&quot;.\n\nThe album's title was, in part, drawn from the reasons for Taylor's divorce from Carly Simon. She gave him an ultimatum: cut back on his music and touring, and spend more time with her and their children, or the marriage was through. The album's title was his answer, and the divorce took place soon after. The emotional repercussions of the divorce likely served as at least part of the inspiration for &quot;Her Town Too&quot;.\n\nMany people thought this song to be doubly autobiographical. Taylor's marriage with Carly Simon was ending, as was Souther's relationship with Linda Ronstadt. For the most part, Taylor's and Souther's mouths are sealed.\n\nJ.D. Souther (born John David Souther, November 2, 1945 in Detroit, Michigan and raised in Amarillo, Texas) is a country rock singer-songwriter and actor, as well as a multi instrumentalist. He is well known both as a performer and as a writer and co-writer of hit songs for other artists, most famously Eagles and Linda Ronstadt.\n\nHis biggest hit as a solo artist was his 1979 Orbison-influenced song &quot;You're Only Lonely&quot; from the album of the same name, which reached number 7 on the Billboard charts. A collaboration with James Taylor called &quot;Her Town Too&quot; from Taylor's Dad Loves His Work album reached number 11 on the Billboard Pop Singles chart.\n\nJames Vernon Taylor (born March 12, 1948) is an American  singer-songwriter and guitarist  born in Boston, Massachusetts, and raised in Carrboro, North Carolina. He owns a house in the Town of Washington, Massachusetts in Berkshire County . A five-time Grammy Award winner, Taylor was inducted into the Rock &amp; Roll Hall of Fame in 2000.\n\nTaylor achieved his major breakthrough in 1970 with the #3 single &quot;Fire and Rain&quot; and had his first #1 hit the following year with &quot;You've Got a Friend&quot;, a recording of Carole King's classic song. His 1976 Greatest Hits album was certified Diamond and has sold 12 million US copies. Following his 1977 album, JT, he has retained a large audience over the decades. His commercial achievements declined slightly until a big resurgence during the late 1990s and 2000s, when some of his best-selling and most-awarded albums (including Hourglass, October Road and Covers) were released.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:1e602eb019f0a01a43dc4a1a7fba4b5436ff274b","amp;dn":"James+Taylor+and+J.+D.+Souther+-+Her+Town+Too+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e602eb019f0a01a43dc4a1a7fba4b5436ff274b","infoHashBuffer":{"type":"Buffer","data":[30,96,46,176,25,240,160,26,67,220,74,26,127,186,75,84,54,255,39,75]},"announce":[],"urlList":[]}}