{"title":"Son Volt - The Search [2007][EAC,log,cue. FLAC]","uid":8145253,"size":337251543,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1eb7d8b02cf0abb38245197f95513e520bbb83c5&amp;dn=Son+Volt+-+The+Search+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":18,"time":1360901368,"description":"one of Dicks Americana collection\n\nArtist: Son Volt\nRelease: The Search\nDiscogs: 2634733\nReleased: 2007\nLabel: Transmit Sound\nCatalog#: 88697 03232 2\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Folk, World, &amp; Country, Rock, Alternative Rock, Country Rock\n\nTracklisting:\n\n01.1. Slow Hearse\n01.2. The Picture\n01.3. Action\n01.4. Underground Dream\n01.5. Circadian Rhythm\n01.6. Beacon Soul\n01.7. The Search\n01.8. Adrenaline And Heresy\n01.9. Satellite\n01.10. Automatic Society\n01.11. Methamphetamine\n01.12. L Train\n01.13. Highways And Cigarettes\n01.14. Phosphate Skin\n\nWhen Jay Farrar resurrected the sound and approach (if not the personnel) of Son Volt for the 2005 album Okemah and the Melody of Riot, it was a welcome return to what Farrar does best after the poorly focused meanderings of much of his solo work. But while embracing the Son Volt handle energized his muse on Okemah, the second album from Son Volt 2.0, The Search, suggests it has also given him a clearer vision in his search for new sonic territory. The melodic textures of The Search are very much in the mode of Son Volt's early work, but Farrar has offered a few noticeable change-ups in how he approaches the material, most noticeably the addition of Derry Deborja on keyboards, whose washes of organ and piano add new colors to the band's palate. Farrar also takes a few other chances here that pay off, particularly with the punchy soul horns on &quot;The Picture,&quot; and though it remains clear that Farrar is in charge of this band, The Search finds this lineup of Son Volt growing into a sound of their own, with the rhythm section of Andrew DuPlantis and Dave Bryson sounding more comfortable but also lending a stronger backbone on the more rocking material (especially the title track) and Brad Rice given more room to blend his guitar work with Farrar's Neil Young-influenced leads. And while Farrar isn't likely to get ever over his shyness about direct declarative statements in his lyrics, like Okemah The Search is clearly informed by the political and social malaise of America under George W. Bush, and Farrar's compassionate anger on &quot;Satellite,&quot; &quot;Adrenaline and Heresy,&quot; and the title tune is bracing and powerful. In their original incarnation, Son Volt made a brilliant debut and followed it up with a genuine disappointment, but the second time around, Farrar has followed strength with strength, and The Search is a potent reminder of why Farrar was and is one of the watershed artists of the alt-country movement.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:1eb7d8b02cf0abb38245197f95513e520bbb83c5","amp;dn":"Son+Volt+-+The+Search+%5B2007%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb7d8b02cf0abb38245197f95513e520bbb83c5","infoHashBuffer":{"type":"Buffer","data":[30,183,216,176,44,240,171,179,130,69,25,127,149,81,62,82,11,187,131,197]},"announce":[],"urlList":[]}}