{"title":"The Year Of No Money In Tokyo [ENG] [PDF]","uid":6358629,"size":673663,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ed32e6fee445894bc6b495bd6972f064ed648e5&amp;dn=The+Year+Of+No+Money+In+Tokyo+%5BENG%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"TCMY801ZL","files":1,"time":1304244889,"description":"THE YEAR OF NO MONEY IN TOKYO is an intimate, first-person, true story about triumphing over adversity, in the form of being poor and American, in Japan, during the country`s worst recession, since the Second World War. The book depicts the financial, emotional, and psychological effects of yearlong unemployment on a foreigner in Japan; draws attention to how economic hardship can be an opportunity for reinvention; and highlights an aspect of what it`s like to be black and simultaneously American in Japan. The book will inspire people who have experienced misfortune, by showing them that they can recover, even under the most difficult circumstances. THE YEAR OF NO MONEY IN TOKYO will interest a variety of readers, from economists and financiers, to those concerned with today`s economy, students of Japanese culture, and those who enjoy an uplifting message about hope, human kindness and perseverance. The memoir is a work of creative non-fiction that reads like a novel. Wayne Lionel Aponte`s gift of observation, subtlety, and wry humor make his book an extraordinary pleasure to read.\n","torrent":{"xt":"urn:btih:1ed32e6fee445894bc6b495bd6972f064ed648e5","amp;dn":"The+Year+Of+No+Money+In+Tokyo+%5BENG%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed32e6fee445894bc6b495bd6972f064ed648e5","infoHashBuffer":{"type":"Buffer","data":[30,211,46,111,238,68,88,148,188,107,73,91,214,151,47,6,78,214,72,229]},"announce":[],"urlList":[]}}