{"title":"Conjuring Hitler- How Britain And America Made the Third Reich07","uid":4833640,"size":5402034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ef3e09760251cefcc28806a2f3d73d373a29898&amp;dn=Conjuring+Hitler-+How+Britain+And+America+Made+the+Third+Reich07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Djofullinn","files":1,"time":1239226487,"description":"Product Description\nA fascinating and controversial new perspective on Hitler's rise to power; Provides startling evidence of Britain and America's financial support for the Third Reich; Suggests that the western elite deliberately supported Nazism in the pre-war period to destabilise any alliance between Germany and Russia Nazism is usually depicted as an eerie German phenomenon, the outcome of political blunders and unique economic factors: we are told that it could not be prevented, and that it will never be repeated. Guido Giacomo Preparata shows that the truth is very different: using meticulous economic analysis, he reveals that Hitler's extraordinary rise to power was actually facilitated over the course of a decade following WWI - and eventually financed - by the British and American political classes. Tracing events in the Third Reich, Preparata offers a startling history of Anglo-American geopolitical interests in the early twentieth century. He explains that Britain, still clinging to its empire, was terrified of an alliance forming between Germany and Russia. He shows how Britain, through the Bank of England, came to exercise some control over Weimar and how Britain's financial support for Hitler enabled the Nazis to seize power. Nazism was not regarded as an aberration: for the British establishment of the time, it was a convenient way of destabilising Europe, and driving Germany into conflict with Stalinist Russia. In this way Britain ensured that it would prevent the formation of any rival continental power block. Guido Giacomo Preparata lays bare the economic forces at play in the Third Reich, and identifies the key players in the British and American establishment who aided Hitler's meteoric rise.\n\n\nAbout the Author\nGuido Giacomo Preparata is Assistant Professor of Political Economy at the University of Washington. Born in Boston, Massachusetts, raised in the USA, France and Italy, he completed his PhD in Political Economy and Economic History at the University of Southern California in 1998.","torrent":{"xt":"urn:btih:1ef3e09760251cefcc28806a2f3d73d373a29898","amp;dn":"Conjuring+Hitler-+How+Britain+And+America+Made+the+Third+Reich07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ef3e09760251cefcc28806a2f3d73d373a29898","infoHashBuffer":{"type":"Buffer","data":[30,243,224,151,96,37,28,239,204,40,128,106,47,61,115,211,115,162,152,152]},"announce":[],"urlList":[]}}