{"title":"Duke Ellington - Live At The Whitney (FLAC)","uid":6879852,"size":232915109,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f343bffe9a6c5fa5ecd496ac9c251157f08748d&amp;dn=Duke+Ellington+-+Live+At+The+Whitney+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"tiddler222","files":24,"time":1323614368,"description":"\n\nRecorded live at the Whitney Museum, New York, April 10th 1972.\n\nReview by Scott Yanow:\nLate in his career, Duke Ellington was persuaded on three occasions to take a brief hiatus from his big band and give trio recitals that focused on his piano playing. The final occasion is included on this CD, which was released for the first time in 1995. Although Duke apparently planned very little in advance, his program is a well-rounded set of old standards and newer (and more obscure) works. A week short of his 73rd birthday, Ellington's fingers sound a little rusty in spots, but he clearly gets stronger as the concert progresses. He romps through the beginning parts of his very first composition (the James P. Johnson-inspired &quot;Soda Fountain Rag&quot;) and then abruptly stops, making a few jokes about how &quot;Things Ain't What They Used to Be.&quot; Considering that he never commercially recorded this piece, the excerpt is quite valuable. Also among the highlights are his delightful &quot;A Mural From Two Perspectives,&quot; a nine-minute exploration of &quot;New World A-Coming,&quot; and an emotional &quot;Lotus Blossom.&quot; Many of the performances (half are solo and the remainder use bassist Joe Benjamin and drummer Rufus Jones) are brief - under three or even two minutes long - but there is a great deal of music on this previously unissued program, and some of the moments are quite precious. The audience is enthusiastic and loving, singing along on &quot;I'm Beginning to See the Light&quot; and snapping their fingers on Duke's cues during &quot;Dancers in Love.&quot; \n\n01. Opening Remarks \n02. Medley: Black And Tan Fantasy, Prelude To A Kiss, Do Nothing 'till You Hear From Me &amp; Caravan \n03. Meditation \n04. A Mural From Two Perspectives \n05. Sophisticated Lady &amp; Solitude \n06. Soda Fountain Rag \n07. New World A-Coming \n08. Amour; Amour \n09. Soul Soothing Beach \n10. Lotus Blossom \n11. Flamingo \n12. Le Sucrier Velors \n13. The Night Shepherd \n14. C Jam Blues \n15. Mood Indigo \n16. I'm Beginning To See The Light \n17. Dancers In Love\n18. Kixx \n19. Satin Doll\n\n \n\n","torrent":{"xt":"urn:btih:1f343bffe9a6c5fa5ecd496ac9c251157f08748d","amp;dn":"Duke+Ellington+-+Live+At+The+Whitney+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f343bffe9a6c5fa5ecd496ac9c251157f08748d","infoHashBuffer":{"type":"Buffer","data":[31,52,59,255,233,166,197,250,94,205,73,106,201,194,81,21,127,8,116,141]},"announce":[],"urlList":[]}}