{"title":"SHAREGO EBOOK Obama - The Postmodern Coup Making of a Manchurian","uid":4631911,"size":1542858,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f6ee910d8299e1e4f8306698858f46c359d6ea1&amp;dn=SHAREGO+EBOOK+Obama+-+The+Postmodern+Coup+Making+of+a+Manchurian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dodgerblue","files":1,"time":1231421995,"description":"SHAREGO EBOOK Obama - The Postmodern Coup Making of a Manchurian Candidate\n[IMG]http://i269.photobucket.com/albums/jj44/downarchive2/51plvMVSSwL-1.jpg[/IMG]\nObama - The Postmodern Coup: Making of a Manchurian Candidate\nProgressive Press | 2008-06-02 | 320 pages | PDF | \n\nBarack Obama is a deeply troubled personality, the megalomaniac front man for a postmodern coup by the intelligence agencies, using fake polls, mobs of swarming adolescents, super-rich contributors, and orchestrated media hysteria to short-circuit normal politics and seize power. Obama comes from the orbit of the Ford Foundation, and has never won public office in a contested election. His guru and controller is Zbigniew Brzezinski, the deranged revanchist and Russia-hater who dominated the catastrophic Carter presidency 30 years ago.\n\nAll indications are that Brzezinski recruited Obama at Columbia University a quarter century ago. Trilateral Commission co-founder Brzezinski wants a global showdown with Russia and China far more dangerous for the United States than the Bush-Cheney Iraq adventure. Obama's economics are pure Skull &amp; Bones/Chicago school austerity and sacrifice for American working families, all designed to bail out the bankrupt Wall Street elitist financiers who own Obama. Obama's lemming legions and Kool-Aid cult candidacy hearken back to Italy in 1919-1922, and raise the question of postmodern fascism in the United States today. Obama is a recipe for a world tragedy. No American voter can afford to ignore the lessons contained in this book.\n[img]http://1337x.org/torrentimg-9967.png[/img]","torrent":{"xt":"urn:btih:1f6ee910d8299e1e4f8306698858f46c359d6ea1","amp;dn":"SHAREGO+EBOOK+Obama+-+The+Postmodern+Coup+Making+of+a+Manchurian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f6ee910d8299e1e4f8306698858f46c359d6ea1","infoHashBuffer":{"type":"Buffer","data":[31,110,233,16,216,41,158,30,79,131,6,105,136,88,244,108,53,157,110,161]},"announce":[],"urlList":[]}}