{"title":"Water, Race, and Disease","uid":6541928,"size":1287546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20e63ff7a20aea5f820d885e32ff27e4479b0dcb&amp;dn=Water%2C+Race%2C+and+Disease&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310722133,"description":"Werner Troesken, &quot;Water, Race, and Disease (NBER Series on Long-term Factors in Economic Development)&quot;\n Publisher: MIT Press | ISBN 10: 0262201488 | 2004 | PDF | 288 pages | 1.22 MB\n\n Why, at the peak of the Jim Crow era early in the twentieth century, did life expectancy for African Americans rise dramatically? And why, when public officials were denying African Americans access to many other public services, did public water and sewer service for African Americans improve and expand? Using the qualitative and quantitative tools of demography, economics, geography, history, law, and medicine, Werner Troesken shows that the answers to these questions are closely connected. Arguing that in this case, racism led public officials not to deny services but to improve them--the only way to &quot;protect&quot; white neighborhoods against waste from black neighborhoods was to install water and sewer systems in both--Troesken shows that when cities and towns had working water and sewer systems, typhoid and other waterborne diseases were virtually eradicated. This contributed to the great improvements in life expectancy (both in absolute terms and relative to whites) among urban blacks between 1900 and 1940. Citing recent demographic and medical research findings that early exposure to typhoid increases the probability of heart problems later in life, Troesken argues that building water and sewer systems not only reduced waterborne disease rates, it also improved overall health and reduced mortality from other diseases. Troesken draws on many independent sources of evidence, including data from the Negro Mortality Project, econometric analysis of waterborne disease rates in blacks and whites, analysis of case law on discrimination in the provision of municipal services, and maps showing the location of black and white households. He argues that all evidence points to one conclusion: that there was much less discrimination in the provision of public water and sewer systems than would seem likely in the era of Jim Crow.","torrent":{"xt":"urn:btih:20e63ff7a20aea5f820d885e32ff27e4479b0dcb","amp;dn":"Water%2C+Race%2C+and+Disease","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20e63ff7a20aea5f820d885e32ff27e4479b0dcb","infoHashBuffer":{"type":"Buffer","data":[32,230,63,247,162,10,234,95,130,13,136,94,50,255,39,228,71,155,13,203]},"announce":[],"urlList":[]}}