{"title":"Greg Bear - City at the End of Time","uid":12763501,"size":470331926,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:215af21552b692b0208abcd3d9329f81faa46eb3&amp;dn=Greg+Bear+-+City+at+the+End+of+Time&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":92,"time":1447564273,"description":"Do you dream of a city at the end of time?\r\n\r\nIn a time like the present, in a world that may or may not be our own, three young people–Ginny, Jack, and Daniel–dream of a doomed, decadent city of the distant future: the Kalpa. Ginny’s and Jack’s dreams overtake them without warning, leaving their bodies behind while carrying their consciousnesses forward, into the minds of two inhabitants of the Kalpa–a would-be warrior, Jebrassy, and an inquisitive explorer, Tiadba–who have been genetically retro-engineered to possess qualities of ancient humanity. In turn, the dreams of Tiadba and Jebrassy carry them back, into the minds of Jack and Ginny. As for Daniel: He dreams of an empty darkness–all that his future holds.\r\n\r\nBut more than dreams link Ginny, Jack, and Daniel. They are fate-shifters, born with the ability to skip like stones across the surface of the fifth dimension, inhabiting alternate versions of themselves. And each guards an object whose origin and purpose are unknown: gnarled, stony artifacts called sum-runners that persist unchanged through all versions of time.\r\n\r\nHunted by others with similar powers who seek the sum-runners on behalf of a terrifying, goddess-like entity known as the Chalk Princess, Ginny, Jack, and Daniel are drawn, despite themselves, into an all but hopeless mission to rescue the future–and complete the greatest achievement in human history.\r\n\r\n\r\nRead by Charles Leggett\r\nFormat: MP3\r\nBitrate: 48 Kbps","torrent":{"xt":"urn:btih:215af21552b692b0208abcd3d9329f81faa46eb3","amp;dn":"Greg+Bear+-+City+at+the+End+of+Time","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"215af21552b692b0208abcd3d9329f81faa46eb3","infoHashBuffer":{"type":"Buffer","data":[33,90,242,21,82,182,146,176,32,138,188,211,217,50,159,129,250,164,110,179]},"announce":[],"urlList":[]}}