{"title":"Rush - Hemispheres (1978) [Vinyl] [FLAC]","uid":5958756,"size":772370897,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2180d29bcf22c9d961ac9e2a9746d0c6ab01cb06&amp;dn=Rush+-+Hemispheres+%281978%29+%5BVinyl%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"insinuendo","files":7,"time":1289871642,"description":"Rush - Hemispheres (1978) [Vinyl] [FLAC]\n\nHemispheres is the sixth studio album by the Canadian rock band Rush, released in 1978. The album was recorded at Rockfield Studios in Wales and mixed at Trident Studios in London.\n\nThis album continues Rush's trend of using the fantasy and science fiction lyrics written by Neil Peart. Similar to their 1976 release, 2112, Hemispheres contains a single, epic song broken into chapters as the first half of the album (Cygnus X-1, Book II: Hemispheres) while the second half contains two more conventionally-executed tracks (Circumstances, The Trees), then is rounded out by the nine-and-a-half-minute instrumental, La Villa Strangiato.\n\nThe album contains examples of Rushs adherence to progressive rock standards including the use of epic, multi-movement song structures, complex rhythms and time signatures, and flexible guitar solos, like those found in La Villa Strangiato.\n\nHemispheres was Rush's fourth consecutive Gold album upon release in 1978 and would subsequently go Platinum in the US. - Wiki\n\n\nI ignore who ripped this, but it sounds great.\n\nEnjoy!\n\nVinyl transfer at 32 Bit (floating) / 96kHz.... using cool edit 2.0...saved at 24Bit / 96kHz. No noise reduction...larger pops and clicks (a few anyway) removed using Audition's &quot;remove single click&quot; command by hand only...\n\nSony PS-T20BS Turntable - Sony XL-15 cartrige - Micro-Phono Behringer PP400 Pre-amp - Creative SoundBlaster LIVE!","torrent":{"xt":"urn:btih:2180d29bcf22c9d961ac9e2a9746d0c6ab01cb06","amp;dn":"Rush+-+Hemispheres+%281978%29+%5BVinyl%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2180d29bcf22c9d961ac9e2a9746d0c6ab01cb06","infoHashBuffer":{"type":"Buffer","data":[33,128,210,155,207,34,201,217,97,172,158,42,151,70,208,198,171,1,203,6]},"announce":[],"urlList":[]}}