{"title":"Flyleaf - Memento Mori 2009 (Expanded Edition) FLAC","uid":5300071,"size":462943399,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:21bec7444fdcc0484182154e3a41be59efa15bf2&amp;dn=Flyleaf+-+Memento+Mori+2009+%28Expanded+Edition%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TomasSax","files":1,"time":1264189612,"description":"Memento Mori is the second studio album by American rock band Flyleaf, released through A&amp;M/Octone Records on November 10, 2009.[9] The title is a Latin phrase meaning &quot;be mindful of death&quot; or &quot;remember you will die.&quot; Memento Mori debuted at number eight on the Billboard 200, selling 56,000 units in its opening week.\n\nBackground\n\nThe new album is their follow-up to their 2005 platinum debut. It contains 14 songs, which were selected out of 30 already written[11]. The band reunited with producer Howard Benson to make the album. The album was recorded at Bay7 Studios in Los Angeles, California[12]. It was released on November 10, 2009. Flyleaf has debuted an additional two songs, &quot;Chasm&quot; and &quot;Circle&quot;, from Memento Mori live during a small acoustic tour in Afghanistan for United States Troops[13].\n\nFlyleaf announced that on August 25, 2009, the lead single from Memento Mori titled &quot;Again&quot; will be released to radio as well as to digital retail stores.[14]. Don Tyler directed the music video for &quot;Beautiful Bride,&quot; which was released October 6, 2009. Meiert Avis directed the video for &quot;Again&quot; that was released at 12 A.M. on September 30, 2009, on MTV.[15]\n\nOn November 6, 2009, the album premiered on the official Flyleaf MySpace page.\n[edit]\nPromotion\n\nThe group has announced that, starting in Seattle, Washington, on September 28 they will hold VIP listening parties throughout the country inviting fans to be the first to hear a selection of songs from the new record and view brand new music videos before they air nationwide. By partnering with Eventful, fans were given the opportunity to demand that their city get routed into the &quot;Road To Memento Mori&quot; using Eventful's &quot;Demand It!&quot; service. Based on overwhelming demand there will now be 10-plus events.\n\nFans can expect to see Lacey Mosley and Sameer Bhattacharya or Jared Hartmann, who plan on making special appearances at these intimate gatherings across the country.\n\nWikipedia","torrent":{"xt":"urn:btih:21bec7444fdcc0484182154e3a41be59efa15bf2","amp;dn":"Flyleaf+-+Memento+Mori+2009+%28Expanded+Edition%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21bec7444fdcc0484182154e3a41be59efa15bf2","infoHashBuffer":{"type":"Buffer","data":[33,190,199,68,79,220,192,72,65,130,21,78,58,65,190,89,239,161,91,242]},"announce":[],"urlList":[]}}