{"title":"Democracy Now - 10 nov 2011","uid":6808169,"size":457327160,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:2237d5a077c9d223d81875d8bc60e34f5f0ad25f&amp;dn=Democracy+Now+-+10+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320943601,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 10, 2011\n\n-  Cain Sexual Harassment Controversy Gets Brief Mention at GOP Debate\n-  Perry Forgets Which Government Agencies He'd Axe\n-  Cole Bombing Suspect Appears for Gitmo Tribunal\n-  Iran Defiant on Nuclear Program Following IAEA Report\n-  Syrian Opposition Calls for General Strike\n-  Brazilian Court OKs Belo Monte Dam\n-  James Murdoch Returns to U.K. Parliament for Hacking Testimony\n-  U.S. Air Force Mortuary Admits Dumping Body Parts of Deceased Soldiers\n-  Alabama County That Sued JPMorgan Files for Bankruptcy\n-  Penn State Fires President, Football Coach Over Sex Abuse Scandal\n\n\nSpecial reports\n\n- Italian Financial Crisis Prompts Berlusconi's Exit, Escalates Fears of Europe's Next Massive Bailout\n\nThe European financial crisis continues to worsen as fears grow that Italy may become the latest nation in need of a massive bailout. The European Union Commission admitted today that the entire Eurozone could be plunged into a recession in 2012. While Greece, Ireland and Portugal have already received international bailouts, the debt situation in Italy is considered far more dangerous. It is the eighth largest economy in the world - larger than Greece, Ireland and Portugal combined. On the political front, Italy remains in a state of upheaval as Italian Prime Minister Silvio Berlusconi has pledged to step down after parliament approves sweeping austerity measures geared to placate markets. We go to Rome for an update from Antonio Tricarico, coordinator of the Italian organization Campaign for World Bank Reform and a former economic correspondent at the Italian newspaper Il Manifesto.\n\n\n- Latino Voters Help Dethrone Anti-Immigrant Champion in Historic Arizona State Senate Recall Election\n\nThe architect of the Arizona's controversial anti-immigration law, Russell Pearce, lost a major recall election Tuesday night, becoming the first Arizona state senator ever to do so. He is required to step down immediately and will be replaced by newly elected Republican Jerry Lewis. Pearce wrote Senate Bill 1070, which requires police to investigate the immigration status of people they have lawfully detained. He was also behind an effort to pass legislation aiming to give the state discretion to deny citizenship to the children of undocumented immigrants. For immigrant rights activists, the recall marked the success of a new political organizing strategy that brought together a diverse array of voters representing various religious and political affiliations. We go to Phoenix to talk to Petra Falcon, executive director of Promise Arizona. &quot;People had a choice. They had a choice between someone who demonized immigrants, somebody who divided our state, somebody who cast distress in democracy over somebody who was talking about bringing the community together, living his values as he had been a resident in Mesa for over 30 years,&quot; Falcon says.\n\n\n- Report: Thousands of U.S.-Born Kids Languish in Foster Care As Immigrant Parents Detained, Deported\n\nA new report looks at how thousands of U.S.-born children are being sent to foster care when their non-U.S. citizen parents are detained or deported. The Applied Research Center investigation, &quot;Shattered Families: The Perilous Intersection of Immigration Enforcement and the Child Welfare System,&quot; finds there are at least 5,100 children currently living in foster care - who are prevented from uniting with their detained or deported parents. If nothing changes, researchers found some 15,000 more children may end up in foster care in the next five years. We speak with Seth Freed Wessler, the principal investigator of the report.\n\n\n- Legendary Folk Duo Crosby &amp; Nash on Soundtracking Movements From the 1960s to Occupy Wall Street\n\nJust days after performing at the Occupy Wall Street encampment in Lower Manhattan, the legendary musicians David Crosby and Graham Nash join us live in our studio. For the duo, Occupy Wall Street is the latest in a number of causes they have supported in their historic careers stretching back nearly five decades. They are best known as founding members of Crosby, Stills, Nash &amp; Young, a supergroup that performed at Woodstock and sold millions of records. Both are two-time inductees into the Rock and Roll Hall of Fame. Throughout their careers, politics has played a central role in their music. About the Occupy Wall Street movement, Crosby says: &quot;There's an awful lot of people who feel that they are not represented in Congress, that Congress has been bought by the large corporations, and that they are powerless and are getting the short end of the stick.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2237d5a077c9d223d81875d8bc60e34f5f0ad25f","amp;dn":"Democracy+Now+-+10+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2237d5a077c9d223d81875d8bc60e34f5f0ad25f","infoHashBuffer":{"type":"Buffer","data":[34,55,213,160,119,201,210,35,216,24,117,216,188,96,227,79,95,10,210,95]},"announce":[],"urlList":[]}}