{"title":"THE LIVING MUMMY and friends (1972-1976) 4 COMPLETE series","uid":8120166,"size":1481260353,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2325e4d26f305a8c52fc5af623e744aefb786db3&amp;dn=THE+LIVING+MUMMY+and+friends+%281972-1976%29+4+COMPLETE+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1360382111,"description":"This fills a request by Mothra67 (for the Living Mummy stories). After reading the Wikipedia article about Supernatural Thrillers, I decided to also collect three other horror titles that Marvel launched following the 1971 revision of the Comics Code.\n\nThis torrent contains 67 Marvel comics published from November 1972 to November 1976. They are:\n\nCHAMBER OF CHILLS 01-25\nJOURNEY INTO MYSTERY 01-19\nSUPERNATURAL THRILLERS 01-15\nWORLDS UNKNOWN 01-08\n\nPlease seed and share with our friends here at TPB!\n\n------\n\nFrom Wikipedia:\n\nSupernatural Thrillers #5 (Aug. 1973) introduced the character in a standalone story set in Cairo, Egypt, &quot;The Living Mummy.&quot; N'Kantu the Living Mummy returned two issues later in &quot;The Return of the Living Mummy&quot; by the same team, who brought the character to New York City. With the cover logo reading &quot;Supernatural Thrillers featuring The Living Mummy&quot;, the series ran from #7 to the final issue, #15 (June 1974 - Oct. 1975). With issue #8, the creative team became writer Tony Isabella and artist Val Mayerik, occasionally credited as co-plotter. John Warner wrote or co-wrote the final two issues, with Tom Sutton drawing the finale. Len Wein scripted #10 from an Isabella-Mayerik plot.\n\nSupernatural Thrillers ran 15 issues (Dec. 1972 - Oct. 1975). The title was one of four launched by Marvel Comics editor-in-chief Roy Thomas to form a line of science fiction and horror anthologies with more thematic cohesiveness than the company's earlier attempts that decade, which had included the series Chamber of Darkness and Tower of Shadows. Whereas those titles generally presented original stories, these new books would instead adapt genre classics and other stories.\n\nWith the four titles' debuts set to be staggered over the course of four months, Marvel premiered Journey into Mystery vol. 2 (Oct. 1972), Chamber of Chills (Nov. 1972), Supernatural Thrillers (Dec. 1972), and, with a late start, Worlds Unknown (May 1973). Originally slated to be titled Gothic Thrillers, the first issue of Supernatural Thrillers featured Theodore Sturgeon's 1940 short story &quot;It!&quot;, adapted by writer-editor Thomas and penciler Marie Severin, with cover art by Jim Steranko.","torrent":{"xt":"urn:btih:2325e4d26f305a8c52fc5af623e744aefb786db3","amp;dn":"THE+LIVING+MUMMY+and+friends+%281972-1976%29+4+COMPLETE+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2325e4d26f305a8c52fc5af623e744aefb786db3","infoHashBuffer":{"type":"Buffer","data":[35,37,228,210,111,48,90,140,82,252,90,246,35,231,68,174,251,120,109,179]},"announce":[],"urlList":[]}}