{"title":"An-American-Crime{DVDrip}vice","uid":5295210,"size":451334554,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:233bf78d9a853ffc54b39d8db5e586386c2ea4e2&amp;dn=An-American-Crime%7BDVDrip%7Dvice&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1264032540,"description":"AN AMERICAN CRIME 2007 DVDrip\n\nVIDEO CODEC Xvid\nformat Avi\nsize/res 480x320[wide screen]\nrun-time 01:33:34\nvideo bitrate 512\nvideo framerate 25\nXvid profile asp5\n\nAUDIO CODEC mp3\naudio bitrate 128\nsample rate 44100\na/v sync basic\n\nCAST\n\nEllen Page\nCatherine Keener\nHayley McFarland\nNick Searcy\nRomy Rosemont\nAri Graynor\nScout Taylor-Compton\n\nPLOT\n\nAn American Crime is split into reflections of contemporary and past settings. The contemporary setting is the trial of Gertrude Baniszewski (Catherine Keener), interspersed with lengthy flashbacks into the events described by the witnesses.\n\nSylvia and her sister Jenny (Hayley McFarland) find themselves on the road living between their parents Lester (Nick Searcy) and Betty Likens (Romy Rosemont). The Likens parents, who are professional carnival workers, go on tour together, leaving Sylvia and Jenny in the care of Gertrude Baniszewski, whose daughters the Likens girls have met in church. The Baniszewski household is already overrun with children, and Gertrude is in dire financial straits. Sylvia befriends Paula Baniszewski (Ari Graynor) who confesses to Sylvia that she is pregnant by her married boyfriend. Sylvia swears not to tell.\n\nShortly after the Likens girls' arrival, Gertrude Baniszewski is upset to find that Lester Likens has not sent the weekly money for the girls' board. She punishes the girls by whipping them with a belt. Soon thereafter, Gertrude receives the payment and a letter from the Likens, but throws the letter in the trash and says nothing to the Likens girls.\n\nWhile Paula and Sylvia are out with friends, Paula's boyfriend informs Paula that his wife has come back, then hits Paula when she pleads for him to stay with her. To stop the boyfriend's attack, Sylvia tells him that Paula is pregnant. Paula, furious, vows that Sylvia will pay for spilling her secret. Ricky Hobbs (Evan Peters), who likes Sylvia, observes the scene.\n\nBack at home, Paula tells Gertrude that Sylvia has been spreading lies about her. Gertrude forces Sylvia to apologize, and eventually has the second-youngest Baniszewski child, Johnny, (Tristan Jarred) hold Sylvia so that Paula can beat her. Rumors spread around the school that Paula is pregnant.\n\nJenny finds the letter from her parents in the garbage, prompting Sylvia and her to phone their parents. The call is cut short when they see the Baniszewski children coming. The Baniszewski children tell Gertrude about the phone call. Gertrude believes they stole money to make the long distance call, although they had traded bottles in for money. As a punishment for &quot;stealing&quot;, Gertrude burns Sylvia with a cigarette.\n\nAt a church lunch, Gertrude's youngest child's (baby) father, Andy (James Franco), says Sylvia has been spreading rumours that Paula was pregnant. When Sylvia returns home, Gertrude accuses Sylvia of telling more lies about her daughter, then forces Sylvia to put a Coke bottle up her vagina in front of the family. Gertrude then orders Sylvia to the basement. When Sylvia refuses, both Stephanie's boyfriend (Jeremy Sumpter) and Johnny throw her down the stairs. Jenny asks how long Sylvia will be in the basement, to which Gertrude replies &quot;until she learns her lesson.&quot; Gertrude makes everyone swear that Sylvia was sent to juvenile hall. Johnny begins to bring neighborhood children into the basement so that they can torture Sylvia. When they hesitate, Johnny assures them that it is all right because his mother said that they could. The children visit regularly to beat Sylvia and burn her with cigarettes.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0802948/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0802948/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY THANKS\n\nscreens\n &lt;a href=&quot;\nhttp://img638.imageshack.us/img638/640/vlcsnap2010012021h20m06.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img638.imageshack.us/img638/640/vlcsnap2010012021h20m06.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img638.imageshack.us/img638/4393/vlcsnap2010012021h20m08.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img638.imageshack.us/img638/4393/vlcsnap2010012021h20m08.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img37.imageshack.us/img37/3499/vlcsnap2010012021h20m11.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img37.imageshack.us/img37/3499/vlcsnap2010012021h20m11.png&lt;/a&gt; &lt;a href=&quot;\nhttp://img704.imageshack.us/img704/5595/vlcsnap2010012021h20m48.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img704.imageshack.us/img704/5595/vlcsnap2010012021h20m48.png&lt;/a&gt;","torrent":{"xt":"urn:btih:233bf78d9a853ffc54b39d8db5e586386c2ea4e2","amp;dn":"An-American-Crime%7BDVDrip%7Dvice","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"233bf78d9a853ffc54b39d8db5e586386c2ea4e2","infoHashBuffer":{"type":"Buffer","data":[35,59,247,141,154,133,63,252,84,179,157,141,181,229,134,56,108,46,164,226]},"announce":[],"urlList":[]}}