{"title":"Handbook of Geometric Computing","uid":6538341,"size":8605480,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24d81401160b4d991a6dae591305119c2591f798&amp;dn=Handbook+of+Geometric+Computing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1310587802,"description":"Eduardo Bayro Corrochano, &quot;Handbook of Geometric Computing: Applications in Pattern Recognition, Computer Vision, Neuralcomputing, and Robotics&quot; \n Publisher: Springer | ISBN: 3540205950 | edition 2005 | PDF | 779 pages | 8.20 mb\n\n This handbook is addressed to a broad audience of applied mathematicians, physicists, computer scientists, and engineers. Its purpose is to bring together under a single cover the most recent advances in the applications of geometric computing to the most important fields related to the endeavor of building perception action systems: computer vision, robotics, image processing and understanding, pattern recognition, computer graphics, quantum computers, brain theory and neural networks.\n There have been given increasing efforts to tackle various kinds of problems of these fields using promising geometric methods. Nevertheless, those efforts have been disperse and mostly confined to their own disciplines. To help to overcome this state of affairs, we decided that the time had come to introduce the existing powerful geometric methods in an unified manner to the much larger community of scientists and engineers who are seeking new mathematical tools to solve their ever more complicated problems. The power of human creativity, the progress in geometric calculus and the rapid evolution of computers make it possible to imagine that the challenge to build autonomous intelligent systems is not far from becoming true.","torrent":{"xt":"urn:btih:24d81401160b4d991a6dae591305119c2591f798","amp;dn":"Handbook+of+Geometric+Computing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24d81401160b4d991a6dae591305119c2591f798","infoHashBuffer":{"type":"Buffer","data":[36,216,20,1,22,11,77,153,26,109,174,89,19,5,17,156,37,145,247,152]},"announce":[],"urlList":[]}}