{"title":"Ass Brand New 2 (DVD.xvid) - anal, Shy Love, Julie Robbins, Came","uid":4713571,"size":2327015629,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:24e09fe89e168606f6d250638dcdc00c1edd1c9f&amp;dn=Ass+Brand+New+2+%28DVD.xvid%29+-+anal%2C+Shy+Love%2C+Julie+Robbins%2C+Came&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pure_screens","files":5,"time":1234171657,"description":"Ass Brand New 2 (DVD.xvid) \n\n\n\n\n\n\nscreens (large) + DVD-covers:\n &lt;a href=&quot;\nhttp://scr33ns.blogbugs.org/7343531/Ass-Brand-New-2---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://scr33ns.blogbugs.org/7343531/Ass-Brand-New-2---screens.html&lt;/a&gt;\n\n\n\n\n\n\nThese cum slurping whores erupt into screaming orgasms as they take deep and meaningful anal probing into their cock loaded assholes.\n\n\nActresses\n\n    * Cameron James           [Anal Facial Bald A2M]\n    * Julie Robbins           [Anal A2M]\n    * Pason                   [Anal Facial A2M]\n    * Scarlet Haze            [Anal Facial Swallow A2M]\n    * Shy Love                [Anal Facial]\n \n   \nScene Breakdowns\n\n    * Scene 1. Alberto Rey, Pason\n    * Scene 2. Cameron James, Steve Hooper\n    * Scene 3. Kurt Lockwood, Shy Love\n    * Scene 4. Ben English, Julie Robbins\n    * Scene 5. Manuel Ferrara, Scarlet Haze\n\n\n\n\nCategory: \tAnal, Gonzo\nDirector: \tPat Myne\nStudio: \tMetro\nRelease Date: \tMar 22, 2005\n\n\n\n\nREVIEW:\n\nScene 1: Pason, Alberto Rey \t\nActs Included: Toys, Oral, Vaginal, Anal, Facial\nPositions: Missionary, Doggie, Cowgirl, Reverse Cowgirl, Pile Driver\nCondoms: No\n\nI'm not a big fan of redheads, but Pason is a very sexy girl. She has a decent face, with a really hot body and a great rack. The fun begins with Pason giving a tease that includes toys. She uses a dildo and sticks some anal beads up her ass. Normally toys don't really do it for me, but watching Pason shove that big piece of rubber inside of her was hot. I loved how her tits jiggled during it. Afterwards, Alberto joins Pason. There's a hot oral bit and some pussy eating. The sex that follows is pretty fantastic. I really enjoyed watching Pason's hot body bounce up and down. There was some pretty great action in this scene.\n\n\n\nScene 2: Cameron James, Steve Hooper \t\nActs Included: Toys, Oral, Vaginal, Anal, Facial\nPositions: Missionary, Cowgirl, Reverse Cowgirl, Scissors\nCondoms: No\n\nCameron is a pretty good looking girl. She has a nice tight body and small breasts. The scene opens with a tease and some toy play. I didn't find either very exciting. After a bit, Steve shows up and gives her something to play with. She sucks him off. It starts off pretty dull, which is because the dude is limp. Once he gets some life in his dick, Cameron gets her face stuffed in style! It's a bit more exciting, but still not very hot. The sex is decent. The pair worked well together, but I don't really feel that Cameron came off very sexy.\n\n\n\nScene 3: Shy Love, Kurt Lockwood \t\nActs Included: Toys, Oral, Anal, Facial\nPositions: Doggie, Reverse Cowgirl, Spoon\nCondoms: No\n\n\nShy is a very attractive girl, with a great rack and a hot body. The scene opens with a tease and toy usage, which is short and boring. Fortunately, once Kurt shows up the action gets a lot better. We get a nice blow job, with some timid, but enjoyable face fucking. Afterwards, Kurt takes some time play to use the toys on Shy. Once that is over, they have sex. The action is pretty exciting. They stick to anal and Kurt bangs her pretty hard. There are some great shots of her busty rack.\n\n\n\nScene 4: Julie Robbins, Ben English \t\nActs Included: Oral, Vaginal, Anal, Internal Cum Shot\nPositions: Missionary, Reverse Cowgirl, Pile Driver\nCondoms: No\n\n\nJulie is a decent looking chick. Her face isn't really anything special. It's a bit too plain. However, she does have a hot body and a great rack. She opens with a tease, which I enjoyed. Once Ben shows up, there is some great face fucking. The sex is also very exciting. Ben seems to dominate Julie, working her over and over again. I also liked how hot her body looked throughout the action. They conclude with a vaginal internal cum shot.\n\n\n\nScene 5: Scarlet O'Whora, Manuel Ferrara \t\nActs Included: Oral, Vaginal, Anal, Facial\nPositions: Missionary, Doggie, Cowgirl, Spoon\nCondoms: No\n\n\nScarlet is a girl that has never really done it for me. She does have a nice body, but her face is arguably attractive. However, Scarlet does look a lot better in this scene than I'm used too. The fun begins with a brief tease that turns into a short blow job. None of it was really hot. Most of the excitement in this scene comes from watching her have sex with Manuel. The action is kept up at a good pace, with Manuel delivering like he always does. I enjoyed watching them go at it.\n\n\nConcluding Words: \nThere were a few scenes that I enjoyed in this title. The content is definitely hot enough that it's worth checking out. I enjoyed Pason, Shy and Julie's scenes. The other two scenes were decent. Overall, I just wasn't that impressed with this title. Another thing I really didn't enjoy about this title was the cast. None of the girls in it are truly amazing to look at. They have some nice qualities, but really nothing to make them stand out amongst the masses. Overall, this title has some stuff that is worth checking out. I suggest that you rent it. \n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:24e09fe89e168606f6d250638dcdc00c1edd1c9f","amp;dn":"Ass+Brand+New+2+%28DVD.xvid%29+-+anal%2C+Shy+Love%2C+Julie+Robbins%2C+Came","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e09fe89e168606f6d250638dcdc00c1edd1c9f","infoHashBuffer":{"type":"Buffer","data":[36,224,159,232,158,22,134,6,246,210,80,99,141,205,192,12,30,221,28,159]},"announce":[],"urlList":[]}}