{"title":"Peter Watkins - Punishment park + 2 shorts films","uid":3847019,"size":1121824189,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2587ebd817a438f0f559f92f5edb634fc37b8b42&amp;dn=Peter+Watkins+-+Punishment+park+%2B+2+shorts+films&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"juliosyesman","files":3,"time":1192713259,"description":"Original version (english) - Sous-titres francais\n\nWhile Peter Watkins&amp;#039; films of the 1960s reflected the political turmoil and tumult of that decade, 1971&amp;#039;s Punishment Park offered a disturbing look at the backlash against leftist activism which emerged in the wake of such events as the 1968 Democratic Convention in Chicago and the shootings at Kent State University. Set at some unspecified point in the near future, Punishment Park was inspired by a provision of the 1950 McCarran Internal Security Act, which gives the President of the United States the right to suspend the traditional judicial system in favor of tribunals to deal with people believed to be &quot;a risk to internal security&quot; in the event of what the Chief Executive deems a national emergency. As the McCarran Act also enabled political prisoners to be held in concentration camps rather than conventional penal facilities, Punishment Park follows a group of left-wing dissidents (Black Power activists, antiwar protesters, and a politically oriented folksinger, among others) as they&amp;#039;re given a perfunctory hearing by a panel of military officers and ordinary citizens. They are then offered a choice: they can either serve long stays in prison (seven years is the shortest sentence mentioned), or spend 72 hours in Punishment Park, a section of the Southern California desert. The prisoners are to travel 53 miles on foot in three days, with only minimal provisions of water or food under 110-degree heat, while they are followed by National Guard troops who are permitted to shoot if provoked. If they can complete the hike in the allotted time, they&amp;#039;ll be allowed to go free, though it soon becomes obvious that despite the fact the odds have been stacked against them, the prisoners are being dealt an unfair hand along the trail.","torrent":{"xt":"urn:btih:2587ebd817a438f0f559f92f5edb634fc37b8b42","amp;dn":"Peter+Watkins+-+Punishment+park+%2B+2+shorts+films","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2587ebd817a438f0f559f92f5edb634fc37b8b42","infoHashBuffer":{"type":"Buffer","data":[37,135,235,216,23,164,56,240,245,89,249,47,94,219,99,79,195,123,139,66]},"announce":[],"urlList":[]}}