{"title":"TinyVista Rev02 - eXPerience","uid":4285291,"size":733749248,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:25ad9d2e11504bd093ee729107d7e25b9c3cac89&amp;dn=TinyVista+Rev02+-+eXPerience&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eXPer1ence","files":1,"time":1215656707,"description":"\n _____________________________________________________________________\n\n Windows TinyVista Rev02\n -----------------------\n\n Windows Version ------------&gt; 6.0.6001 (Service Pack 1)\n Vista Edition --------------&gt; Ultimate\n Architecture ---------------&gt; x86\n Install Type ---------------&gt; Unattended\n Product Key ----------------&gt; N/A\n Activation -----------------&gt; Activated Offline, Upon Installation\n WINDOWS Folder Size --------&gt; 2.44 GB\n ISO File Size --------------&gt; 699 Mb\n Install Time (In VMware) ---&gt; 15 Minutes\n\n _____________________________________________________________________\n\n Thank you for trying this cut down version of Windows Vista.\n\n Now in TinyVista Rev02 the whole OS is rebuilt based on SP1.\n\n\n This new edition features:\n --------------------------\n\n-All &quot;Important&quot; Post Service Pack 1 Updates To July 2008.\n\n-Includes All DirectX DLL Files For Gaming. These are the\n &quot;d3dx9_*.dll&quot; and &quot;d3dx10_*.dll&quot; files in WINDOWSsystem32.\n\n-Passes WGA Checks.\n\n-Activated Offline Upon Installation\n\n-Automatic LAN Driver Installation (small selection of LAN drivers)\n\n-Includes Windows Sounds this time in Rev02.\n\n-Transparent Window Title Bar On Maximized Explorer Windows.\n\n-Reg tweak to fool Windows Update into thinking you already have\n the anti-crack hotfix installed.\n\n-Reg tweak to fool Windows Update into thinking you already have\n the Malicious Software Removal Tool for July 2008 installed.\n\n-Desktop eXPerience folder with plenty of goodies!\n\n _____________________________________________________________________\n\n To use this CD, simply burn the ISO file (as an image, not as data)\n with Nero or IMG Burn, then set your PC to boot from the CD, press\n any key when the message appears, then after Vista has loaded the\n files you will only get one screen where you can format your hard\n drive.\n\n You cannot install this special eXPerience version of Windows by\n upgrading, you can only install a clean install onto a formatted\n partition or hard drive, because all the upgrade files are\n removed.\n\n MAKE SURE TO BACK UP YOUR HARD DISK OR PARTITION BEFORE FORMATTING!\n\n Once your partition or disk is formatted, simply click &quot;Next&quot; and\n that is all you have to do - Windows will install within 15 minutes\n all on its own, with additional Vista driverpack to take care of\n your devices, you do not have to touch anything.\n\n The install time of 15 minutes is timed in VMware, if you&amp;#039;re\n installing from a real CD it might take longer. \n\n Windows is activated upon installation and you do not need any\n product key.\n\n This special edition of Windows Vista is fully updated with\n Service Pack 1 and all &quot;Important&quot; hotfixes to July 2008.\n\n NOTE: Hotfix KB940510 is not installed - Windows Update will not\n say you need this hotfix because a registry setting is used to\n make Windows Update think this hotfix is installed. Never install\n this hotfix - it is the Windows Genuine Advantage popups in your\n system tray. This is also known as the &quot;anti-crack&quot; hotfix, that\n allegedly kills the BIOS emulation. In tests, I installed this\n hotfix and rebooted, Windows was still working, no WGA tray crap\n was happening, but I would not risk it, just don&amp;#039;t install the\n hotfox &quot;KB940510&quot; if you see it on Windows Update, just untick it\n and do not install it, even though Microsoft claim this is an\n important hotfix, it isn&amp;#039;t important because it is just the\n &quot;Windows Genuine Advantage&quot; thing. No one needs this.\n\n This installation still includes:\n\n Aero Theme\n Camera support\n Internet Explorer 7\n Printer Support\n Scanner support\n Windows Media Player 11\n Windows Mail (formerly Outlook Express)\n Windows Sounds (Startup, Shutdown, Logoff etc)\n Windows Update website\n\n This is intended to be a functional installation with a lot of\n items removed which I personally class as useless. Please make\n absolutely certain that you check below to see which items are\n removed before jumping the gun and installing this special\n edition of Windows Vista! \n\n _____________________________________________________________________\n\n REGISTRY TWEAKS\n ---------------\n\n This special edition of Windows Vista has over 100 registry tweaks\n to improve performance and your general use of Windows Vista. For\n example - User Account Control is completely removed, you have\n useful additions to your &quot;Computer&quot; icon, like Services and Device\n Manager among other things, you have context menu additions added\n to files and folders like &quot;Take Ownership&quot; in one click, close the\n CD/DVD tray, Windows will tell you exactly what it is doing when\n it is shutting down or booting, the Start Menu is much better\n with useless items like &quot;Search&quot; and &quot;Help and support&quot; removed\n whilst other useful things are added like &quot;Run&quot; and &quot;Administrative\n Tools&quot;, you can register DLL and OCX files by simply double clicking\n them, all the garbage is removed from the left side and bottom of\n Windows to give you more space in your folders, all Windows are set\n to Details View so you can see the file size etc. There are many\n more tweaks than this - check the Registry Tweaks text file in the\n eXPerience folder on the root of this CD for full details.\n\n _____________________________________________________________________\n \n REMOVED COMPONENTS (vLite was used to remove components)\n --------------------------------------------------------\n\n Many components are removed from this edition of Windows,\n this allows this Windows edition to fit on a 700Mb CD.\n\n All of the following components are removed:\n\n ACCESSORIES\n -----------\n-Accessibility\n-Disk Cleanup\n-Mobility Center\n-Speech Support\n-Welcome Center\n-Windows Sidebar and Gadgets\n\n  DRIVERS\n -------\n-Display adapters\n-Diva Server\n-Modems\n-Printers\n-QLogic Fibre Channel Adapter\n-Scanners\n-TV Tuners\n \n GAMES\n -----\n-Game Explorer\n-Inbox Games\n-Premium Inbox Games\n\n HARDWARE SUPPORT\n ----------------\n-Fax Support\n\n LANGUAGES\n ---------\n-Japanese\n-Korean\n-Simplified Chinese\n-Table Driven Text Input Processor\n-Traditional Chinese\n \n MULTIMEDIA\n ----------\n-Media Center\n-Movie and DVD Maker\n-Music and Video samples\n-Sample Pictures\n-Screensavers\n-SideShow\n-Wallpapers\n-Windows Calendar\n \n NETWORK\n -------\n-Connect to a Network Projector\n-Internet Information Services (IIS)\n-Remote Desktop and Assistance\n-Windows Collaboration\n \n SERVICES\n --------\n-Diagnostics\n-Distributed Transaction Coordinator (DTC)\n-Error Reporting\n-Volume Shadow Copy\n-Windows Search\n\n SYSTEM\n ------\n-Beep\n-BitLocker Drive Encryption\n-Component Cache (winsxs)\n-Digital Locker\n-Disk Defragmenter\n-Disk Quota\n-Guided Help\n-Help\n-IMAPIv2 Burning Support\n-Malicious Software Removal Tool\n-Manual Install (Setup.exe)\n-Microsoft Agent\n-Microsoft Message Queue (MSMQ)\n-Natural Language\n-Parental Controls\n-Performance Counters\n-Reliability and Performance Monitor\n-Remote Differential Compression\n-Run a legacy CPL elevated\n-Security Center\n-Sync Center\n-System Restore\n-Tablet PC\n-User Account Control (UAC)\n-Windows Backup\n-Windows Defender\n-Windows Easy Transfer\n-Windows SAT (Performance Index)\n-Windows Ultimate Extras\n\n _____________________________________________________________________\n\n OPTIONS (using vLite)\n ---------------------\n DEP (Data Execution Prevention) = Disabled (AlwaysOff)\n User Account Control (UAC) = Disabled\n AntiSpyware Realtime Protection = Disabled\n Memory requirement = 256MB\n AutoPlay = Disabled\n Paging Executive = Enabled\n Power scheme = Balanced\n Power button = Default\n Sleep button = Default\n Hibernation = Off\n\n TWEAKS (using vLite)\n --------------------\n Control Panel - Classic View = Enabled\n Show hidden files and folders = Yes\n Show protected operating system files = Yes\n Show extensions for known file types = Yes\n IE Phishing Filter = Enabled\n IE Phishing Verification Ballon Tips = Default\n\n ----------------------------------------------------------------------- \n\n The &quot;Last Session.ini&quot; file for use with\n vLite is included in the eXPerience folder\n on the root of this CD.\n\n ----------------------------------------------------------------------- \n\n All &quot;Important&quot; Hotfixes are integrated (using vLite) or installed\n on first login. This brings Windows up to date up to July 2008.\n\n _____________________________________________________________________\n\n eXPerience DESKTOP FOLDER\n -------------------------\n\n When Windows is finished installing you will see a folder called\n &quot;eXPerience&quot; on your desktop. This folder contains the following:\n\n Comodo Firewall - Download and install this! Comodo Firewall Pro is\n the very best software firewall available. You might wonder why you\n would need a firewall since there already is a firewall in Vista,\n but Comodo firewall is far better than the standard &quot;Windows\n Firewall&quot; thats built into Vista.\n\n Desktop Icon Layout - These registry files let you add or remove two\n options on the right-click of your Recycle Bin: &quot;Save Desktop Icon\n Layout&quot; and &quot;Restore Desktop Icon Layout&quot;. This is handy in case you\n change resolution and it moves your icons into the top left corner of\n your screen, you can just restore the icons to their original\n position, as long as you saved the layout beforehand!\n\n Driver Install Tool - This has a small LAN driverpack, this same pack\n is used on installation. You can add driverpacks to this folder, see\n the ReadMe.txt file. Do not be put off by the XP driverpacks - in\n VMware the old XP pack works for the Network adapter. The included\n tool that scans for hardware knows it is running on Vista, its \n unlikely that you&amp;#039;d get a wrong driver installed. Just leave obvious\n ones alone like graphics, its not possible for the XP drivers to run\n on Vista in a lot of cases!\n\n Hibernation - batch files to enable or disable Hibernation. Microsoft\n must have forgotten to put an option in the Windows GUI to enable or\n disable Hibernation! How stupid is that? You could do it in Windows XP,\n but not anymore in Windows Vista. So these batch files allow you to\n instantly turn Hibernation on or off. Hibernation feature is disabled\n in this installation. If you need to use Hibernation you&amp;#039;ll have to\n run the relavent batch file to enable it. NOTE: With Hibernation\n enabled you&amp;#039;re wasting as much hard drive space as the size of your\n RAM so if you have say 2Gb of RAM, then you&amp;#039;re wasting 2Gb of disk\n space.\n\n Keyboard Settings - This install is set to U.S. keyboard by default.\n To quickly open &quot;Regional and Language Options&quot; run the included file\n &quot;Quick Access.bat&quot;. There you can change your keyboard to your own\n country if you need to.\n\n nVidia Hotfix -  If you have an nVidia GeForce graphics card, you\n can always try this hotfix. This is only for nVidia cards, not ATI\n or any other card. I tried to install this and I did not need it,\n testing with an nVidia card so, maybe it is only for speciic cards.\n\n Registry Backup - Simple batch file to create a complete registry\n backup, just double click the &quot;Backup Your Registry.bat&quot; file\n included here.\n\n User Password - Quickly set up your login password.\n\n _____________________________________________________________________\n\n QUICK FAQ\n ---------\n\n Q: How functional is this TinyVista?\n\n A: Very! Things that will zap your performance like System\n Restore and Superfetch are either removed or disabled, but\n you do not need to have such a thing as &quot;System Restore&quot;\n making backups in the background, it just slows your system\n down - instead of using System Restore, use &quot;Acronis True Image&quot;\n backup CD. This install is designed to take away all the things\n that ruin your performance, for example the &quot;Superfetch&quot; service\n causes your hard disk to be constantly spinning, that ISN&amp;#039;T GOOD\n and is just wearing your hard drive out, for what? It seems no\n reason, so this service is  disabled. You can still use a printer,\n digital camera, you still have the Aero Glass theme, Windows Vista\n sounds (the crazy chirping noises, lol) some ethernet drivers and\n modem support... this version of Windows Vista is designed for 99%\n of users to use without you even noticing it is a cut down version,\n that is the main aim of it.\n\n Q: eXPerience, you removed the Chinese language?\n\n A: Yes, I also removed a lot of other things. If you do not\n like whats removed - DO NOT USE THIS INSTALLATION. No one\n is forcing you to use this. Just use the full version from\n Microsoft that uses almost 4 times more hard drive space\n (oh then also add on the size of your RAM for the hiberfil\n sys file which is also disabled in this version, although\n you can easily re-enable it if you need to)\n\n _____________________________________________________________________\n\n Don&amp;#039;t forget to join SnipeR&amp;#039;s Redemption Network!\n\n &lt;a href=&quot; http://forum.retestrak.nl/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://forum.retestrak.nl/index.php&lt;/a&gt;\n\n _____________________________________________________________________\n\n Released: July 2008\n\n _____________________________________________________________________\n\n","torrent":{"xt":"urn:btih:25ad9d2e11504bd093ee729107d7e25b9c3cac89","amp;dn":"TinyVista+Rev02+-+eXPerience","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25ad9d2e11504bd093ee729107d7e25b9c3cac89","infoHashBuffer":{"type":"Buffer","data":[37,173,157,46,17,80,75,208,147,238,114,145,7,215,226,91,156,60,172,137]},"announce":[],"urlList":[]}}