{"title":"Freakaholics #1 (2007) - Ebony Porn XXX","uid":10774893,"size":3079674059,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2638a6741a9588f0832633687900eaa7aba6c2ff&amp;dn=Freakaholics+%231+%282007%29+-+Ebony+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1408113776,"description":"Freakaholics #1 (2007)\n\nShot in HD Widescreen. Whats up ya`ll, I present to you five erotic scenario`s with hot new black talent for your jacking pleasure. Stay with me as this series gets freakier and nastier. Enjoy! Alicia Tyler: When the boss is away the assistant will play! Alicia snoops and finds some big toys to play with. Donna Red: Breaking and entering has never turned out this erotic before. Donna is frightened by the panty sniffer, but gives him a little more to sniff on in return. Ryder Cummings: Good things come in small packages. Ryder opens a box and her inner freak is awakened. Jackie Brown: Sexy maid Jackie is supposed to be cleaning but finds herself caught up in a wild sex adventure with two intruders. Tamara LaMoure: Bossy bitch Tamara takes control in her erotic dream and dominates one lucky bastard to a wet juicy ending.\n\nCast:\n    Marie Luv\n    Donna Red\n    Alicia Tyler\n    Tamara Lamoure\n    Jackie Brown\n    Ryder Cummings\n    Brian Pumper\n    Wesley Pipes\n    Rock The Icon\n    Jean-Claude Batiste\n    Alexander Black\n\nCOVERS AND SCREENS FOUND HERE:    &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!!\n\nLength: Two hours 37 minutes not including extras\nDirector: Alexander DeVoe\n\nCast: Alicia Tyler, Donna Red, Jackie Brown, Ryder Cummings &amp; Tamara Lamoure\n\nForesight: &quot;Pretty Black, Girls, Smoking Hot Sex&quot; is the tagline for Alexander DeVoe's Freakaholics under the Jules Jordan Video line. If that tag doesn't get you excited, I'm not sure what will. There are five scenes on this DVD with some of the hottest women allowing their &quot;inner-freak&quot; to come out and play four our viewing pleasure. All the actors and actresses on this DVD were of African decent and no condoms were used during all of the recorded sexual debauchery that a Jules Jordan Video is known for. For a new twist on things, each scene will start with what the DVD packaging says, and I will add my nickel worth.\n\nScene 1: Marie Luv &amp; Jackie Brown\n&quot;Sexy maid Jackie is supposed to be cleaning, but finds herself caught in a wild sex adventure with two intruders&quot; This is a fantastic set up. Marie Luv, a sexy young ebony woman is tied up in the basement attempting to get loose from her confinement to suck a big fake black dildo, swinging from the ceiling. Like a bad horror movie, Jackie sees the hot little lady struggling and it gets her juices flowing. Jackie, running from Marie, upon her discovery finds herself corned by a dude wearing nylons over his face. Jackie out of pure fright, knows nothing smarter to do than get down on her knees and service her attacker. The scene really heats up when Jackie pushes that fine slim ass out, her face on the floor with her man piston fucking her from behind. The finale ends with a splash of man mayo on her tongue.\n\nScene 2: Ryder Cummings\n&quot;Good things come in small packages, Ryder opens a box an her inner freak is awakened&quot;. Ryder Cummings is a thicker black woman with a big ole butt and super attractive face. After finding a special delivery on her porch, she gets all worked up by the secret contents, and goes to work, rubbing herself. Her man comes down the stairs and investigates in the only smart way that I know. He drops his pants and uses Ryder's excitement to his advantage. After some fantastic deep throat, Ryder climbs on a table and sways her ass cheeks side to side. If that isn't enough to drive anyone crazy, she reaches back and spreads her ass cheeks to allow for even deeper penetration. Hot scene that ends with a cum shot right into her mouth, where Ryder's tongue stud looks like bobber floating in a sea of cum.\n\nScene 3: Donna Red\n&quot;Breaking and entering has never turned out this erotic before. Donna Red is frightened by the panty sniffer, but gives him a little more to sniff in return&quot;. A sick individual breaks into a home not looking for jewelry or a TV. He has something far more sinister on this mind. The man is looking for used panties to sniff. In this house he has hit the mother load. He also finds that the occupant is not away as he expected. Sexy Donna Red is parading around the house in her a cute sexy little garter set when she stumbles on the perp. She locks herself in the bathroom and is finally conned into coming out to play with the panty sniffing freak. Some fantastic oral and 69 footage with face sitting is on the agenda. The hottest part of this scene has Donna's big butt and thighs bouncing when she's riding dick cow-girl style. The scene ends with a cum shot to her face and hair. Once again, this is a well set up scene that makes the fantasy and the sex that much more fun.\n\nScene 4: Alicia Tyler\n&quot;When the boss is away, the sexy assistant will play!! Alicia snoops and finds some big toys to play with&quot;. Alicia Tyler might be my newest favorite porn star. She's the super sexy skinny black woman on the cover of the DVD. Smoking hot body, super hot face. The girl has got it all. Then she shows more. She's wearing a little sexy see-through number when she's digging through her boss's desk, only to find herself some large toys to play with. Boss comes back to the office only to find Alicia's bald pussy out and dripping wet for a real live dick. The sex in this scene is blistering hot with some stunning oral footage on top. The finale consists of a massive facial to Alicia's sexy face.\n\nScene 5: Tamara Lamoure\n&quot;Bossy Bitch Tamera takes control in her erotic dream and dominates one lucky bastard to a wet juicy ending!&quot; This is a trippy scene that starts in a dream like state with some quick POV style sex in blue light. Once the lights come on and the contestants awaken, the sex gets rough. Tamara, a long haired curvy black woman, starts beating the living shit out of her lover. She's dragging him by the hair, sitting on his face that looks like she is literally trying to smother him. The sex continues to be rough with Tamara leading the way, taking a deep dicking in her face and pussy. Super high energy scene that reaches it's pinnacle when Tamara's large ass and thighs are bouncing hard up and down on her man's dick. The scene ends with a slattering of ball batter on her thick butt.\n\nWhere Hard Meets Soft: The first thing that must be mentioned is that the look and feel of this DVD is spectacular. The menus are entertaining, the sound in solid and the video is crisp. This DVD was shot in HD and it shows. The second thing that needs to mentioned is that director Alexander DeVoe did a spectacular job setting up the sex. It's nice and refreshing to see some thought that goes into what is actually being shot in this gonzo saturated adult DVD market. The third item of note, was that the sex was very good. I wasn't a fan of every scene as much as others, but at the end of the day this DVD deserves a Highly Recommend rating. \n\nCOVERS AND SCREENS FOUND HERE:    &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=7&lt;/a&gt;\n\nSHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!! SHARE!!","torrent":{"xt":"urn:btih:2638a6741a9588f0832633687900eaa7aba6c2ff","amp;dn":"Freakaholics+%231+%282007%29+-+Ebony+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2638a6741a9588f0832633687900eaa7aba6c2ff","infoHashBuffer":{"type":"Buffer","data":[38,56,166,116,26,149,136,240,131,38,51,104,121,0,234,167,171,166,194,255]},"announce":[],"urlList":[]}}