{"title":"Classic.Albums.The.Doors.1of2.XviD.AC3.MVGroup.Forum.avi","uid":6669932,"size":854849536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:26771da61135c19c177770acc40606dfe85fae78&amp;dn=Classic.Albums.The.Doors.1of2.XviD.AC3.MVGroup.Forum.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1315835387,"description":"If the Doors had only recordered their debut album they would still have been assured a place in rock and roll history. Released in 1967 the album sounds just as fresh and exciting today as it did then. A mix of blues, rock and jazz, together with the voice and lyrics of Jim Morrison made the album one of the greatest debut albums of all time. \t\t\t\t\t\t\n\nBy the use of interviews, musical demonstration, rare archive footage and live performances, the program tells the story behind the conception and recording of this groundbreaking album. The surviving members of the Doors share their memories of the bands early days, the making of this album, and throw essential light onto living with the lyrical genius Jim Morrison.\t\t\t\n\nWith musical demonstrations from Ray Manzarek, Robby Krieger and John Densmore we hear some of the elements that went into creating the unique sound of the Doors.\t\t\t\t\t\t\t\t\n\nIn exclusive interviews the leading players in this story add insight to the Doors as musicians, composers and leaders of a generation. These include manager Bill Siddons, friend and Beat Poet Michael McClure and Jac Holzman who signed them to Elektra Records. Further insight is provided by musicians Henry Rollins, Perry Farrell, legendary Los Angeles DJ Jim Ladd, fellow film student Paul Ferrara, and music writer Ben Fong Torres. Bruce Botnick, the engineer on this and every subsequent Doors album, guides us through the process of how it was recorded.\t\t\t\t\t\t\t\t\t\n\nThere have been many myths buit up around the Doors, and Jim Morrison in particular. In this program which features cuts from Break On Through (To The Other Side), Light My Fire, End Of The Night, Alabama Song, The Chrystal Ship, Back Door Man, Soul Kitchen and The End, the music takes center stage, confirming the undeniable fact that the Doors eponymous record  was and remains a true Classic Album.\t\n\nBONUS MATERIAL :\nContains over 38 minutes of additional material not included in the TV broadcast\n\nSeries Producers : Nick de Grunwald &amp; Martin R. Smith\nDirector : Bob Smeaton\n\nAn Isis Production in association with NRK (2008)\n\n\nTechnical Specs\n----------------------------\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 2078 kbps\nVideo Resolution: 720x416\nVideo Aspect Ratio: 1.731:1\nFrames Per Second: 25.000\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nPart 1: RunTime: 50:03.120\nNumber Of Parts: 2\nPart 1: Size: 815 MB\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:26771da61135c19c177770acc40606dfe85fae78","amp;dn":"Classic.Albums.The.Doors.1of2.XviD.AC3.MVGroup.Forum.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26771da61135c19c177770acc40606dfe85fae78","infoHashBuffer":{"type":"Buffer","data":[38,119,29,166,17,53,193,156,23,119,112,172,196,6,6,223,232,95,174,120]},"announce":[],"urlList":[]}}