{"title":"WWE The Monday Night War (2004)  DVD-R  PAL","uid":4596075,"size":3979354112,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:27ac40c28cbe02bafd05dbdc161be2d80238d1a7&amp;dn=WWE+The+Monday+Night+War+%282004%29++DVD-R++PAL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coolguy33","files":-1,"time":1230013110,"description":"WWE The Monday Night War (2004)\n\nDVD Release Date:3 February 2004 (USA)\n\n\nMonday Night Wars is the common term describing the period of mainstream televised American professional wrestling from September 4, 1995, to March 26, 2001. During this time the World Wrestling Federation's Monday Night RAW went head-to-head with World Championship Wrestling's Monday Nitro in a battle for Nielsen Ratings each week.\n\nThe ratings war was part of a larger overall struggle between the two companies, which included the use of cutthroat tactics and the legitimate defections of several wrestlers and writers between the two companies. (Extreme Championship Wrestling, while not a party to the ratings battle, was also involved as a tertiary player.) It ended with the sale of WCW by its parent company, AOL Time Warner, to World Wrestling Federation Entertainment, Inc.\n\nRaw and Nitro shared wins in the Monday Night Wars early on, and the rivalry quickly heated up. WCW aired segments entitled &quot;WCW: Where the Big Boys Play!&quot; showing current WWF wrestlers who had formerly wrestled in WCW, including Stone Cold Steve Austin, Triple H and The Undertaker, losing matches. Eric Bischoff also began giving away the results of some of the matches on Monday Night Raw during Nitro (as some of them had been taped weeks before). WWF Women's Champion Madusa (known as Alundra Blayze in the WWF) threw her WWF Women's Championship into a trash can live on the air after jumping to WCW.\n\nWWF had previously taken shots at WCW with a series of weekly sketches featuring parodies of several WCW figures &quot;Billionaire Ted&quot; (Ted Turner), &quot;The Nacho Man&quot; (Randy Savage), &quot;The Hukster&quot; (Hulk Hogan), and &quot;Scheme Gene&quot; (Gene Okerlund). While some skits were mostly parodies, others, particularly those focusing on Ted Turner were quite hostile. The series culminated with a match between the Hukster and the Nacho Man on the &quot;Free For All&quot; show before WrestleMania XII. After WrestleMania XII, the WWF would also gain the advantage over Nitro as well.\n\nIn January 2001, Fusient Media Ventures, led by Eric Bischoff, announced they had bought WCW. The deal was contingent on the Turner networks keeping Nitro on Monday and WCW Thunder on TBS on Wednesday. When Jamie Kellner took over as CEO of Turner Broadcasting, he removed all WCW programming from the network.\n\nWith no national television outlet to air the shows, Fusient dropped their offer to purchase the promotion. As a stipulation in the Nash/Hall lawsuit the WWF filed against Turner Networks, WWF had right of first refusal on WCW and paid around $3 million to acquire certain assets, including the trademarks, logos, and video library. On March 23, 2001, Vince McMahon purchased World Championship Wrestling.\n\nRuntime:1h 29min\nCountry:USA \nLanguage:English \nColor:Color \nAspect Ratio:1.33 : 1 \nDVD5\n\nDVD Extras Are Not Included As This Is The Main Story Only.\n","torrent":{"xt":"urn:btih:27ac40c28cbe02bafd05dbdc161be2d80238d1a7","amp;dn":"WWE+The+Monday+Night+War+%282004%29++DVD-R++PAL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27ac40c28cbe02bafd05dbdc161be2d80238d1a7","infoHashBuffer":{"type":"Buffer","data":[39,172,64,194,140,190,2,186,253,5,219,220,22,27,226,216,2,56,209,167]},"announce":[],"urlList":[]}}