{"title":"TextSoap 7.3.2","uid":7517035,"size":8923205,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:280d3ef27a2d035806b12b28cb1ae1def5ae912f&amp;dn=TextSoap+7.3.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"openarena","files":-1,"time":1344504506,"description":"TextSoap is for people who work with text.\n\nTextSoap effortlessly cleans up text from endlessly different formats. Wash away unwanted characters, spaces, tabs. Fix paragraphs with hard returns at the end of each line, as well as a myriad of other formatting issues that come your way and do it all while retaining desired font styles.\n\nUnlike finding and replacing each of dozens of typical formatting issues or manually perusing through a file to find errors and fixing them by hand, TextSoap can automate that task down to just one click. And you can do it all from within your favorite app using the TextSoap Universal menu.\n\n\nWhat's New\nVersion 7.3.2:\n\nFixed: When using uHHHH to specify Unicode in regex replacement character, app could throw exception.\nFixed: Title case would not work correctly with words that contained diacriticals.\nFixed: Custom OS X Services were sometimes not correctly updated when custom cleaners or groups were changed.\nFixed: Issues with individually importing older custom cleaners (from version 5 or 6).\nFixed: In some cases, older database was not properly converted.\nFixed: App could crash when user deleted last custom cleaner and then created a new custom cleaner.\n\nRequirements\nIntel, Mac OS X 10.6.6 or later ","torrent":{"xt":"urn:btih:280d3ef27a2d035806b12b28cb1ae1def5ae912f","amp;dn":"TextSoap+7.3.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"280d3ef27a2d035806b12b28cb1ae1def5ae912f","infoHashBuffer":{"type":"Buffer","data":[40,13,62,242,122,45,3,88,6,177,43,40,203,26,225,222,245,174,145,47]},"announce":[],"urlList":[]}}