{"title":"Convert VOB to AVI [FREE]","uid":7680870,"size":4890470,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28d1ab655abbb6361032602c0f674c37a5747c7e&amp;dn=Convert+VOB+to+AVI+%5BFREE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1348818340,"description":"As its name show, this software can &quot;Convert VOB to AVI&quot;, it can decode video and audio data in the VOB video files, and convert these to AVI video formats, AVI video formats that program supported include MPEG4, DivX and Xvid, not only AVI video format, this software can convert VOB to WMV, MOV, FLV, 3GP video format also. You can use this software to extract the audio/sound from the VOB video files, with this free program, you create original movie soundtrack by yourself (MP3 format).\n\nThis software is very easy to use, select a VOB file by clicking the &quot;Open&quot; button, choice a output video format, then hit the &quot;Convert&quot; button, this program will show one dialog to ask the output folder, after you select one existed folder or create new folder, program will convert your VOB file at once, the output video file will show on the program interface. This software can support the very large file (more than 2GB, please make sure that you have necessary disk space available on your PC), it can work fine with Windows XP and Windows Vista (include Vista-32bits and Vista-64bits).\n\nThe latest version is 1.3, some bugs have been fixed. Now, the output MOV video format can be playing in Quicktime Player correctly, and the output MPEG4 video format can be play in all most popular media players.\n\n\nSCREENSHOT: http://www.convertvobtoavi.com/convertvobtoavi.gif\n\n &lt;a href=&quot;\nhttp://www.convertvobtoavi.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.convertvobtoavi.com/&lt;/a&gt;\n\nsincerely yours, Fox.","torrent":{"xt":"urn:btih:28d1ab655abbb6361032602c0f674c37a5747c7e","amp;dn":"Convert+VOB+to+AVI+%5BFREE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28d1ab655abbb6361032602c0f674c37a5747c7e","infoHashBuffer":{"type":"Buffer","data":[40,209,171,101,90,187,182,54,16,50,96,44,15,103,76,55,165,116,124,126]},"announce":[],"urlList":[]}}