{"title":"Democracy Now - 06 dec 2011","uid":6868325,"size":458129685,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:294a3a449cd81f1577ae2deff75f0b9ba46d1b11&amp;dn=Democracy+Now+-+06+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1323188273,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 06, 2011\n\n- 50 Killed in Afghan Bombing Targeting Shia Worshippers\n- Pakistan Boycotts Summit on Afghanistan in Germany\n- France, Germany Call for Altering E.U. Treaty in Response to Debt Crisis\n- Senate Dems Press New Vote on Payroll Tax Cut\n- Activists Begin &quot;Take Back the Capitol&quot; Week in D.C.\n- Occupy Arrests Continue Nationwide\n- Hundreds Arrested Protesting Russian Elections\n- Japanese Nuclear Plant Releases More Radioactive Water\n- Report: Massey Faces Record Fine for West Virginia Mine Explosion\n- 2011 Right Livelihood Recipients Honored in Stockholm\n\n\nSpecial reports\n\n- At Durban Summit, Leading African Activist Calls U.S. Emissions Stance &quot;A Death Sentence for Africa&quot;\n\nWe continue our week-long coverage from the United Nations Climate Change Conference COP 17 in Durban, where negotiators from more than 190 nations are in their final week of key talks on fighting climate change. The future of the Kyoto Protocol is in doubt as is the formation of a new Green Climate Fund. With the talks taking place in South Africa, special interest is being paid to how the continent of Africa is already being heavily impacted by the climate crisis. We speak to Nigerian environmentalist Nnimmo Bassey, Executive Director of Environmental Rights Action in Nigeria and Chair of Friends of the Earth International. He is author of the new book, &quot;To Cook a Continent: Destructive Extraction and Climate Crisis in Africa.&quot; &quot;We are still in a situation where the negotiations are being carried out on a big platform of hypocrisy, a lack of seriousness, a lack of recognition of the fact that Africa is so heavily impacted,&quot; Bassey says. &quot;For every one degree Celsius change in temperature, Africa is impacted at a heightened level. This is very much to be condemned.&quot;\n\n\n- Indigenous Activists From Canada Protest Tar Sands Oil at Durban Climate Change Summit\n\nThis morning in Durban, South Africa, a group of youth and indigenous activists from Canada gave delegates to the U.N. climate talks mock gift bags containing samples of fake tar sands along with tourism brochures for Canada and Canadian flags. Kandi Mossett, one of the activists participating in the action, says Canada's reliance on tar sands oil &quot;is the largest catastrophic project that I am aware of on earth right now.&quot; Mossett, who is the Native Energy and Climate Campaign Organizer for the Indigenous Environmental Network, notes that the tar sands extraction process is energy and water-intensive, emits immense amounts of pollution into the air, and destroys the landscape. &quot;To even get to the tar sands they have to remove boreal forests - old growth forests - and they call it 'overburden.' They just scrape it off and get rid of that. And then they dig down and move so many tons of earth,&quot; Mossett says. &quot;Then they squeeze out the last little 10 percent of oil that's actually in the sand. And then they have to use chemicals to make it liquid enough to be able to put it through the pipelines - it's much more toxic than any other kind of, you know, sweet crude oil.&quot;\n\n\n- U.S. Focus on China, India Emissions Burdens World's Poor, Skirts Own Responsibility-Praful Bidwai\n\nWe speak with Indian writer and analyst Praful Bidwai, author of the new book, &quot;The Politics of Climate Change and the Global Crisis: Mortgaging Our Future.&quot; While the U.S. has cited China's emissions as an excuse to slow negotiations on reducing greenhouse gas emissions during the COP 17 talks, Bidwai says that &quot;we cannot forget historical responsibility. Three-fourths of all the greenhouse gases that have accumulated in the atmosphere and will stay there warming us up for thousands of years come from developed countries of the global north led by the United States, which is responsible for more than one-quarter of all emissions accumulated in the atmosphere.&quot; Bidwai also addresses the fallout from the Fukushima nuclear crisis in Japan, which he calls &quot;a turning point&quot; for nuclear power, adding: &quot;I don't see nuclear power surviving in the developed world at all after this. This is the worst crisis of credibility the nuclear energy has ever faced.&quot;\n\n\n- Labor Leaders Call for Review of Decision to Host 2013 UN Climate Talks in Qatar\n\nThe International Trade Union Confederation is condemning the decision by the United Nations to hold next year's climate change conference in Qatar, a Gulf nation known for its restrictive labor laws. Migrant workers comprise 87 percent of Qatar's workforce - none of them are allowed to form or join labors. Democracy Now! spoke with Sharan Burrow, head of the International Trade Union Confederation, yesterday. &quot;We're asking for a review. Clearly, the world should think twice about going to Qatar. It shouldn't have just been a, you know, process decision,&quot; Burrow says. &quot;If there is no review, then we will organize clearly to expose the absolute abuse of human and labor rights by the Qatari authorities.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:294a3a449cd81f1577ae2deff75f0b9ba46d1b11","amp;dn":"Democracy+Now+-+06+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"294a3a449cd81f1577ae2deff75f0b9ba46d1b11","infoHashBuffer":{"type":"Buffer","data":[41,74,58,68,156,216,31,21,119,174,45,239,247,95,11,155,164,109,27,17]},"announce":[],"urlList":[]}}