{"title":"Hawkman continuity (1985-1993)","uid":4143722,"size":715309802,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:2a6fd754bb64e2814595876349bf19d181b8845b&amp;dn=Hawkman+continuity+%281985-1993%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gilgamesh07","files":53,"time":1208624459,"description":"By request from the forums:\n\nThis torrent includes some continuity pieces for the Hawkman collection.\nShadow war of Hawkman, Hawkworld mini, Hawkworld (regular series), and Legend of Hawkman (I know it&amp;#039;s from 2000, but it is small)\n\nHawkman\nFrom Wikipedia, the free encyclopedia\n\nHawkman is a fictional character, a superhero in the DC Comics universe. Created by writer Gardner Fox and artist Dennis Neville, the original Hawkman first appeared in Flash Comics #1 (1940)\n\nIn the late 1970s in Showcase and World&amp;#039;s Finest Comics, Thanagar went to war with the planet Rann (adopted home of Adam Strange). This led to Hawkman and Hawkwoman severing ties with their homeworld, and later fighting The Shadow War of Hawkman (written by Tony Isabella) as Thanagar tried secretly to conquer the Earth.\n\nThe landmark 1985 series Crisis on Infinite Earths resulted in a massive revision of much DC continuity and led to many characters being substantially rewritten. Hawkman was to suffer some of the greatest confusion as successive writers sought to explain his various appearances. In the revised timeline there was a single Earth which had witnessed the JSA in the 1940s and the JLA decades later. Successive revisions sought to establish exactly who had been Hawkman and Hawkwoman at different stages. For the first few years the pre-Crisis incarnations were still used, during which time they were prominent across the DC Universe and joined the latest incarnation of the Justice League.\n\nThen DC decided to reboot Hawkman, in a limited series (which later lead to an ongoing series) entitled Hawkworld originally by Tim Truman, and later John Ostrander and Grant Miehm. In this series, Thanagar was a class society which conquered other worlds to enrich itself. Katar Hol was the son of a prominent official who rebelled against the status quo. He and his partner Shayera were sent to Earth and remained there for some years until Hol was apparently killed.\n\nThis created a host of continuity errors as the new Katar Hol was established as having only just arrived on Earth, raising the question as to who had been around previously. In an attempt to resolve the problem it was established through retcons that the Golden Age Hawkman and Hawkgirl had also operated throughout the 1940s up to the 1990s, and that Nth metal came from Thanagar. They had remained active and then joined the original incarnation of the JLA. Moreover, yet another Hawkman - Fel Andar, a Thanagarian agent - had been the one who joined the Justice League during the 1980s, pretending to be a hero but secretly seeking to infiltrate it.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:2a6fd754bb64e2814595876349bf19d181b8845b","amp;dn":"Hawkman+continuity+%281985-1993%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a6fd754bb64e2814595876349bf19d181b8845b","infoHashBuffer":{"type":"Buffer","data":[42,111,215,84,187,100,226,129,69,149,135,99,73,191,25,209,129,184,132,91]},"announce":[],"urlList":[]}}