{"title":"Michael G. Thomas - Legions of Orion (Star Crusades Nexus #1)","uid":13110631,"size":186974119,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b08f830cba25c1f8dc75613af677ede249f99a2&amp;dn=Michael+G.+Thomas+-+Legions+of+Orion+%28Star+Crusades+Nexus+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":22,"time":1451470362,"description":"Legions of Orion is the first book in the epic new series set in the Star Crusades universe that chronicles humanity's first steps away from Alpha Centauri and beyond.\r\n\r\nA chance discovery on the jungle world of Hyperion leads Alliance scientists on a path to creating a permanent spacebridge to the distant Orion Nebula. In a matter of days, great fleets of military and civilian ships depart for the single greatest expedition since the colonization of Alpha Centauri. Into this great adventure travel two heroes of the war, retired Marines Spartan and Teresa Morato, and their son Jack. Now senior members of an elite private military corporation, they are at the heart of the Alliance bold new plan. Their discovery of buried machines, as well as derelict spacecraft in the first system encountered triggers events that will see the Alliance embroiled in a military conflict like no other. Discoveries of a dead people who have been wiped out by an unknown enemy sends a shudder through the many worlds of the Alliance.\r\n\r\nThe Alliance must make a decision. Either they will have to abandon the riches they have found or they will have to fight for it. In the past the citizens of Centauri have fought amongst themselves for money, fame, power and religion. Now they must unify their many disparate factions including the Zealots and biomechanical warriors known as the Jötnar, if they are to survive in this new world.\r\n\r\nStar Crusades Nexus is a classic work of realistic military science fiction set against the background of the Centauri Alliance's expansion into the Orion Nebula. Also available is the prequel series, Star Crusades Uprising that is set two decades earlier and covers the events of the Great Uprising, that brought humanity to the brink of destruction.\r\n\r\n\r\n\r\n\r\nRead by Brad McDowell\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 8 hrs and 32 mins\r\nUnabridged Audiobook\r\nRelease Date:12-28-15\r\nPublisher: Swordworks Books","torrent":{"xt":"urn:btih:2b08f830cba25c1f8dc75613af677ede249f99a2","amp;dn":"Michael+G.+Thomas+-+Legions+of+Orion+%28Star+Crusades+Nexus+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b08f830cba25c1f8dc75613af677ede249f99a2","infoHashBuffer":{"type":"Buffer","data":[43,8,248,48,203,162,92,31,141,199,86,19,175,103,126,222,36,159,153,162]},"announce":[],"urlList":[]}}