{"title":"Video Thumbnails Maker Platinum 6 5 0 0 +Crack","uid":11996261,"size":20276811,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2b887cfef797cd4125ef6fa737f77f54a2fe12f1&amp;dn=Video+Thumbnails+Maker+Platinum+6+5+0+0+%2BCrack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glaresc","files":1,"time":1433671356,"description":"Here's the latest update of Video Thumbnails Maker. Platinum editions will give you the best features.\n\nVideo Thumbnails Maker allows you to make thumbnails (caps, previews, screen-lists) and screenshots of video files. The utility can be used for home-video cataloging and for network video sharing support. Microsoft .NET Framework 4.0 Client Profile or Microsoft .NET Framework 4.0+ is required to run the application.\n\nThe tool consists of:\n- Video Thumbnails Maker = MAKER\n- Pictures Thumbnails Viewer = VIEWER\n- The main advantage of the VIEWER is the ability to start related video-file right from a thumbnail sheet.\n- Moreover, you can start the video from the moment from which the thumbnail shot has been taken!\n- VTX picture files are required to be generated.\n\nMAKER's Key Features:\n- A thumbnail sheet is generated from a so called &quot;set&quot; of files (pictures from a separate folder or an archive); for instance, if you add a folder with 3 zip-archives and 8 separate pictures in it - 4 sheets will be created (3 for archives and 1 for 8 separate pictures)\n- Plenty of options and special effects (see screenshots above); momentary rendered visual preview of your settings right in the Options window\n- 5 customizable &quot;base&quot;-presets (see examples above); special (non-&quot;MxN&quot;) matrices with big tiles\n- You can generate GIF-animations and HTML Galleries automatically using separate tiles of your sheets\n- Batch processing; you can pause/continue or stop active job at any moment\n- Options preset file format (*.ptm). After you run a preset, the program is automatically opened with the imported tuning\n- Command Line Interface (CLI, works only in activated version)\n- Zip, 7z and Rar archives are fully supported by the MAKER\n\nVIEWER's Key Features:\n- Zip and 7z archives are fully transparent to the program; you can manage a picture without worrying about its actual location; if a pictures is situated in a Zip or 7z archive the program will update the archive automatically\n- Rar archives are partly transparent to the VIEWER (automatic unpacking only); that means you can still navigate through pictures in Rar archives, but you can not delete/rename files in such archives (RAR license restriction)\n*.ptx is a special &quot;thumbnail gallery&quot; or &quot;sheet of thumbnails&quot; file format; it is used by Pictures Thumbnails Viewer; a file with .ptx extension could be easily opened by double clicking on it in any file manager\n*.vtx files are supported (that files are produced by Video Thumbnails Maker); the VIEWER allows you to start the video from its thumbnail sheet\n- Pictures Thumbnails Viewer keeps history of your navigation through thumbnail sheets; so you can &quot;jump back and back&quot; using Escape or Backspace keys\n- You can substitute any part of your thumbnail sheet right from the viewer as well as regenerate the entire sheet\n- Detailed picture info appears when moving the mouse cursor to the right screen border (somewhere at the middle point)\n\nKey Features of The Program:\n- Simple rules.\n- Hi-Scores table.\n- English, Russian, German and French interface languages.\n- Small size of the program.\n- Hot keys.\n\nWhat's New in Version 6.5.0.0:\n- new: New Folder Browser dialog allows you to select multiple folders. You can also toggle &quot;Add SubFolders recursively&quot; feature ON and OFF right on the dialog form. &quot;Switch to classic Browser&quot; button allows you to select a single folder in the old-fashioned way (this also gives you networking capabilities, if necessary).\n- new: &quot;GB&quot; checkbox is added to the Options window. It allows to stamp file size in Gigabytes on thumbnail sheets.\n- new: From now on you can delete related video file right from the VTX viewer.\n- new: Installer detects if the required .NET Framwork is installed and if it is not - it will prompt, download and install the required package.\n- new: &quot;Clear selected&quot; button is added to the main window, it allows to remove selected items from the list of files (&quot;Del&quot; hotkey).\n- new: Support for MXF and MPE video file extensions is added.\n- changed: &quot;Skip video file if ALL required pictures EXIST on the disk&quot; feature speed is increased significantly.\n- changed: Warning message is added to the main window. It says &quot;To prevent crashing, it is recommended not to playback any video files during thumbnail sheets creation&quot;.\n- changed: Hotkey to add folders is changed: Shift+Ins -&gt; Ctrl+Ins.\n- changed: Audio/Video information module is updated.\n- changed: Few cosmetic changes.\n- fixed: Crystal engine used wrong aspect ratio for certain video file formats","torrent":{"xt":"urn:btih:2b887cfef797cd4125ef6fa737f77f54a2fe12f1","amp;dn":"Video+Thumbnails+Maker+Platinum+6+5+0+0+%2BCrack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b887cfef797cd4125ef6fa737f77f54a2fe12f1","infoHashBuffer":{"type":"Buffer","data":[43,136,124,254,247,151,205,65,37,239,111,167,55,247,127,84,162,254,18,241]},"announce":[],"urlList":[]}}