{"title":"Auschwitz: The First Gassing. Rumor and Reality","uid":11824488,"size":9184118,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2cc746f0b96e8298262b7cb8b768ed08f46280b4&amp;dn=Auschwitz%3A+The+First+Gassing.+Rumor+and+Reality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429430007,"description":"Mainstream historians claim that the very first gassing of 850 human beings at Auschwitz occurred on Sept. 3, 1941, in the basement of building no. 11 of the Auschwitz main camp. It is supposed to have lasted 15 hours, followed by another two days of ventilation and removal of the corpses.But when analyzing all available testimonies, which are the ar-chetypes for all later gassing accounts, Mattogno comes to a quite different image in this study:According to this, it happened either in spring 1941, or on August 14, or 15, or on September 3-5, or 5-6, or 5-8, or on October 9, 1941, or in November or December of 1942. The location was either the old crematorium, or one, or all rooms, or even all rooms plus the hallway of the basement of building 11, or somewhere at Birkenau.The victims were either Russian POWs, or partisans, or political commissars, or Poles, or Russian POWs and sick Polish detainees. There were either 200, or 300, or 500, or 696, or 800, or 850, or 980, or 1,000, or 1,400, or 1,663 victims.The poison gas was administered either by SS-man Palitzsch, or by Tom Mix, or by the stran-gler, or by Breitwieser; either into the corridor, or into the cells; a total of three cans, or perhaps two cans into each cell; either through the door, or through a ventilation flap, or through openings above the doors to the cells.The victims died immediately, or perhaps stayed alive for 15 hours. The corpses were removed either the following day, or the following night, or 1-2 days later, or 3 days later, or on the 4th day, or the 6th day. The work took either a whole day, or a whole night, or 2 nights, or 3 nights. The bodies of the victims were either cremated, or buried in mass graves, or partly cremated and partly buried.This total chaos of claims regarding the very first gassing at Auschwitz is typical for all other accounts of homicidal gassings during the Third Reich. It makes it impossible to extract a consistent story. Using original wartime documents, &quot;Auschwitz: The First Gassing&quot; by Carlo Mattogno inflicts a final blow to the tale of the first homicidal gassing","torrent":{"xt":"urn:btih:2cc746f0b96e8298262b7cb8b768ed08f46280b4","amp;dn":"Auschwitz%3A+The+First+Gassing.+Rumor+and+Reality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cc746f0b96e8298262b7cb8b768ed08f46280b4","infoHashBuffer":{"type":"Buffer","data":[44,199,70,240,185,110,130,152,38,43,124,184,183,104,237,8,244,98,128,180]},"announce":[],"urlList":[]}}