{"title":"Jonatha Brooke - Steady Pull [2001] [EAC,log,cue. FLAC]","uid":8981356,"size":396123657,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2cf0b18824f7de2592706b4cac9c6ce0e4f60748&amp;dn=Jonatha+Brooke+-+Steady+Pull+%5B2001%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":17,"time":1380575281,"description":"Artist: Jonatha Brooke\nRelease: Steady Pull\nReleased: 2001\nLabel: Bad Dog Records\nCatalog#: BDR-CD-60802 / Borders Edition (Bonus Tracks)\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk rock\n\n\nimage\n\n1. Linger\n2. How Deep Is Your Love?\n3. Walking\n4. Red Dress\n5. Room In My Heart\n6. Steady Pull w/Michael Franti\n7. Your House\n8. New Dress w/Neil Finn\n9. Digging\n10. Out of Your Mind\n11. I'll Take It From Here\n12. Lullaby\n\nBorders Edition Bonus tracks:\n\n13. Tu Dis Que Tu M'Aimes (How Deep Is Your Love?)\n14. What We Are\n15. Deny\nContinuing her standing as an independent artist, Jonatha Brooke kicks off the millennium with Steady Pull, the second release on her own Bad Dog Records. Steady Pull is at once both inspiring and upsetting. The inspiration is easy to glimpse; it's a wonderful record, smart and catchy, interesting and fresh. The frustration lies not with Brooke, but with the music industry's lack of support for her and similar artists. What kind of cultural climate dictates that the musical and lyrical sophistication that makes Brooke such a brilliant artist may very well keep her from having mass appeal? Much like adult alternative radio's failure to survive in many markets, it is a sad commentary on the state of music at the turn of the millennium, and a large disappointment for fans and artists who love this genre.\nNevertheless, Brooke pursues her clever muse with passion and vigor, not letting up one iota in her quest to be a most literate songsmith. She has always penned tunes that danced just outside the box with poetic lyrics, creative arrangements, and complex chord progressions. Steady Pull pulls no punches in that regard, going further in musical experimentation that her previous efforts. The first track and single, &quot;Linger,&quot; is as straightforward pop as you're going to get from Brooke. It's honest to goodness, verse chorus, tap your toe, bob your head, sing right along pop. But it's just a tease. On the very next song she mixes it up, testing the powers of digital editing, loops, and sampling. Then there's the title track, which leans toward a soulful groove, thumping with the bass of Marcus Miller. Oh that Jonatha. Now, you might notice that she sings quite a bit about dresses. Don't question, just enjoy. Both &quot;Red Dress&quot; and &quot;New Dress&quot; are great songs.\nBrooke also keeps good company; the two noted guest vocalists, Michael Franti and Neil Finn, couldn't have been better chosen, as both are known for their abilities to craft intelligent compositions that are rather overlooked by the masses. And, as far as the musicians go, these guys are all top-notch, including Val McCallum, John Pierce, Davey Faragher, and more. Brooke and Steady Pull deserve the same kind of fierce support in the marketplace as they had in the studio.","torrent":{"xt":"urn:btih:2cf0b18824f7de2592706b4cac9c6ce0e4f60748","amp;dn":"Jonatha+Brooke+-+Steady+Pull+%5B2001%5D+%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cf0b18824f7de2592706b4cac9c6ce0e4f60748","infoHashBuffer":{"type":"Buffer","data":[44,240,177,136,36,247,222,37,146,112,107,76,172,156,108,224,228,246,7,72]},"announce":[],"urlList":[]}}