{"title":"Cassandra Wilson - Glamoured - TQMP","uid":4957029,"size":326166220,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e444dfb3966261bdec5f9d50940d876de6e7f97&amp;dn=Cassandra+Wilson+-+Glamoured+-+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mio959mao","files":5,"time":1245160425,"description":"&quot;Glamoured&quot; is a Gaelic word meaning to be whisked away, says vocalist and songwriter Cassandra Wilson, explaining the title of her new CD. &quot;It's like being in a daydream, those split seconds when you're transfixed and your eyes don't move and you have to shake yourself out of it. This album captures the feeling of that reverie.&quot;\n\nIndeed, Wilson sets such a mood with her trademark mix of first-rate originals and adventurous covers of other songwriters' works, this time picking material by Sting, Bob Dylan, Willie Nelson, Muddy Waters and Abbey Lincoln. Such eclectic tastes come naturally to Wilson, who began her musical career performing in and around her hometown of Jackson, Mississippi. &quot;Down South, musicians have to be able to play in many different circumstances and in many contexts,&quot; she says. &quot;They have to play jazz, they have to integrate the blues, and they have to know country. And the lines are kinda blurry sometimes, 'cause that's what everybody wants to hear.&quot;\n\nFor the recording of &quot;Glamoured&quot; Cassandra once again returned to her hometown of Jackson, Mississippi with a list of good songs and an open mind. &quot;For some albums, I'll have a very clear idea of where I want it to go,&quot; she says, &quot;but this time I had questions about what kinds of sounds to explore.&quot; \n\nFLAC+CUE and covers (booklet and back, but no CD)\n\nenjoy","torrent":{"xt":"urn:btih:2e444dfb3966261bdec5f9d50940d876de6e7f97","amp;dn":"Cassandra+Wilson+-+Glamoured+-+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e444dfb3966261bdec5f9d50940d876de6e7f97","infoHashBuffer":{"type":"Buffer","data":[46,68,77,251,57,102,38,27,222,197,249,213,9,64,216,118,222,110,127,151]},"announce":[],"urlList":[]}}