{"title":"U2 24 Bit Vinyl Pack","uid":8414827,"size":9023398260,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e8aaf5beaf995aa01c5f052c8696574d978a782&amp;dn=U2+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"politux","files":-1,"time":1367004226,"description":"\n  U2 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Style: Alternative, College Rock, Indie Rock, Post-Punk\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,800 - 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  1983 Under a Blood Red Sky\n  1884 The Unforgettable Fire\n  1987 The Joshua Tree\n  1991 Achtung Baby\n  1993 Zooropa\n  2000 All That You Can't Leave Behind\n  2004 How to Dismantle an Atomic Bomb\n  2006 18 Singles  \n\n  Through a combination of zealous righteousness and post-punk experimentalism, U2 became one of the most popular rock &amp; roll bands of the '80s. They were rock &amp; roll crusaders during an era of synthesized pop and heavy metal, equally known for their sweeping sound as for their grandiose statements about politics and religion. The Edge provided the group with a signature sound by creating sweeping sonic landscapes with his heavily processed, echoed guitars. Though The Edge's style wasn't conventional, the rhythm section of Larry Mullen, Jr. and Adam Clayton played the songs as driving hard rock, giving the band a forceful, powerful edge that was designed for arenas. And their lead singer, Bono, was a frontman with a knack of grand gestures that played better in stadiums than small clubs. It's no accident that footage of Bono parading with a white flag with &quot;Sunday Bloody Sunday&quot; blaring in the background became the defining moment of U2's early career -- there rarely was a band that believed so deeply in rock's potential for revolution as U2, and there rarely was a band whose members didn't care if they appeared foolish in the process.\n\n  During the course of the early '80s, the group quickly built up a dedicated following through constant touring and a string of acclaimed records. By 1987, U2's following had grown large enough to propel them to the level of international superstardom with the release of The Joshua Tree. Unlike many of their contemporaries, they were able to sustain such popularity in the '90s by reinventing themselves as a postmodern, self-consciously ironic, dance-inflected pop/rock act, owing equally to the experimentalism of late-'70s Bowie and '90s electronic dance and techno. By performing such a successful reinvention, the band confirmed its status as one of the most popular bands in rock history, in addition to earning additional critical respect.\n\n  With its textured guitars, the band's sound was undeniably indebted to post-punk, so it's slightly ironic that U2 formed in 1976, before punk had even reached their hometown of Dublin, Ireland. Larry Mullen Jr. (born October 31, 1961; drums), posted a notice on a high-school bulletin board asking for fellow musicians to form a band. Bono (born Paul Hewson, May 10, 1960; vocals), The Edge (born David Evans, August 8, 1961; guitar, keyboards, vocals), Adam Clayton (born March 13, 1960; bass), and Dick Evans responded to the ad, and the teenagers banded together as a Beatles and Stones cover band called the Feedback. They then changed their name to the Hype in 1977. Shortly afterward, Dick Evans left the band to form the Virgin Prunes, and the group changed names once again, this time adopting the moniker of U2.","torrent":{"xt":"urn:btih:2e8aaf5beaf995aa01c5f052c8696574d978a782","amp;dn":"U2+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e8aaf5beaf995aa01c5f052c8696574d978a782","infoHashBuffer":{"type":"Buffer","data":[46,138,175,91,234,249,149,170,1,197,240,82,200,105,101,116,217,120,167,130]},"announce":[],"urlList":[]}}