{"title":"WARHAMMER 40000: SPACE MARINE - RROD - XBOX360 - REGION FREE - X","uid":6716007,"size":8278416395,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:2ec88637ae6936a7f2f279550937f0d42c70e0ed&amp;dn=WARHAMMER+40000%3A+SPACE+MARINE+-+RROD+-+XBOX360+-+REGION+FREE+-+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"boobsman","files":86,"time":1317568330,"description":"THIS IS AN XGD3 ISO AND WILL ONLY BE PLAYABLE WHEN LT2.0 IS RELEASED!!!\n\nBecome an unstoppable one-man army in Relic's 3rd person action/shooter\n\nSpace Marine is a fast-paced third person action-shooter from Relic Games allowing players to don the armor of one of the emperor's chosen in a battle for the very survival of humanity.\n\nFeaturing a seamless mix of melee and ranged combat, Space Marine will deliver a true next generation experience when it launches.\n\nStoryline:\nIn Warhammer 40,000: Space Marine you are Captain Titus of the Ultramarines, humanity's last hope for survival in a war-ridden future. Step into the armour of this superhuman warrior and use a lethal combination of deadly weapons to crush overwhelming alien forces. Fight against the savage Orks and the unholy forces of Chaos in a brutally violent world based on the richest science fiction fantasy ever created.\n\n\n3rd person action shooter: Space Marine takes the traditional 3rd person shooter genre and adds a new depth of visceral melee combat to deliver an experience like no other.\n\nExperience life as a Space Marine: Players get the unique experience of life as one of the emperor's chosen, the unstoppable Space Marines.\n\nDevastating weaponry: Players will get to unleash an arsenal of devastating weaponry against their foes.\n\nStorm into battle: Step fearlessly into the heart of combat as an unstoppable Space Marine. Never hide, never cower, just purge all that stand in your way.\n\nUnleash visible violent death: Using an innovative new combat system, switch seamlessly from high-calibre ranged weapons to devastating close-combat strikes. Taking out an enemy has never been so satisfying.\n\nExperience the dark future of Warhammer 40,000: Jump into a rich universe of awe-inspiring landscapes, deadly enemies, immense battles and ruthless annihilation.\n\nTake the battle online: Form your own Space Marine squad or Chaos Space Marine warband and face off in 8 vs 8 online matches. Gain experience and unlock new weapons and armour to customize the Devastator, Assault, and Tactical Marine classes.\n\nPLEASE BE AWARE THIS IS THE SCENE RELEASE OF THE GAME BUT IT IS UNTESTED BY ME AS LT2.0 HAS NOT BEEN RELEASED YET!!!","torrent":{"xt":"urn:btih:2ec88637ae6936a7f2f279550937f0d42c70e0ed","amp;dn":"WARHAMMER+40000%3A+SPACE+MARINE+-+RROD+-+XBOX360+-+REGION+FREE+-+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ec88637ae6936a7f2f279550937f0d42c70e0ed","infoHashBuffer":{"type":"Buffer","data":[46,200,134,55,174,105,54,167,242,242,121,85,9,55,240,212,44,112,224,237]},"announce":[],"urlList":[]}}