{"title":"[TSSeduction] Natassia Dream &amp; Robert Axel (12.03.14) 720p","uid":9753706,"size":1210159816,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:302f205e6d34c05cb83892a4b2764b39d30d3c4d&amp;dn=%5BTSSeduction%5D+Natassia+Dream+%26amp%3B+Robert+Axel+%2812.03.14%29+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zbeast","files":-1,"time":1394694954,"description":"TS Natassia Dream &amp; Robert Axel in The Prelude to &quot;Super Soldier&quot;\n\nWhen you break the law so well, you do not go to jail, you go to the US Military. Robert Axel is a highly skilled, some would say mad, doctor. His practice of memory implantation is highly illegal and highly coveted by Military.\nWhen he is brought to justice for his experiments on humans, he does not get sentenced, instead he is sent to a secret weapons branch of the US Military where Natassia is assigned to his case.\n\nHer mission is to break him down until he realizes his only option is to work for the government. His only route to survival is teach the military the secret to MMT - Memory Manipulation Therapy. Robert, when he finally gives in, will create the perfect military weapon. He will create, The Super Soldier.\n\nAfter months of solitude and grilling hours of interrogation, Robert and Natassia, have grown a silent, tense bound. One that is so strong, as soon as he agrees to work for the government, Natassia sends the guards home and the two rip into each other with passion and urgency. She lets Robert rip her clothes off before she dives at his hard cock, swallowing it with a fierce hunger. When she finally reveals her own cock he can only stare for a quick minute before she rams it into his ass with a fever pitch. She fucks him and fucks him, milks his cock until he explodes and just seeing his load shoot out of his dick, makes her cum her own load all over him. This update is the prelude to TsSeduction's upcoming feature movie &quot;Super Soldier: The Invincible and The Invisible&quot; starring Yasmin Lee, Robert Axel, Marcus Ruhl and Beretta James.\n\nWhen you are above the law, you do not go to jail, you go to weapons training...\n\nDuration: 00:32:45\nVideo: AVC (AVC) 1280x720 29.97fps 4791kbps\nAudio: AAC (AAC LC) 128 kb/s 44.1KHz (2 chnls)\n\nScreens:\n======== &lt;a href=&quot;\nhttp://postimg.org/image/k73r67itj/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/k73r67itj/&lt;/a&gt; &lt;a href=&quot;\nhttp://postimg.org/image/di1t3xmvb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/di1t3xmvb/&lt;/a&gt;","torrent":{"xt":"urn:btih:302f205e6d34c05cb83892a4b2764b39d30d3c4d","amp;dn":"%5BTSSeduction%5D+Natassia+Dream+%26amp%3B+Robert+Axel+%2812.03.14%29+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"302f205e6d34c05cb83892a4b2764b39d30d3c4d","infoHashBuffer":{"type":"Buffer","data":[48,47,32,94,109,52,192,92,184,56,146,164,178,118,75,57,211,13,60,77]},"announce":[],"urlList":[]}}