{"title":"Katmar Packed Column Calculator Version 2.2 + Patch","uid":15323235,"size":2658290,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:30564c707a54bae3ce266a78b8c1ade7b3638ec0&amp;dn=Katmar+Packed+Column+Calculator+Version+2.2+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JeffreyLato","files":1,"time":1468668597,"description":"Katmar Software\r\n\r\nEngineering and Risk Analysis Software\r\n\r\nPacked Column Calculator\r\n\r\nProgram Description\r\n\r\nThe PackCol program performs hydraulic design and rating calculations for packed columns and towers. The design basis for new columns can be approach to flood, maximum capacity or pressure drop. The rating mode allows you calculate the pressure drop and approach to flood for existing columns.\r\nS.I., Metric and English units are supported and the program can convert between these systems of units.\r\nThe Eckert and Robbins correlations are both included to cover the full range of liquid flowrates. Calculated results can be printed in tabular form, and plotted as a Generalized Pressure Drop Correlation diagram or as an Operating Diagram.\r\nThe program includes an extensive illustrated database of packing types from the major suppliers, but custom data can be used as well.\r\n\r\nThe packings included are :\r\n\r\n* Raschig Ring\r\n* Pall Ring\r\n* Berl Saddle\r\n* Cascade Mini-ring ( trademark of Koch (Cyprus) limited )\r\n* Flexiring ( trademark of Koch-Glitsch, LP )\r\n* Hy-Pak ( trademark of Koch-Glitsch, LP )\r\n* Intalox ( trademark of Koch-Glitsch, LP )\r\n* Snowflake ( trademark of Koch-Glitsch, LP )\r\n* Jaeger Tri-Packs ( trademark of Jaeger Products, Inc. )\r\n* Nutter Ring ( trademark of Nutter Engineering )\r\n* Super Torus Saddle ( trademark of Raschig AG )\r\n* Ralu Ring ( trademark of Raschig AG )\r\n\r\n\r\nA detailed illustrated manual and tutorial are included in Adobe Acrobat (i.e. PDF) format. The cost of the program is US $80-00 for a single user license and US $250-00 for a multi-user site license.\r\nThe following screen shots illustrate PackCol in action :\r\n\r\nThe Packed Column Calculator's Main Screen\r\n\r\nThe options for the calculation are set in the boxes across the top of the window. The packing details can be either entered on the left side, or selected from the built in database. The gas and liquid details are keyed in on the right and then the calculation can be performed. This form shows the basic results, and a more detailed set of results can be obtained by clicking the &quot;Detail Calc&quot; button.\r\n\r\nThe Packed Column Calculator's Packing Database\r\n\r\nAn extensive database of standard packings is built into the Packed Column Calculator program. Custom packing factors and data can be keyed in, and saved as a calculation template for future re-use.\r\n\r\nThe Generalized Pressure Drop Correlation Diagram\r\n\r\nPlotting the Generalized Pressure Drop Diagram allows the PackCol results to be easily compared with hand calculation results, and to get a &quot;feel&quot; for how stable the column is likely to be.\r\n\r\nThe Operating Diagram\r\n\r\nAlthough the Operating Diagram is discussed in every handbook on column design, it is simply too much work to produce by hand and was rarely used in the past. However, PackCol generates the Operating Diagram instantly - giving the engineer an extremely powerful tool to investigate the effect of changes in liquid and gas flow.\r\n\r\nKatmar Packed Column Calculator Version 2.2 with pre-patched .exe by LAVteam (Thanks!)\r\n\r\n1. Disconnect from the Internet\r\n2. Run Setup\r\n3. After setup finishes, copy the patched Pcol.exe to C:Program Files (x86)Packed Column Calculator (or other directory if you have installed it elsewhere)\r\n4. Make sure to run the program always by admin rights. (change settings so that program runs always by admin rights)\r\n5. When program starts go to Register&gt;Permanent Registration and put any name and serial you want. The patched .exe will show it's activated and available for 365 days.\r\n5. Make sure AioFlo.exe is blocked at the Firewall from connecting to the Internet\r\n\r\nLicense says it's valid for 365 days. If you want this time not to end :\r\n1. Change time at your windows clock and put it some years before 2016\r\n2. Wait for the next Katmar Packed Column Calculator update.\r\nIf you like the app, don't forget to seed or help with a seedbox!","torrent":{"xt":"urn:btih:30564c707a54bae3ce266a78b8c1ade7b3638ec0","amp;dn":"Katmar+Packed+Column+Calculator+Version+2.2+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30564c707a54bae3ce266a78b8c1ade7b3638ec0","infoHashBuffer":{"type":"Buffer","data":[48,86,76,112,122,84,186,227,206,38,106,120,184,193,173,231,179,99,142,192]},"announce":[],"urlList":[]}}