{"title":"Business Card Maker v2.50 Portable (registered)","uid":7123307,"size":14222649,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:30f6165e501a0bc0c336589d0a73027bffaf210a&amp;dn=Business+Card+Maker+v2.50+Portable+%28registered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1332439495,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnassasary regestry changes,\nThis makes a portable version a better version.\n\nSmartsysSoft Business Card Maker helps you design and print professional-looking business cards ease. With which, you can Create your own one or double-sided, horizontally or vertically aligned business cards using text, your own logo, artwork and shadows. It comes with a lot of business card templates and hundreds ofBackgrounds and symbols that can be used to build your cards easily and quickly. SmartsysSoft Business Card maker is also professional quality printing software. You can get very high quality printed cards when designs translate well into printing. It supports to print on any standard business card papers from Avery, DECAdry, Sigel, Formtec, and Herma directly. Also it is allowed to save your design as a high quality image with BMP, JPEG, GIF, PNG, TIFF format for outside quality printing. SmartsysSoft Business Card maker works like a great vector graphics editor program. Not only can you choose shapes from a vast library, but also all paths of each shape can be modified visually by anchor tools. By that, you can create unique shapes as you needs freely. Many drawing elements such as symbols, shapes, texts, images, photos, lines and curves can be added to your design and each one painted very smoothly andFASTER. Besides that, SmartsysSoft Business Card maker supports vector objects (Texts, shapes, symbols, lines etc...) can be filled and stroked with solid color, gradient colors,","torrent":{"xt":"urn:btih:30f6165e501a0bc0c336589d0a73027bffaf210a","amp;dn":"Business+Card+Maker+v2.50+Portable+%28registered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30f6165e501a0bc0c336589d0a73027bffaf210a","infoHashBuffer":{"type":"Buffer","data":[48,246,22,94,80,26,11,192,195,54,88,157,10,115,2,123,255,175,33,10]},"announce":[],"urlList":[]}}