{"title":"EnigmaT Set Rips { Cuts } - July 31st, 2014","uid":10670698,"size":1159878699,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3183ea4bf2fc29681b98cc06be39e80cf68bd215&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+31st%2C+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":143,"time":1406866209,"description":"100 Kilo Maarten - Brain Stops Doing Things (Junkie Digital Remix) (GDJB Rip)-enTc\n2 Faced Funks &amp; Jimmy Clash - Skyhawk (Cut From W&amp;W Set)-enTc\nAeden - Agartha (Mhammed El Alami &amp; Johannes Fischer Remix) (Cut From Uplift Set)-enTc\nAerodroemme - Lost In Space (Cut From Basil Set)-enTc\nAir Night - Last Words (UDM Remix) (Cut From Uplift Set)-enTc\nAlex Kunnari feat. Jacob Luttrel - Fly Away (Sean Mathews Remix) (Set Rip)-enTc\nAlex Wackii - Gravity (Original Mix) (Cut From Ollie Set)-enTc\nAlikast - Mepho (Original Mix) (-Streamrip- From 9Axis Set)-enTc\nAlikast feat. SoundGate - Frozen (Original Mix) (-StreamRip- From 9Axis Set)-enTc\nAlter Future - Ukraine (Original Mix) (Cut From Feel Set)-enTc\nAndy Blueman - Oldies ID 1 (Cut From Uplift Set)-enTc\nAndy Woldman &amp; Denis Sender feat. Simon Latham - Dreams (Original Mix) (Cut From Del Mar Set)-enTc\nAntony Waldhorn - Epilogue (ASOT 674 Rip)-enTc\nArman Bahrami Feat. Marjan - Surrended By Voices (Original Mix) (Cut From Del Mar Set)-enTc\nArman Bahrami Feat. Marjan - Surrounded By Voices (Original Mix) (Cut From Feel Set)-enTc\nArmin van Buuren - Ping Pong (Dani Deahl Remix) (Cut From Armada Set)-enTc\nAruna - Start A Fire (Jonathan Pitch Remix) (Cut From Feel Set)-enTc\nAruna with Mark Eteson - Let Go (Expectance Remix) (Cut From All Stars Set)-enTc\nBeat Service feat. Jess Morgan - When You Won't Come Home (Set Rip)-enTc\nBeatsole - Girl On The Beach (Original Mix) (Cut From Del Mar Set)-enTc\nBEDUK - Koyver Kendini (DJ Tarkan Remix) (Set Rip)-enTc\nBEDUK - Starlight (DJ Tarkan Remix) (Set Rip)-enTc\nBob Marley - Sun Is Shining (Leon Bolier Remix) (Cut From W&amp;W Set)-enTc\nCarl Tricks - Rock On (Cut From Page Set)-enTc\nChris Schweizer - The Fire Inside (Original Mix) (Cut From Ben Gold Set)-enTc\nChris SX - Sands Beach (ASOT 674 Rip)-enTc\nClean Bandit - Extraordinary (Still Young Remix) (Cut From Page Set)-enTc\nClockwork feat. Taylr Renee - Signals (Cut From Page Set)-enTc\nDan Thompson - Outcast (ASOT 674 Rip)-enTc\nDanilo Ercole feat. Roberta Harison - Chill Drops (Alternative Mix) (Cut From Ercole Set)-enTc\nDannic feat. Bright Lights - Dear Life (Bassjackers Remix) (Cut From W&amp;W Set)-enTc\nDanny Larry - Shadow (O.B.M Notion Remix) (Cut From Kaneda Set)-enTc\nDeadmau5 - Phantoms Can't Hang (KhoMha Remix) (Set Rip)-enTc\nDeepUniverse &amp; Blue Wings - Bring Back Your Sun (Blue Wings Mix) (Cut From All Stars Set)-enTc\nDeepUniverse &amp; Blue Wings - Bring Back Your Sun (Dima Krasnik Instrumental Mix) (Cut From Uplift Set)-enTc\nDelerium feat. Leigh Nash - Innocente (Falling In Love) (Markus Schulz Remix) (Set Rip)-enTc\nDestineak vs. Barnes &amp; Heatcliff - Up So High (Cut From W&amp;W Set)-enTc\nDigital Junkies &amp; Jacob Ross - ID (GDJB Rip)-enTc\nDisfunktion - Syxe (Paul Oakenfold Edit) (ASOT 674 Rip)-enTc\nDiversion - 505 (Cut From Ellis Set)-enTc\nDJ RaySim - Euthand (Moreno J Remix) (-StreamRip- Cut From 9Axis Set)-enTc\nDJ Tarkan - Broken Up (Set Rip)-enTc\nDJ Tarkan - Dol Guldur (Set Rip)-enTc\nDJ Tarkan - Toksin (Set Rip)-enTc\nDropgun - Amsterdam (Cut From Tritonal Set)-enTc\nDropgun - Amsterdam (Cut From W&amp;W Set)-enTc\nDuck Sauce - NRG (Skrillez &amp; Kill The Noise &amp; Milo &amp; Otis Remix) (Cut From Gold Set)-enTc\nEllie Lawson &amp; Proyal - Crystalise (Dan Thompson Dub Remix) (Cut From Ben Gold Set)-enTc\nEmrah Barut - Love Never Forgets (Original Mix) (-StreamRip- From 9Axis Set)-enTc\nEprog130 &amp; Hazem Beltagui - Eclipse (Cut From Ellis Set)-enTc\nFerry Corsten - Festival Crash (Talla 2XLC 140 Remix) (ASOT 674 Rip)-enTc\nFillchi - Mausoleum (Original Mix) (Cut From Ben Gold Set)-enTc\nFunabashi with Ralph Novell - Dimension Seven (Abstract Vision Remix) (Cut From Feel Set)-enTc\nFuture Disciple - The Mayans Are Coming Back (Original Mix) (Cut From Oakenfold Set)-enTc\nG. Pal - Aegean Sea (DJ Tarkan &amp; V-Sag Remix) (Set Rip)-enTc\nGai Barone - Chasing Karol (Set Rip)-enTc\nGrum - Raindrop (Cut From W&amp;W Set)-enTc\nHaig &amp; Raffi - Votum Separatum (Original Mix) (Cut From Del Mar Set)-enTc\nHard-Fi - Fire In The House (Simon Patterson Remix) (ASOT 674 Rip)-enTc\nHarlan Buskes feat. Alana Aldea - Remember Me (Beatsole Remix) (Cut From Del Mar Set)-enTc\nHarmonic Rush - Complicated (A &amp; Z Remix) (Cut From A&amp;F Set)-enTc\nHassen B - Land Of Happiness (Quatri Remix) (Cut From Feel Set)-enTc\nHenrix &amp; Adrien Mezsi - Raverz (2014 Version) (Cut From Gold Set)-enTc\nHenrix &amp; Sevag - Latina (Original Mix) (Cut From Gold Set)-enTc\nHenrix - Acid Rave Sex (Original Mix) (Cut From Gold Set)-enTc\nHenrix - Universal Sound (Original Mix) (Cut From Gold Set)-enTc\nHristian - Hold on (Philippe EL Sisi Remix) (Cut From OzzyXPM Set)-enTc\nHusman - Paragon (Cut From W&amp;W Set)-enTc\nJamie Knowles - Global Emotive (Tangle Remix) (Cut From Feel Set)-enTc\nJericho Ismael - Hypnotized (Jim Ross Remix) (Cut From Oakenfold Set)-enTc\nJewelz &amp; Sparkz - Dope (Clean Edit) (Cut From Gold Set)-enTc\nJewelz &amp; Sparkz - Kingdom (Original Mix) (Cut From Gold Set)-enTc\nJewelz &amp; Sparkz - Pharaoh (Original Mix) (Cut From Gold Set)-enTc\nJoe Bermudez feat. Amanda Brigham - Shadows (Mike Saint-Jules Dark Moon Mix) (Set Rip)-enTc\nJohn O'Callaghan - The Saw (Original Mix) (Cut From A&amp;F Set)-enTc\nJohn O'Callaghan feat. Jennifer Rene - Games (Ian Standerwick Remix) (Cut From A&amp;F Set)-enTc\nJuly Child - When You Call (Extended Mix) (Cut From Armada Set)-enTc\nJumpstar feat. Ron Carroll - We Did Alright (Henrix &amp; Sevag Remix) (Cut From Gold Set)-enTc\nJuose - Joguito (Cut From Uplift Set)-enTc\nKenneth Thomas - The Heart Speaks (Roddy Reynaert Remix) (Cut From Oakenfold Set)-enTc\nLance Mathard - Diamante (NuWord Remix) (Cut 2 From Feel Set)-enTc\nLee Osborne &amp; Allen Watts - Telepathy (ASOT 674 Rip)-enTc\nLeolife - Like It (Rene Ablaze Remix) (Cut From A&amp;F Set)-enTc\nLutzenkirchen - Spring Break (Rummy Sharma &amp; Chris Zippel Remix) (Cut From Oakenfold Set)-enTc\nM.I.K.E. Push - Bomba (Cut From MIKE Set)-enTc\nMajai - Code (Ronski Speed Vocal Remix) (Cut From Suzy Set)-enTc\nMarco V - Chayton (Cut From Page Set)-enTc\nMarkus Schulz feat. Lady V - Erase You (Omair Mirza Remix) (Set Rip)-enTc\nMarkus Schulz featuring Seri - Message in the Sky (Remember This) (GDJB Rip)-enTc\nMartin Volt &amp; Quentin State - Rush (Cut From W&amp;W Set)-enTc\nMatt Darey feat. Cath Porter - Blossom &amp; Decay (DJ Tarkan Remix) (Set Rip)-enTc\nMedad - Protons (Ismael Younis Remix) (-StreamRip- From 9Axis Set)-enTc\nMeridian - Shine (GDJB Rip)-enTc\nMichael A - Restless Wind (Dustin Nantais Remix) (Cut From Solid Stone Set)-enTc\nMichael Flint - Oblivion (Original Mix) (Cut From Suzy Set)-enTc\nMostfa &amp; Mostfa - Nosara (Altered States Remix) (Cut From Del Mar Set)-enTc\nMostfa &amp; Mostfa - Nosara (French Skies Remix) (Cut From Suzy Set)-enTc\nMuttek - Prometeo (Original Mix) (-SHORT- Cut From Taylor Set)-enTc\nNick Arbor &amp; Simon Lovell feat. Illuminor - The Stranger (Original Mix) (Cut From Del Mar Set)-enTc\nNikita Leonenko - Knock In Your Head (Stake Remix) (Cut From Oakenfold Set)-enTc\nNoMosk &amp; Roman Messer feat. Christina Novelli - Lost Soul (Daniel Kandi Remix) (Cut From Feel Set)-enTc\nNoMosk and Roman Messer - Lost Soul (Cold Rush Dub Mix) (Cut From Ben Gold Set)-enTc\nOliver &amp; Tom - F350 (Jamie Drummond Remix) (ASOT 674 Rip)-enTc\nOllie - Amande (Original Mix) (Set Rip)-enTc\nOmair Mirza - Checkmate (Set Rip)-enTc\nOsvaldo Nugroho - Hell Yeah (Original Mix) (Set Rip)-enTc\nOsvaldo Nugroho feat. Cherryl - Breathe (Original Mix) (Set Rip)-enTc\nPablo Artigas - Arcadia (Andre Berger's Big Room Edit) (GDJB Rip)-enTc\nPaul Oakenfold - Ibiza (Paul Oakenfold Full On Fluoro Mix) (ASOT 674 Rip)-enTc\nPaul Rigel - Autumn Falls (Cut From Uplift Set)-enTc\nPaul Rigel - The Key of the Universe (Cut From Uplift Set)-enTc\nPaul van Dyk &amp; Ummet Ozcan - Come With Me (Paul van Dyk Festival Mix) (ASOT 674 Rip)-enTc\nPaul van Dyk feat. Austin Leeds - Verano (Digital X Remix) (Set Rip)-enTc\nPhi Phi &amp; Airwave - Vanilla (Gai Barone Remix) (Set Rip)-enTc\nPryda - Shadows (Dart Rayne &amp; Yura Moonlight Remix) (GDJB Rip)-enTc\nR3hab &amp; NERVO Feat. Ayah - Ready For The Weekend (Cut From W&amp;W Set)-enTc\nRafael Osmo &amp; Itzik Aviv - Revolution (GDJB Rip)-enTc\nRAM &amp; Susana - RAMelia (Lounge Edit) (Cut From Del Mar Set)-enTc\nRene Ablaze &amp; DJ T.H. with Sally Jane Corlett - Where Love Lies (Mike Saint-Jules Remix) (Cut From All Stars Set)-enTc\nReOrder - Beyond Horizons (Ula Bootleg) (Cut From Uplift Set)-enTc\nRimastronic - Futurave (Original Mix) (Cut From MIKE Set)-enTc\nRobert Vadney - Zoomanity (Original Mix) (Cut From All Stars Set)-enTc\nSanterna - Attraction (Intro Mix) (Cut From All Stars Set)-enTc\nScott Bond &amp; Marc Mitchell - Airfoil (Ian Standerwick Remix) (ASOT 674 Rip)-enTc\nSebastian Relius feat. Zoidiva - Nothing Can Come Between Us (DuKa Remix) (-StreamRip- Cut From 9Axis Set)-enTc\nSephano &amp; Torio - The Twin Paradox (Dave Neven Remix) (Cut From Del Mar Set)-enTc\nSix Senses - Amlia (Original Mix) (Cut From ReOrder Set)-enTc\nSMN - Sunday Symphony (Original Mix) (Cut From Armada Set)-enTc\nSprintribe - 3rd Spiral (Cut From Basil Set)-enTc\nSteve Angello vs. AN21 &amp; Sebjak - GODS (KhoMha Intro Edit) (Set Rip)-enTc\nTapenwechsel - Feelings (Original Mix) (Cut From Armada Set)-enTc\nTenishia feat. Maria Nayler - Lifetime When Right (ASOT 674 Rip)-enTc\nTJR feat. Dirt Nasty - Polluted (TAITO Remix) (Cut From W&amp;W Set)-enTc\nTransport - Alpine (Original Mix) (Cut From Kaneda Set)-enTc\ntranzLift - Neverending Love (Diverted 100 Anthem) (Cut From Romel Set)-enTc\nTriceratops - Floor Bomb (Original Mix) (Cut From Taylor Set)-enTc\nV-Sag - Stay (Set Rip)-enTc\nVenom One feat Jonathan Mendelson - Earthquake (Mr. Pit Remix) (Set Rip)-enTc\nVitaly Otto - Speedway (Beatsole Remix) (Cut From Del Mar Set)-enTc\nWellenrasuch - Dream Within a Dream (GDJB Rip)-enTc\nWinkee - Awakening (Giuseppe Ottaviani Remix) (Cut From A&amp;F Set)-enTc\nYeah Yeah Yeahs - Maps (Tommie Sunshine, CID &amp; Modern Machines Remix) (Cut From W&amp;W Set)-enTc\nZirenz - Chased By The Sun (Alexander Williams Dub Mix) (Cut From Kaneda Set)-enTc\n","torrent":{"xt":"urn:btih:3183ea4bf2fc29681b98cc06be39e80cf68bd215","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+July+31st%2C+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3183ea4bf2fc29681b98cc06be39e80cf68bd215","infoHashBuffer":{"type":"Buffer","data":[49,131,234,75,242,252,41,104,27,152,204,6,190,57,232,12,246,139,210,21]},"announce":[],"urlList":[]}}