{"title":"MenOnEdge------MoE-34196 John Smith MP4","uid":9332074,"size":2093169401,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:31fbeb2ca17636777615e54c47eedb88456d24f7&amp;dn=MenOnEdge%5C------MoE-34196+John+Smith+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1386786375,"description":"REQUEST\n\n\nMenOnEdge MoE-34196 John Smith MP4\n\n\nStraight stud bound, edged and milked multiple loads\n\n\nMp4 Only\n\n\nSebastian's photographer buddy let him use his space and equipment while he's away so he and Van decide to use it as a way to lure in hot guys. Their 1:30 appointment shows up and introduces himself as John Smith, a straight dude who's under the impression he's showing up for an underwear photoshoot. When John least expects it, he's pounced on from behind and finds himself bound and blindfolded. With his arms and legs bound, John's underwear is cut from his body and tied around his mouth to gag him with. Despite his struggles, John's nice big cock grows rock hard as the two perverts play with his cock. As they tease his cock, John's made to suck Sebastian off before he's bound in a hogtie. His cock dangling between his legs, John has dildo's shoved in his holes as he's lifted off the ground and suspended in the air. Sebastian sucks the straight boy's cock as he swings through the air before Van and Sebastian torment his feet with some tickling. Down on the couch, John has a ball gag in his mouth while Van and Sebastian use a vibrator on his cock with one shoved up his ass. We jack him off with the fleshlight before shoving the prostate massager up his ass as John blows a huge load of cum all over himself. We continue to tease him as we tickle the bound stud and tease him with some post-orgasmic torment.\n\n\nScreens               \n  &lt;a href=&quot;\nhttp://www.menonedge.com/site/shoot.jsp?shootId=34196&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.menonedge.com/site/shoot.jsp?shootId=34196&lt;/a&gt;\n\n\n12 000 uploads,13k here we come, and if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)    \n\n\nCheers  :-)","torrent":{"xt":"urn:btih:31fbeb2ca17636777615e54c47eedb88456d24f7","amp;dn":"MenOnEdge%5C------MoE-34196+John+Smith+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31fbeb2ca17636777615e54c47eedb88456d24f7","infoHashBuffer":{"type":"Buffer","data":[49,251,235,44,161,118,54,119,118,21,229,76,71,238,219,136,69,109,36,247]},"announce":[],"urlList":[]}}