{"title":"Walang Hanggan Episodes 161-203","uid":8651881,"size":8468455403,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3263c119f33f0307722f9c90617b36b52bbb1ba7&amp;dn=Walang+Hanggan+Episodes+161-203&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Alexdokko","files":44,"time":1373127831,"description":"The story spans three generations.\nCruz sisters Virginia (Susan Roces) and Margaret (Helen Gamboa) vie for the love of Joseph Montenegro (Eddie Gutierrez) in the fictional province of Olivarez. Virginia had to sacrifice everything to let Margaret live a better life with Joseph. Around two decades later, Margaret and Joseph's son Marco (Richard Gomez) develops feelings for Emily Cardenas (Dawn Zulueta), a daughter of a worker in their plantation. However, numerous circumstances and Margaret's haughtiness towards Emily prompts Marco to marry rich banker Jane Bonifacio (Rita Avila) - much to Emily's detriment. It fuels the Virginia-Margaret rivalry more, especially when Marco migrates to the US after Emily shuns him when he tries to explain.\nMeanwhile, laborer William Alcantara (Joel Torre) settle in Olivarez with his children Katerina (Julia Montes) and Tomas (Joem Bascon). He adopts a streetboy named Daniel (Coco Martin) while working at the Cruz family business, where Virginia assumes a role as his adoptive grandmother. Daniel first plays around with Katerina but they gradually develop a friendship over the next several years. Marco and Jane return home with their children Johanna (Melissa Ricks) and Nathan (Paulo Avelino), with the latter becoming interested in Katerina as well. Virginia and Margaret's rivalry affects the children. Emily reemerges with a plan to avenge her woes by taking all the shares in the business. At the same time, Nathan schemes to get Daniel out of the way so he can marry Katerina. After Tomas stabs Daniel, Emily saves him and they escape to live in Italy as Emily and Daniel Guidotti. When Daniel and Emily came back to the Philippines, Katerina was already married to Nathan.","torrent":{"xt":"urn:btih:3263c119f33f0307722f9c90617b36b52bbb1ba7","amp;dn":"Walang+Hanggan+Episodes+161-203","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3263c119f33f0307722f9c90617b36b52bbb1ba7","infoHashBuffer":{"type":"Buffer","data":[50,99,193,25,243,63,3,7,114,47,156,144,97,123,54,181,43,187,27,167]},"announce":[],"urlList":[]}}