{"title":"XL Girls - Brandy Ryder [1080p]","uid":14155625,"size":1163193545,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:32f994ba6484a7674d08ed3171ba066a41775661&amp;dn=XL+Girls+-+Brandy+Ryder+%5B1080p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hunter534","files":1,"time":1459657854,"description":"Our XL Girls man-on-the-scene and his faithful cameraman ask Brandy Ryder a lot of questions, including how she likes her sex. &quot;I like it rough,&quot; Brandy admits in a sweet voice. &quot;I like to be spanked but not too hard.&quot; They ask Brandy to take her 40FF tits out of her top and lick the nipples. They have Brandy sway her tits from side-to-side hands-free, a sight all true breast-men love. Then they ask Brandy if she would like a hard cock to suck on. When they're done drooling and marveling over Brandy, Mr. Rios comes over to her and drops his pants. Brandy's blow job technique is perfect, with enough hands-free mouth-fucking and cock-worship to win a high rating. Our man takes a brief intermission to suck her nipples and savor the taste. Now it's time to insert cock into pussy so they go off to another room. Brandy strips down to her high-heeled shoes and gets the hearty pounding she hinted that she wanted. After her pussy has been given a good screwing, Brandy does what we have asked our directors to capture many times. Brandy gives his cock a vigorous stroke-off while her other arm lifts up her boobs to give him a better look. The combination of her hand job, her tongue hanging out of her mouth to catch his nut, the sight of her delicious hooters and her yearning-for-cum expression....all of these horny things combine to make our XL Girls stud give his load to Brandy.\r\n\r\nSize: 1.08 GiB\r\nTime: 00:19:07\r\nFormat:MP4\r\nGenre: Big Tits, BBW, Redhead\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-57008039306fb.html \r\n \nhttp://photo-up.info/img-570080311bfe0.html","torrent":{"xt":"urn:btih:32f994ba6484a7674d08ed3171ba066a41775661","amp;dn":"XL+Girls+-+Brandy+Ryder+%5B1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32f994ba6484a7674d08ed3171ba066a41775661","infoHashBuffer":{"type":"Buffer","data":[50,249,148,186,100,132,167,103,77,8,237,49,113,186,6,106,65,119,86,97]},"announce":[],"urlList":[]}}