{"title":"High Entropy Alloys","uid":14596711,"size":20670580,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3319971f48282ee82adb11f6c473ef60ecc6f076&amp;dn=High+Entropy+Alloys&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463016073,"description":"High Entropy Alloys - B.S. Murty et al. (BH, 2014).pdf\r\n\r\nISBN 978-0-12-800251-3\r\n\r\nThis book provides a complete review of the current state of the art in the field of high entropy alloys (HEA). The conventional approach to alloy design is to select one principal element and add elements to it in minor quantities in order to improve the properties. In 2004, Professor J.W. Yeh and his group first reported a new approach to alloy design, which involved mixing elements in equiatomic or near-equiatomic proportions, to form multi-component alloys with no single principal element. These alloys are expected to have high configurational entropy and hence were termed as &quot;high entropy alloys.&quot; HEAs have a broad range of structures and properties, and may find applications in structural, electrical, magnetic, high-temperature, wear-resistant, corrosion-resistant, and oxidation-resistant components. Due to their unique properties, high entropy alloys have attracted considerable attention from both academics and technologists. This book presents the fundamental knowledge present in the field, the spectrum of various alloy systems and their characteristics studied to date, current key focus areas, and the future scope of the field in terms of research and technological applications.\r\n\r\n\r\nEncompasses the synthesis and phase formation of high entropy alloys\r\nCovers design of HEAs based on thermodynamic criteria\r\nDiscusses the structural and functional properties of HEAs\r\nProvides a comparison of HEAs with other multicomponent systems like intermetallics and bulk metallic glasses","torrent":{"xt":"urn:btih:3319971f48282ee82adb11f6c473ef60ecc6f076","amp;dn":"High+Entropy+Alloys","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3319971f48282ee82adb11f6c473ef60ecc6f076","infoHashBuffer":{"type":"Buffer","data":[51,25,151,31,72,40,46,232,42,219,17,246,196,115,239,96,236,198,240,118]},"announce":[],"urlList":[]}}