{"title":"The Anthony Cumia Show 2015-04-09 Siblings Day MP4 MP3","uid":11808107,"size":397657798,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:34ce7bdb600b5889ce3d0f60421e45accbfa5816&amp;dn=The+Anthony+Cumia+Show+2015-04-09+Siblings+Day+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"mothergoose58","files":2,"time":1428674116,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Siblings Day with Brother Joe, Dawn Cumia Costello, Joe Currie\n\nEpisode 143 - It's sibling day on TACS with the Cumia kids! Joe and Dawn join Ant and we're treated to a trip down memory lane with plenty of throwback pictures, a slew of stories including players in their past, shitty old jobs, their parents marriages, trips to and from California, adventures with pot, parenting styles, and their own relationships. We learn how Joe Currie got the nickname &quot;Plank Foot&quot;, Plank Foot sits with the gang to get in on the fun while they talk about Brother Joe joining the Army, Army buddies, using comedy as a self-defense mechanism, their old apartment, their passion for paintballing, drunken tales, run-ins with the law, the tightness of the Cumia kids, and Rotgut over the years. The crew wraps up the show talking about the good and bad of social media, the permanence of public records, cameras being on everything, they tell us where to find them next, and then gift us with an incredible sing-along.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:34ce7bdb600b5889ce3d0f60421e45accbfa5816","amp;dn":"The+Anthony+Cumia+Show+2015-04-09+Siblings+Day+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34ce7bdb600b5889ce3d0f60421e45accbfa5816","infoHashBuffer":{"type":"Buffer","data":[52,206,123,219,96,11,88,137,206,61,15,96,66,30,69,172,203,250,88,22]},"announce":[],"urlList":[]}}