{"title":"DARK.XBOX360-COMPLEX","uid":8627047,"size":7838695464,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:35180d6032d75dcf4de6d2dcfddd0869cb864134&amp;dn=DARK.XBOX360-COMPLEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"host92","files":2,"time":1372534875,"description":"Year: 2013\nGenre: Action / RPG / 3D / 3rd Person / Stealth\nDeveloper: Realmforge Studios\nPublisher: Kalypso Media\nRegion: Region Free\nPublication Type: License\nFirmware: LT +1.9 / LT +2.0 / LT +3.0\nDashboard: 16202\nLanguage: English\nType of translation: No We live in a time of the cult vampire metrosexuals. The once-terrifying &quot;children of the night&quot; became the object of adoration of schoolgirls, if the stars catalogs male underwear. Authors DARKotkazalis from distortion of the image of the blood-suckers, and decided to return to the myth of the vampire its primordial essence. Vampires - creatures of darkness, and in the memory of the people they were deadly beings who can kill with his bare hands of any mortal.\nIt was such a monster player will be able to feel the draft DARK - predator who leads his bloody hunt. But not all so simple: any hunter, even a vampire can always be a victim. In igreDARK you come across numerous rivals - from simple guards to elite soldiers of the mysterious squad M17 and, of course, his fellow vampires. You are able to choose their own path through the city, dotted with enemies - enemies to save a life, a shadow crept past them, or tear them apart using his superhuman abilities. Play is fun and fans of &quot;stealth&quot; games, and for those who prefer open battle and rivers of blood. Her in-game DARK more than enough to scare even the brave.\nSurvive the fight vampire Eric Bayne with similar, players will be able in the second quarter of 2013. Baine help find the &quot;I&quot;. Vampires and cyberpunk - the best combination for the action-packed hit of spring!","torrent":{"xt":"urn:btih:35180d6032d75dcf4de6d2dcfddd0869cb864134","amp;dn":"DARK.XBOX360-COMPLEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35180d6032d75dcf4de6d2dcfddd0869cb864134","infoHashBuffer":{"type":"Buffer","data":[53,24,13,96,50,215,93,207,77,230,210,220,253,221,8,105,203,134,65,52]},"announce":[],"urlList":[]}}