{"title":"Men Are Better Than Women - by Dick Masterson (VAULTTACK).pdf","uid":4915305,"size":68147804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3636e6f3cb07e9b6f287451a733ffeff90d32cb9&amp;dn=Men+Are+Better+Than+Women+-+by+Dick+Masterson+%28VAULTTACK%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vaulttack","files":1,"time":1243391292,"description":"Through a process of exhaustive man research he calls &quot;keeping his eyes open,&quot; Dick Masterson has compiled a Magnum-size list of the ways men are better than women. It is an infallible compendium of man's greatness, filled with the most egregiously fallacious arguments ever put to words, but with some kind of miraculous, rock-solid man logic dripping like motor oil from every sentence. It is a manifesto more memorable than bullshit like High Fidelity or which Axe baby powder Maxim thinks you should slap on your nuts before clubbing, more chock-full of devastating man quotes than Oscar Wilde with two wangs. Most important, it is the only one of its kind. In Men Are Better Than Women, Dick Masterson dispenses logic from his man mouth into the eyes of his male readers like some kind of mighty mother man eagle with nutrient-rich word vomit. It's a book that makes you feel like driving a train into a dynamite factory and then tearing a telephone book apart with your bare hands, just because that's the way men have always done it.\n\nMasterson's chapters are simple and self-contained, demand no commitments from readers, and have an immediate payoff. Men Are Better Than Women is a dangerous work of satire -- not dangerous in a revolutionary sense, but dangerous in that it walks the razor-thin line between cruelty and absurdity. That line is called hilarious. \n\nA Word from the Pirate :\n\nBrought to You by Vaulttack a man... using his man brain to mangeneer a free copy of the infamous book by Dick Masterson.","torrent":{"xt":"urn:btih:3636e6f3cb07e9b6f287451a733ffeff90d32cb9","amp;dn":"Men+Are+Better+Than+Women+-+by+Dick+Masterson+%28VAULTTACK%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3636e6f3cb07e9b6f287451a733ffeff90d32cb9","infoHashBuffer":{"type":"Buffer","data":[54,54,230,243,203,7,233,182,242,135,69,26,115,63,254,255,144,211,44,185]},"announce":[],"urlList":[]}}