{"title":"Francoise Cambayrac  VÃƒÂ©ritÃƒÂ©s sur les maladies ÃƒÂ©mergentes","uid":5424483,"size":31824223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36795a7d3ad027b11528978292663712cb7a6761&amp;dn=Francoise+Cambayrac++V%C3%83%C2%A9rit%C3%83%C2%A9s+sur+les+maladies+%C3%83%C2%A9mergentes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"john41q","files":2,"time":1268202946,"description":"This torrent contains two books:\n1. Dr Daunderer's book &quot;AMALGAM&quot;(translated in english) relating his DMPS chelation treatment of more than 8000 patients across 30 years of practice in Germany. His book is very simple and informative. A reference for anyone seeking to understand amalgam poisonning.\n\n2. Francoise Cambayrac's &quot;VÃƒÂ©ritÃƒÂ©s sur les maladies ÃƒÂ©mergentes&quot; account of her ordeal and triumph over mercury poisonning, dedicated posthumously to french epidemiologist Dr Melet who cured her and her two children using DMPS and DMSA chelation therapy. This book explosive's revelations has taken the French health alternative mouvement by storm. It's the fourth reedition inside just one year .\nDr Melet was a very competent and consciensous scientist, whose attempts in medias to warn against mercury amalgam caused the wrath of the French medical establishment. After being unjustly suspended from practice and harassed in the press by his oponnents, Dr Melet sank in despair and took his own life (2005). This book extremely well referenced seeks to scrupulously distinguish fact from fiction when it comes to mercury detoxification as Dr Melet indicated.\n\nIt's in french, but i include here a short resume:\n\n\nFrancoise Cambayrac is a 30 year old married woman with two children who in 2004 suddenly falls gravely ill. The medical establishment remains hopelessly unable to diagnose her.\nIt begins with severe back and neck pains, then complete and unexplained physical exhaustion, insomnia. Her arms and feet begin to swell and to itch, then she has trouble moving them.\nAfter one year of every possible and imaginable medical test (who end up perfectly normal) the specialists stand at a complete loss; to her great dismay, they pronounce her psychosomatic (sounds familiar ?).\n\nFinally, luck strikes in the person of a veterinary (of all people!) who examines her blood under a light microscope and discovers red blood cell anomalies typical of mercury poisonning; she indeed has eleven of those in her mouth.\n\nFrancoise discovers mercury does leech from them (in a physical, chemical and electrical way simultaneously). Yet, medics, dentists and people believe them to have been thoroughlly tested and proven inert once stored in the mouth.\n\nFrancoise then books an apointment with a biological dentist to remove her eleven amalgams (cost: 15 thousands euros).\nBig mistake as the full required protections aren't applied;she faints as soon as the first one is removed. The dentist calls her symptoms &quot;normal&quot;.\nAfter the whole removal procedure has been completed, her health has inexplicably deteriorated even further (spasms, suffocations, paroxystic pains, tremors, sudden paralysis,diziness,swollen limbs, insensibilities, loss of voice, cardiac and respiratory problems) and she's now unable to live by herself.\n\nDoctors cannot help in any way except drown her in calmants, anti-pain pills and somniferes.She's branded a psychiatric case.\n\nFrancoise then decides to once more consult outside mainstream medecine and finds a naturopath who attributes her symptoms to the mercury stored in her body and prescribes chlorella to evacuate it.\nYet after 5 months she shows absolutely no improvement.\n\nFate brings Francoise to Dr Melet, an epidemiologist who studied the amalgam problem extensively and whose conclusions are rejected by both conventional and alternative practitionners;\nthe removal of a single amalgam releases 2 year's equivalent mercury vapors from it!( easily proven with a mercury vapor analyser (brand name &quot;JEROME&quot;).\nThe patient will breathe in this newly released mercury if not enough protection measures are implemented (sometimes even if they are) and it will trigger even more crippling diseases.  \n\nFrancoise begins the chelation treatment and her health starts to improve for the first time in 18 months;Dr Melet educates here on every aspect and trap he has experienced in this field.\n\nFrancoise is nearly cured when tragedy strickes Dr Melet;irate for being insulted and betrayed by the french medical establishment,and realising incredously how much disinformation exists on this problem, she compiles an extensive amount of scientific litterature to check and recheck what she learned.\nThis easily understanble book strives to spare others her ordeal and warns on the utter irresponsability by French medical establishment over the amalgam issue.\n\nHere are some facts:\n\nChronic mercury poisonning (mis)detection:\n\nThe only reliable test available to asses chronic mercury poisonning is the chelation test (DMPS/DMSA provocation test) from urine.\n\nMedics are taught to detect sudden mercury poisonning by dosing mercury from a simple blood test; but mercury blood levels can read perfectly normal while the person is gravely intoxicated, because the mercury leeching from amalgams only persists in the blood for a few days and then enters the cells where it remains undetected for many years( the half life in the brain is 13 to 28 years).This has been published in numerous scientific journals, but authorities choose to ignore it entirely.\n\nAs chronic mercury exposure officially doesn't exist in France,\nurgentists and doctors remains unable to diagnose this condition.\n\nThe many and costly batteries of tests showing no abnormalities either, chronicly intoxicated people are swiftly branded mental cases.\n\nNotes: the majority of mercury analysis laboratoires advertising on the net are'nt trustworthy at all; fiable measures can only be achieved through european agreed loboratories( ISO DAR 2009 agreement).\n\nThe porpyrin test specific of mercury poisonning has only a 15% detection rate and is thus absolutly useless.\n\n\nMercury damage:\n\nEach filling equals roughly to a thermometer's mercury content; after 15 years half of this mercury has escaped and permeated all organs (principally the kidneys and the brain, the liver,...) altering the immunitary, hormonal,endocrine,digestif and nervous systems where it shuts down the respiratorey enzyme systems giving energy to the cell.\n\nThe worst situations are gold crowns capping an amalgam restored tooth; the generated electro current is extremely potent and leeches a very large amount of mercury from the amalgam.\n\n\nPost mortem analysis of dentist's hypophysiary glands show mercury concentrations 35 times the norm, even though they stopped their practice tens of years beforehand.\nTheir brains contains 80 times the norm.\nThere's 60% more suicides amongst the dentist profession; the incidence of brain tumor is twice the norm; the incidence of malformations and low IQ is higher among dentist's babies, because over half of mother's mercury pool crosses the placentary barrier and lodges itself in the foetus (foetus blood is charged 4 times mother's mercury blood).\n\n\nMercury depletes the body from it's Zinc pool, which in turn causes other heavy metal to accumulate (copper (especially),lead, arsenic, cadmium). It paralyses the detoxification enzymes in the body,causing toxin accumulation over time (pesticides, formaldehyde,...).\n\n\nThere exists no scientific study proving their non-toxicity; many countries have or are in the process of banning them (Japan and Russia (since 1985),Norway(2008), Sueden (1999),Germany (not taught anymore), Australia, Canada, Austria and America are restraining their usage).\n\nMercury kills nerve cells.Thimerosal containing vaccines cause a greater incidence of autism .\n\nEven after removals, patient's breath still contain nearly the same amount of mercury than beforehand, because mercury has permeated the body of the tooth, the adjacent bones and soft tissues (salivary glands,...).\n\nTwo people out of three are able to eliminate mercury before it reaches the dangerous levels triggering crippling diseases, (as long as their excretion mechanism aren't overloaded with massive amounts of mercury like during unprotected amalgam removal).\n\n\nTreatement:\n\nThere are no natural products able to chelate the mercury lodged inside our organs. Only the powerful synthetic chelators DMPS and DMSA engineered in 1957 have a proven track record of achieving chelation (intravenous or oral). Their usage must be done under medical supervision and associated with mineral supplementation.\nAn exact protocol has been devised by the International Board of Clinical Metal Toxicology (IBCMT) and practitionners exist in nearly every country (http://www.ibcmt.com/WebPage-Membership.html)\nThe safety and reliability of this chelation treatment has been proven for more than 50 years (see Dr Daunderer book).\n\nDMSA (and alpha lipoic acid) is hydrosoluble AND liposoluble (unlike DMPS, only hydrosoluble).Which means it could shift higher concentrations of extracellular fluid mercury into cells, poisonning the brain. This is why DMPS is used first to decrease the extracellular mercury, and DMSA is only given at the end of the therapy, as to further detoxify the organs .\n\nAmalgams should only be removed at the end of the DMPS/dmsa chelation therapy(1 to 2 years) when the bulk of mercury lodged in the body has been evacuated.\n\nIf amalgams are removed with poor/no protection measures before the chelation treatment, the added poisonning will require a much lenghtier detoxification process (2 to 4 years).\n\nThe chelation treatment has shown to restore health to incurable cases of fibromyalgia,chronic fatigue syndrom, multiple sclerosis, allergies, etc... as many show high levels of heavy metals during the provocation test.\n\nNOTE: To the exception of proved allergy to mercury/others amalgam constituents (Elisa test)it is never an emergency to replace the amalgams.\nFirst detoxify the body, then remove with the maximum possible precautions (see book).\n\nIt is possible to combine careful amalgam removal followed ( a few hours) by intravenous administration of DMPS/DMSA  (if allergy proven by Elisa)\n\nYet naturopaths reject this notion and advise patients to immediately remove amalgams fillings while prescribing herbs, mushrooms, chlorella, coriander, bear garlic and other costly miracle products supposed to detoxify (and who paradoxally contain sometimes themselves mercury and other heavy metals).These people, unable to prescribe any drug, see in DMPS/DMSA a threat to their livelihood and attempt to scare away patients from it.\n\nMost of the medical authors denouncing the dangers of mercury amalgams advise people to get rid of them without paying attention to the required safety precautions. This is extremely dangerous for both the patient and the dentist.\n\n\nMercury's involvement in a few diseases:\n\nDepression: it responds remarquably well to chelation; Daunderer (german MD) reported how one third of mental patients in an Aachen psychiatry unit was released (1992) after completing heavy metal detoxification.\n\nMultiple sclerosis: described for the first time in 1868 (charcot), decades after the introduction of amalgam fillings.Very low incidence in countries where amalgams are banned.Their cerebro spinal fluid contains seven times the norm of mercury.  Mercury directly attacks and destroys nerve's myelin.\nExercise continually dislodges mercury from muscles; in turn it causes it to accumulate even further inside brain and nerves; hence the greater frequency of multiple sclerosis among high level athlethes with amalgams in their mouth.\n\nAlzheimer: Dr Boyd Haley has demonstrated how mercury can induce copycat Alzheimer lesions inside in vitro brain extracts.Autopsied Alzheimer lesions show a four fold mercury content. Daunderer's results detail an arrest of Alzeihmer in any stade once heavy metal detoxification is achieved.\n20% of the population misses the ApoE-2 gene (lipoprotein with 2 sulphur groups) which helps remove mercury from the brain; these non-carriers are between 4 and 20 times more susceptible to develop Alzheimer (old age) and autism (young age) when exposed to mercury.\n\nElectrosensibility: Mercury in the brain causes electrosensibility (headaches, dizziness,acouphenes,insomnia,nausea).\n\nCrohn disease: In the gut wall, mercury accumulation triggers auto-immune complexes causing chronic inflammation leading to Crohn disease or ulcerative colitis.\n\n\nAbout &quot;Natural products&quot; supposedly able to chelate mercury:\n\nThere is not one single scientific study on PUBMED proving chlorella binds in vivo to mercury ( or Vit C, coriander or bear garlic for that matter)!!\n\nThe vaunted 2000 medical articles on PUBMED ( Dr Klinghardt conferences) concern  IN VITRO chelation of heavy metals by chlorella; this translates into being able to chelate ALIMENTARY mercury transiting in the gut, not the one lodged inside our brains, kidneys, liver, etc...\nSome sites selling chlorella even admit this fact in small print (http://www.echlorial.fr/fr/index.php?page=biblio2)\n\nQuote:\n&quot;Altough scientific vulgarisation articles advance chlorella's mercury elimination capabilities, published articles in medical journals concerning this phenomena don't exist.On the other hand,environnemental technology articles often report on the use of chlorella in the heavy metal decontamination of used waters.&quot; (Dr M Ecke)\n\n&quot;Bien que les articles de vulgarisation scientifique rapportent souvent la capacitÃƒÂ© de la chlorella ÃƒÂ  ÃƒÂ©liminer le mercure du corps, il n'y a pas de publication dans des revues mÃƒÂ©dicales spÃƒÂ©cialisÃƒÂ©es concernant ce phÃƒÂ©nomÃƒÂ¨ne. En revanche, il est souvent rapportÃƒÂ© l'usage de la chlorella pour la dÃƒÂ©contamination des eaux usÃƒÂ©es polluÃƒÂ©es par des mÃƒÂ©taux lourds dans les articles de technologie environnementales &quot;(Dr M Ecke)\n\nUsing european agreed loboratories and a proven protocol, Dr Melet, who was always open to alternative therapies, tested them all on his sick patients; none resulted in increased mercury excretion.\n\nEven more worrying, chlorella can bind to heavy metals before being harvested ( mercury is everwhere today;the north polar ices are contaminated by aerial mercury generated by coal burning plants).\nDr Melet's analyses repeatadly found mercury traces (and other heavy metals) inside chlorella advertised as absolutely pure (see analysis results sheets in book).\n\nSome people might get a pure product, and their health might show an improvement due to the rich nutrients content; but those disappear as soon as the treatment ends, because mercury is still lodged inside  cells and chlorella has done absolutely nothing to remove it.This was confirmed in publications of Dr Scorupka and Dr Mutter. Those people are enticed into taking chlorella for life!\n\nIn resume, chlorella is a big marketing scam, and any purity warranty offered for a given chlorella brand has no value whatsoever   (even if Dr Klinghardt pretends otherwise).\n\nAbout EDTA: EDTA can bind mercury IN VITRO, but is unable to do so IN VIVO.It does bind lead, and has shown good results in cleaning clogged vessels. But Boyd Haley proved EDTA exhacerbates mercury's toxicity in neurons, and thus should never be administred as long as the body isn't mercury free.","torrent":{"xt":"urn:btih:36795a7d3ad027b11528978292663712cb7a6761","amp;dn":"Francoise+Cambayrac++V%C3%83%C2%A9rit%C3%83%C2%A9s+sur+les+maladies+%C3%83%C2%A9mergentes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36795a7d3ad027b11528978292663712cb7a6761","infoHashBuffer":{"type":"Buffer","data":[54,121,90,125,58,208,39,177,21,40,151,130,146,102,55,18,203,122,103,97]},"announce":[],"urlList":[]}}