{"title":"A Manager's Guide to Virtual Teams","uid":7156580,"size":850259,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:369c592c9031bb7d9a333dd0ce696f856215ed06&amp;dn=A+Manager%27s+Guide+to+Virtual+Teams&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookjuiced","files":1,"time":1333472388,"description":"A Managers Guide to Virtual Teams by Yael Zofi\n\n\nPublisher: A.A//M | ISBN: 0814416594 | 2011 | PDF | 272 pages | 1 MB\n\n\n\nWith an increasing number employees working remotely, it is more difficult than ever to ensure that team members are working smoothly and productively together. &quot;A Managers Guide to Virtual Teams&quot; is a practical roadmap for bridging the logistical, cultural, and communication gaps that can prevent any virtual team from reaching its full potential. The book explores the four most critical elements to team success:\n\nTrust and Accountability - ten tips for creating trust within and across virtual teams; Communication - the particular challenges of the virtual world, especially in cross-cultural collaborations; Conflict Management - examples, case scenarios, and resolution strategies; and, Deliverables - how virtual teams can get their work out the door faster and better. &quot;A Managers Guide to Virtual Teams&quot; features the authors proprietary Trust Wheel model, which includes powerful tools to help teams develop and ensure trust without face-to-face interaction. Filled with self-study exercises, activities, and advice based on the authors 20 years consulting experience, this book can help any organization realize the promise of professionals working closely together even if theyve never met.","torrent":{"xt":"urn:btih:369c592c9031bb7d9a333dd0ce696f856215ed06","amp;dn":"A+Manager%27s+Guide+to+Virtual+Teams","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"369c592c9031bb7d9a333dd0ce696f856215ed06","infoHashBuffer":{"type":"Buffer","data":[54,156,89,44,144,49,187,125,154,51,61,208,206,105,111,133,98,21,237,6]},"announce":[],"urlList":[]}}