{"title":"Frankfurt-Seattle [BDRip 1080p]","uid":5810279,"size":6772767311,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:376304ea71c8335d10540df3f97f3cea51398017&amp;dn=Frankfurt-Seattle+%5BBDRip+1080p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Milleman","files":-1,"time":1283559469,"description":"Through the eyes of the pilot: Frankfurt-Seattle\n\nYear: 2009\nLength: 1:36:00\nGenre: Documentary\nIssued: Aignermedia\nTranslation: Not required\nSubtitles: Russian, English, German\n\nDesription: At the Pilotseye.tv - in Seattle and works &quot;Boeing&quot; At this time, the route of flight is from Frankfurt-am-Main in the north-west in the direction of Amsterdam across the North Sea on Atlantiku. Greenland now be crossed in the far north - almost over the most northerly airport Thule. Starting from 76 degrees severnoy.shiroty.otkryvayutsya.potryasayuschie icy landscapes of the Canadian archipelago, and then again to the south - to lying on the southern part of Victoria Island Cambridge Bay. Weather, too, is accompanied to view the types of Canadian north-west of the capital territorry Yellowknife. Glitter in the sun the snow and glaciers Mount Robson - the highest mountain in the Canadian Rocky Mountains.Posle flying over Port Townsend begins to decline VPP16P International Airport Siettl.Na surprisingly absent today, rain and light clouds is perfectly suited to us when posadke.Po arrival Seattle awaits us at the shipyard tour Boeing, which will have the opportunity to observe the individual stages of assembly on the stocks of the next Boeing-747-800.Dalee - a fascinating tour of the Museum of Aviation and no less interesting flight from Seattle back to Frankfurt by plane A330-300B D -AIKD &quot;Siegen&quot; airline &quot;Lufthansa&quot;. The film contains the best episodes of the 23-hour flight (return), which dropped by 7 HD-cameras, with good explanations and, as always, with a pleasant flight.\n\nQuality: BDRip\nVideo: MPEG-4 AVC, 8943 Kbps, 1920x1080\nAudio: AC3, 2 ch, 192 kbit/s\n\nHelp seeding, plz!","torrent":{"xt":"urn:btih:376304ea71c8335d10540df3f97f3cea51398017","amp;dn":"Frankfurt-Seattle+%5BBDRip+1080p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"376304ea71c8335d10540df3f97f3cea51398017","infoHashBuffer":{"type":"Buffer","data":[55,99,4,234,113,200,51,93,16,84,13,243,249,127,60,234,81,57,128,23]},"announce":[],"urlList":[]}}