{"title":"Rebecca Pidgeon - The Raven (1994) [Jazz Folk][mp3 320][h33t][sc","uid":4711019,"size":111390369,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:37658305b780fa0031e38e6282dc219ab64059ef&amp;dn=Rebecca+Pidgeon+-+The+Raven+%281994%29+%5BJazz+Folk%5D%5Bmp3+320%5D%5Bh33t%5D%5Bsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":19,"time":1234020338,"description":"Rebecca Pidgeon - The Raven\nOriginal Release Date: June 23, 1994 \nLabel: Chesky (High Resolution Technology)\nTotal time: 46:01\nBitrate: 320 kbps\n\nFew people realize that the actress Rebecca Pidgeon had been quietly persuing a sucessful singing career prior to her noteriety as an actress. Though she was born in the Boston area, Pidgeon grew up in Scotland and studied acting at the prestigious Royal Academy of Dramatic Arts, which has trained some of the finest classical British stage actors. 'The Raven' is Ms. Pidgeon's first and finest solo effort, was recorded in 1994, a few years after she appeared in the Broadway production of hard edged playwright David Mamet's 'The Old Neighborhood.' She married Mamet and became the frequent leading lady in Mamet's excellent ensemble driven films. Prior to the 'The Old Neighborhood', she sang in the group, Ruby Blue.  She married Mamet and put her singing career on the back burner. Had it not been for involvement with Mamet, Pidgeon could probably have had Norah Jones' career, because she was performing the same kind of ecclectic mix of jazz, folk and popular standards that has become Nora Jones' signature.  Rebecca Pidgeon's vocals have the same grace, verve and well nuanced phrasing as the ubiquitous Ms. Jones.  A single listen to her rendition of 'Spanish Harlem' will convince even the most skeptical, that Pidgeon has all the makings of a great vocal stylist. The most intriguing part of her vocals is her ability to take her deeply rooted Celtic influences and blend them with the best elements of old school jazz to create her own highly stylized musical signature. The production quality is crystal clear and the arrangements are kept engagingly sparse, so Ms. Pidgeon's enticing voice isn't upstaged by a lot of superfluous overblown arrangements.  If you are a fan of Norah Jones or Eva Cassidy, then Rebecca Pidgeon should be on your required music purchase list. ~ Gavin B., Amazon.com\n\nReflective, yet contemporary, Rebecca's enchanting voice rings with honest, unpretentious confidence and vivid tenderness. While her Celtic melodies set the mood, her lyrics tell stories, full, rich, textured, and openhearted. She explores varying subject matter: love, loss, life, death, excavating her imagination and expressing it with wit, charm, warmth, and near tangible vulnerability.  The Raven, Rebecca Pidgeon's explosive debut pop release reveals the remarkable talents of a new musical artist while introducing Chesky Record's most significant contribution to the advancement of recorded sound.... High resolution technology. ~ acoustic sounds website\n\nFour long years had to pass, before THE most pleasant voice would curl its way into my ears again, and spellbind me once more. The sound of ex-folk/rock-group 'Ruby Blue' lead-singer Rebecca Pidgeon left an impression on me nine years ago, and the many different characteristics are still there. Through-out this album. -This is one high-quality song-writer. Check out 'Her Man Leaves Town', 'The Height Of Land' or the title-track, previously recorded by 'Ruby Blue'. The folky stuff, like this album, is where Pidgeon is the most at home, I think. I really wouldn't mind if she'd only make records like this one, but variety is a good thing, so I'm sure I'll enjoy whatever she decides to do in the future. ~ Birthe Jrgensen\n\nPersonnel:\nRebecca Pidgeon (Vocals and Guitar) \nJoel Diamond (Piano) \nAnthony Coote (Guitar and Backing Vocals) \nGeorge Naha (Guitar) \nMitch Margold (Synthesizer) \nDavid Finck (Bass) \nGary Burke (Percussion) \nCoco Kallis (Backing Vocals) \nPaul Miller (Backing Vocals) \nStephanie Smothers (Backing Vocals) - 5,13 \nElise Morris (Backing Vocals) - 5,13 \nJuliet Haffner (Viola) \nEric Friedlander (Cello) \nLaura Seaton (Violin) \nRobert Chausow (Violin)\n\nRebecca Pidgeon - The Raven Tracks:\n01  Kalerka (Rebecca Pidgeon) 3:02 \n02  The Witch (Rebecca Pidgeon) 2:47 \n03  The Raven (Rebecca Pidgeon/David Mamet) 2:51 \n04  You Need Me There (Rebecca Pidgeon) 3:40 \n05  Grandmother (Rebecca Pidgeon) 6:34\n06  You Got Me (Rebecca Pidgeon/Anthony Coote/David Mamet) 3:01 \n07  Heart And Mind (Rebecca Pidgeon/David Mamet) 3:16\n08  Her Man Leaves Town (Rebecca Pidgeon) 3:32 \n09  Seven Hours (Rebecca Pidgeon/David Mamet) 4:00 \n10  Wendy's Style Shop (Rebecca Pidgeon) 3:29 \n11  The Height Of Land (Rebecca Pidgeon/David Mamet) 3:43 \n12  Spanish Harlem (Phil Spector) 3:35 \n13  Remember Me (Rebecca Pidgeon) 2:31 \n","torrent":{"xt":"urn:btih:37658305b780fa0031e38e6282dc219ab64059ef","amp;dn":"Rebecca+Pidgeon+-+The+Raven+%281994%29+%5BJazz+Folk%5D%5Bmp3+320%5D%5Bh33t%5D%5Bsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37658305b780fa0031e38e6282dc219ab64059ef","infoHashBuffer":{"type":"Buffer","data":[55,101,131,5,183,128,250,0,49,227,142,98,130,220,33,154,182,64,89,239]},"announce":[],"urlList":[]}}