{"title":"Caffeine for the Sustainment of Mental Task Performance","uid":6511718,"size":959316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:37a09d3440e7c96f122ac761bb2f44c990d7bc7d&amp;dn=Caffeine+for+the+Sustainment+of+Mental+Task+Performance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309649247,"description":"Caffeine for the Sustainment of Mental Task Performance\n National Academies Press | December 15, 2001 | ISBN-10: 0309082587 | 157 pages | PDF | 1.4 MB\n\n This report from the Committee on Military Nutrition Research reviews the history of caffeine usage, the metabolism of caffeine, and its physiological effects. The effects of caffeine on physical performance, cognitive function and alertness, and alleviation of sleep deprivation impairments are discussed in light of recent scientific literature. The impact of caffeine consumption on various aspects of health, including cardiovascular disease, reproduction, bone mineral density, and fluid homeostasis are reviewed. The behavioral effects of caffeine are also discussed, including the effect of caffeine on reaction to stress, withdrawal effects, and detrimental effects of high intakes. The amounts of caffeine found to enhance vigilance and reaction time consistently are reviewed and recommendations are made with respect to amounts of caffeine appropriate for maintaining alertness of military personnel during field operations. Recommendations are also provided on the need for appropriate labeling of caffeine-containing supplements, and education of military personnel on the use of these supplements. A brief review of some alternatives to caffeine is also provided.","torrent":{"xt":"urn:btih:37a09d3440e7c96f122ac761bb2f44c990d7bc7d","amp;dn":"Caffeine+for+the+Sustainment+of+Mental+Task+Performance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37a09d3440e7c96f122ac761bb2f44c990d7bc7d","infoHashBuffer":{"type":"Buffer","data":[55,160,157,52,64,231,201,111,18,42,199,97,187,47,68,201,144,215,188,125]},"announce":[],"urlList":[]}}