{"title":"Alvin Stardust - The Untouchable (1973)","uid":4782182,"size":69852149,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:37d97f6ee3a7d2297fada27f7650393e019726b4&amp;dn=Alvin+Stardust+-+The+Untouchable+%281973%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Iron_Horse","files":14,"time":1237417544,"description":"Alvin Stardust - The Untouchable (1973)\nLP Rip To Mp3 256 mbit/s\nIncluded: CD Front Cover and this Info\n\nAlvin Stardust (born Bernard William Jewry, 27 September 1942, Muswell Hill, North London) is an English pop singer and stage actor.\n\nMoving to Mansfield, Nottinghamshire at a young age, he attended the Southwell Minster Collegiate Grammar School as a boarder. He made his stage debut in pantomime at the age of four.\n\nIn the early 1960s, Shane Fenton and The Fentones were an unknown teenage band who recorded a demo tape and mailed it in to a BBC programme with the hope of being picked to appear on TV. While awaiting a reply from the BBC, the band's 17 year old singer Shane Fenton (born Johnny Theakstone) died as a result of the rheumatic fever he had suffered in childhood. The rest of the band decided to break up, but then unexpectedly received a letter from the BBC inviting them to come to London to audition in person for the programme. Theakstone's mother asked the band to stay together, and to keep its name, in honour of her son's memory. Jewry, who was a roadie with the group at the time, was asked to become the new Shane Fenton. The combo had a handful of hits in the UK Singles Chart,[1] basing their sound on that of The Shadows. Jewry later also appeared in Billy Fury's movie, Play It Cool.\n\nJewry disappeared from the spotlight for a decade after the break-up of The Fentones, working in music management and performing at small venues with his wife Iris Caldwell, the sister of Rory Storm. During the early 1970s, however, Jewry acquired a new persona, Alvin Stardust, as he successfully cashed in on the glam rock bandwagon. His name was given to him by Michael Levy (later Lord Levy) who owned his record label. Magnet Records. His debut hit was &quot;My Coo-Ca-Choo&quot; in 1973. Stardust had other chart successes with the hits - &quot;Jealous Mind&quot; (UK No. 1), &quot;You, You, You&quot;, &quot;Red Dress&quot; and &quot;Good Love Can Never Die&quot;. In total, he amassed seven Top Ten entries, in a chart span lasting almost 25 years. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Alvin_Stardust&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Alvin_Stardust&lt;/a&gt;\n\nReview by Dave Thompson\nLooking back, it's hard to see what all the fuss was about. So he wore a tight leather catsuit. So he glowered a little and didn't like smiling. So he called his first album The Untouchable and he liked his girls to &quot;lie down and groove on the mat.&quot; That was no reason to label him a deviant pariah and ban him from children's TV in case he scared the kiddies. They did, though, and that wasn't the end of Alvin Stardust's travails. Less than six weeks after this album was released, the English city of Hull banned him from appearing in concert there, stating &quot;he is not the sort of act we want in Hull.&quot; And people thought the Sex Pistols had problems. The Untouchable, this demonic entity's first album, confirms Hull's horrors from the cover on in. Stardust himself was soon to drop the Stygian armor and knuckledusters, but they hang on him here like a second skin. There's even a song about them, &quot;Dressed in Black,&quot; while a quick skim through the rest of the set raises other suspicions as well. Who but a latter-day Mr. Punch would invite his lady to &quot;Be My Judy,&quot; while &quot;Jealous Mind,&quot; &quot;My Sweet Deutsche Friend,&quot; and &quot;High Fever&quot; are scarcely the stuff of girl meets boy-next-door fantasy, either. And then there's &quot;My Coo Ca Choo,&quot; a hit so pervasive that its churning, mysterious malevolence remains a palpable presence throughout the album. Even when Stardust slips into brooding balladeer mode, to hiss-breathe the sibilant &quot;You're My Everything,&quot; the fear still haunts the back of your mind. &quot;Don't ever leave me,&quot; he quakes in a voice which is utterly unsuitable for such sweet sentiments, and is it simple paranoia? Or does he really leave unspoken what will happen if you do? &quot;Sha la la la la.&quot; Extract yourself from the mystery, of course, and The Untouchable is pretty thin gruel, a vaguely glammy distillation of every second division British rock &amp; roller that could ever have been a contender. Co-writer and producer Pete Shelley basically has three good ideas and spreads them way too far -- the best songs are the two hit singles, the rest are barely B-sides -- and, again, once past the hits, Stardust himself has only a marginally convincing singing voice. But image is everything and in early 1974, Stardust had an aura to die for. Even a halfway decent album was simply the icing on the cake.\n\nTracklist:\n01. My Coo Ca Choo\n02. Be My Jude\n03. The Bump\n04. My Sweet Deutsche Friend\n05. Jealous Mind\n06. Dreambreaker\n07. I'm In Love Again\n08. High Fever\n09. Dressed In Black\n10. You're My Everything\n11. Guitar Star","torrent":{"xt":"urn:btih:37d97f6ee3a7d2297fada27f7650393e019726b4","amp;dn":"Alvin+Stardust+-+The+Untouchable+%281973%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37d97f6ee3a7d2297fada27f7650393e019726b4","infoHashBuffer":{"type":"Buffer","data":[55,217,127,110,227,167,210,41,127,173,162,127,118,80,57,62,1,151,38,180]},"announce":[],"urlList":[]}}