{"title":"Chemtrails connected to UN 2013 Report  'Earth is in the midst o","uid":10617449,"size":195918486,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:387caf6d8cecb3f037468ad1e8ed42ff11661e46&amp;dn=Chemtrails+connected+to+UN+2013+Report++%27Earth+is+in+the+midst+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"H2oDragon","files":1,"time":1406138963,"description":"CHEMTRAILS \n\nPublished on Mar 7, 2013\n &lt;a href=&quot;\nhttp://geoengineeringwatch.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://geoengineeringwatch.org&lt;/a&gt; &amp; http://globalskywatch.com ~sub:~reupload from:~film presented by John Massaria. The audio is part of a teleconference call between Russ Tanner (Global Skywatch) and Dane Wigington (WIWATS/Activist) These calls happen every Monday at 7 : 30 central time and can be accessed through Russ' fb page. Please join us!\n\n~Unslave Humanity Tactical Media: http://whynotnews.eu/?p=2143\n\nThis video is [FAIR USE] under Â© COPYRIGHT LAW it is: 1 noncommercial 2 trans-formative in nature 3 not competitive with the original work 4 not effecting its market negatively FAIR USE NOTICE: This video contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available in our efforts to advance understanding issues, etc. We believe this constitutes a 'fair use' of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Title 17 U.S.C. 107, the material on this site is distributed without profit to those who have expressed a prior interest in receiving the included information for research and educational purposes.\n\nScientific Research explaining why they are spraying the sky's around the world. Learn and more importantly do something about the Chemtrails being sprayed. Learn the details here in this short film. UN Environment Program: 200 Species Extinct Every Day, Unlike Anything Since Dinosaurs Disappeared 65 Million Years Ago. According to the UN Environment Program, the Earth is in the midst of a mass extinction of life.\n\nScientists estimate that 150-200 species of plant, insect, bird and mammal become extinct every 24 hours. This is nearly 1,000 times the &quot;natural&quot; or &quot;background&quot; rate and, say many biologists, is greater than anything the world has experienced since the vanishing of the dinosaurs nearly 65m years ago.\n\nMany people (dis-informed people) were saying they don't seed or spray the sky's, and well... all I have to do is look up or look at the documents I have to show these are plain ignorant to facts and data. Maybe they are in denial.\n\n&quot;The Images in this video show jets airliners and equipment used for jets airliners. No implied meaning other than &quot;airliner&quot; equipment is intended. For example: the tanks shown in this video represent &quot;water&quot; tanks and may or may not contain any other known chemical other than water. Any? images shown in this video are part of the public domain available on the world wide web, and constitute no other rights implied or suggested. This video is for intended for learning purposes and may contain? facts unaware to the general public.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Geoengin...&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Geoengin...&lt;/a&gt;\n\nThe concept of geoengineering has two meanings: The science of measuring and modelling the earth for applications within civil engineering, climate engineering, climate remediation, and climate intervention.\n\nGeoengineering is commonly taken to mean the deliberate large-scale manipulation of the planetary environment to counteract anthropogenic climate change.\n\nGeoengineering is distinct from large-scale environmental damage and accidental anthropogenic climate change, which are side-effects of human activity, rather than an intended consequence. Definitions of the term are not universally accepted. The global extraction of hydrocarbons from the sub-surface using integrated geoscience and engineering technology has been termed 'petroleum geoengineering' as an activity with global impact. The Oxford English Dictionary defines geoengineering as &quot;the deliberate large-scale manipulation of an environmental process that affects the earth's climate, in an attempt to counteract the effects of global warming.&quot;\n\nSide effects\n\nThe techniques themselves may cause significant foreseen or unforeseen harm. For example, the use of reflective balloons may result in significant litter, which may be harmful to wildlife.\n\nOzone depletion is a risk of some geoengineering techniques, notably those involving sulfur delivery into the stratosphere.\n\nThe active nature of geoengineering may in some cases create a clear division between winners and losers. Most of the proposed interventions are regional, such as albedo modification in the Arctic.\n\nThere may be unintended climatic consequences, such as changes to the hydrological cycle including droughts or floods, caused by the geoengineering techniques, but possibly not predicted by the models used to plan them. Such effects may be cumulative or chaotic in nature, making prediction and control very difficult.\n\n    Category\n\n    Nonprofits &amp; Activism\n    License\n\n    Standard YouTube License\n\n","torrent":{"xt":"urn:btih:387caf6d8cecb3f037468ad1e8ed42ff11661e46","amp;dn":"Chemtrails+connected+to+UN+2013+Report++%27Earth+is+in+the+midst+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"387caf6d8cecb3f037468ad1e8ed42ff11661e46","infoHashBuffer":{"type":"Buffer","data":[56,124,175,109,140,236,179,240,55,70,138,209,232,237,66,255,17,102,30,70]},"announce":[],"urlList":[]}}