{"title":"Green Lantern - Rebirth 01-06 (2004-2005, Dgtl, JK-Empire)","uid":9514861,"size":89124554,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:38a289a65c652a5088f3132e6b85dadc92242b44&amp;dn=Green+Lantern+-+Rebirth+01-06+%282004-2005%2C+Dgtl%2C+JK-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1390498500,"description":"This is where the modern incarnation of the Green Lanterns begin, as well as featuring the story of Hal Jordan's ultimate redemption. In the mid-90's, DC brass decided they wanted to create a new Green Lantern, so they conspired to have Mongul and the Cyborg Superman destroy Hal Jordan's home of Coast City. Stricken with grief and anger, Hal then went on a power mad destruction spree as he merged with an entity known as Parallax, and eventually attempted to recreate the universe with Coast City fully intact in the highly controversial Zero Hour storyline. The new Lantern, Kyle Rayner, became quite popular in his own right,  but fans clamored for Jordan's return to the ring - so to speak. After some failed attempts, the terrific writer Geoff Johns finally succeeded with this masterfully written tale that wove together elements of nearly 60 years worth of Lantern material, while carefully laying the groundwork for the future (and specifically, the well received Sinestro Corps War and Blackest Night). Johns would begin a long run with the Lanterns and totally revamp and reshape them into of DC's most prized stables, with Jordan at the center of it all once again. \n\nWhether you are a long-time Lantern fanatic or know absolutely nothing about them of their history, this is an ideal place to start. Thanks go to JK-Empire for these lovely digital copies, and of course please seed and enjoy! :-)","torrent":{"xt":"urn:btih:38a289a65c652a5088f3132e6b85dadc92242b44","amp;dn":"Green+Lantern+-+Rebirth+01-06+%282004-2005%2C+Dgtl%2C+JK-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38a289a65c652a5088f3132e6b85dadc92242b44","infoHashBuffer":{"type":"Buffer","data":[56,162,137,166,92,101,42,80,136,243,19,46,107,133,218,220,146,36,43,68]},"announce":[],"urlList":[]}}