{"title":"Gnomoria v0.9.5.1","uid":9518950,"size":177172358,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:38efb3505985aadbd7a202d7c2e3ebf447693b98&amp;dn=Gnomoria+v0.9.5.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"karasyan1337","files":-1,"time":1390592450,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n\n- Procedurally generated world - Every game is different\n- Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n- Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n- Crafting - Tons of items to craft at different workshops\n- Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nv0.9.5.1\nFixed\nCrash when loading saves with a gnome 'en route' and has items equipped\nNo merchants arriving in games that were created in version 0.9.4 or earlier\nItems not becoming available for trade again, if the trade was canceled while your gnome was departing\n\nv0.9.5\n\nYay!  First patch after a long break.  This is sort of a preliminary patch that sets up for more changes to come.  Much of the work involved with this update changes how some internal systems work to allow for them to be expanded on in future patches.  Some things will behave similar to how they did in the last version but with the internal changes it will be easier to tweak or expand on.  In the next update after this, there will likely be some more types of friendly Kingdoms as well as some new options for interacting with them.  When I finally get back to updating goblin behaviors they will likely get incorporated into the diplomacy system and have some options for interaction outside of combat.\n\nGeneral\nAdded early implementation of Diplomacy system\nChanged how merchants work so that any faction can send merchants\nForeign Kingdoms now have a distance from the player's Kingdom\nMerchant goods are now determined by the player kingdom's worth at the time of departure instead of arrival\nMerchants will now spawn even if there are no market stalls\nMerchants can now arrive in winter\nMerchants bandage themselves or go to a hospital when necessary\nMerchants sleep, eat and drink\nMerchants idle at the Great Hall if there are no available Market Stalls\nDiplomacy tab added to Kingdom window for viewing and interacting with foreign Kingdoms\nA Merchant can be sent to foreign Kingdoms\n   \nUses a trading window similar to the Market Stall\nWhen the chosen gnome leaves the map, the items being traded disappear with him (like trading with a merchant at a market stall)\nIf all gnomes die while one of your gnomes is off the map travelling, the game will still end\nFixed\nDig Floor jobs queuing in invalid locations\nDig Floor job not creating above a ramp\nItems not storing in crates and wheelbarrows: Wooden Shield, Tower Shield, Tower shield backing and stone weapons\nWooden shield, tower shield and stone weapons trading for too much with merchants\nTower shield and tower shield backing not smelting\nMerchants leaving the map incorrectly\nUI not respecting Windows Primary/Secondary button swap setting\n\nSystem requirements:\n\nOS: Windows XP, Vista, 7, 8\nProcessor: 2.0 GHz\nMemory: 1 GB\nHard Disk Space: 200 MB\nVideo Card: 128 MB Video Memory\nDirectX: 9.0c or Greater\n\nInstallation:\n\n1. Unzip\n2. Place Gnomoria folder anywhere on your drive\n3. PLAY!\n\nXNA Framework 4.0 and .NET Framework 4.0 is NOT included.\nYou can help the developer and buy the game on steam here:   &lt;a href=&quot;\nhttp://store.steampowered.com/app/224500/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/224500/&lt;/a&gt;","torrent":{"xt":"urn:btih:38efb3505985aadbd7a202d7c2e3ebf447693b98","amp;dn":"Gnomoria+v0.9.5.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38efb3505985aadbd7a202d7c2e3ebf447693b98","infoHashBuffer":{"type":"Buffer","data":[56,239,179,80,89,133,170,219,215,162,2,215,194,227,235,244,71,105,59,152]},"announce":[],"urlList":[]}}