{"title":"Papa's Burgeria v1.0.23","uid":8508260,"size":20739731,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3a1a6ef8963f322107399239a094b71727cded37&amp;dn=Papa%27s+Burgeria+v1.0.23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1369490938,"description":"\nGrab your spatula and get ready for a burger-flipping adventure! In this brand-new edition of Papa's Burgeria, you are unwillingly left in charge of Papa Louie's famous Burgeria. You'll need to take orders, grill patties, add toppings, and serve the burgers to all of your wacky customers.\n\nThis hands-on time-management game gives you control at each step of the burger-building process. You'll need to multi-task and juggle between each area of the restaurant: Keep an eye out for customers waiting in the lobby, drag and flip burger patties on the grill to cook them just right, and add toppings and sauces to the sandwiches before serving them to your customers!\n\nKeep your customers happy to earn more points and level up! As your level rises, you'll unlock new toppings in the shop, and new customers will start visiting the Burgeria!\n\n** NEW FEATURES **\n\nThis updated and remastered version of Papa's Burgeria features a variety of new unlockable toppings and sauces, and many new customers not found in previous editions of the game. At the end of each day, you'll also be faced with Closer customers who are very picky about their burgers, and each week you'll be visited by the Food Critic with a chance to earn a tip-boosting Blue Ribbon!\n\nUse your hard-earned tips to buy restaurant upgrades and hats to wear, and you can also decorate your lobby with furniture and posters from the Furniture Shop. You'll even earn a Pay Day each week, which you can spend on upgrading your Burgeria!\n\nYou'll also be able to earn 70 different achievements for various tasks in the Burgeria, including reaching certain ranks, earning Customer Awards on your customers, playing mini-games, and serving burgers with certain toppings.\n\n** MINI GAMES **\n\nAs your serve sandwiches to your customers, you'll be rewarded with Game Tickets. At the end of each day, the Great Foodini will arrive with his Traveling Mini-Game Show, where you can use your Game Tickets to play a variety of food-themed Mini Games, and win posters and furniture that you can place in your lobby!\n\n- Hands-on burger shop game in the Papa Louie universe\n- Updated and remastered for tablets\n- Multi-tasking between grilling, stacking, and serving\n- Over 60 customers to unlock with unique orders\n- Various upgrades and hats to purchase with your earned tips\n- Play wacky mini-games to earn shop decorations\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=air.com.flipline.papasburgeria&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=air.com.flipline.papasburgeria&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3a1a6ef8963f322107399239a094b71727cded37","amp;dn":"Papa%27s+Burgeria+v1.0.23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a1a6ef8963f322107399239a094b71727cded37","infoHashBuffer":{"type":"Buffer","data":[58,26,110,248,150,63,50,33,7,57,146,57,160,148,183,23,39,205,237,55]},"announce":[],"urlList":[]}}