{"title":"Herbie Mann - Push Push (1971) [Jazz][mp3 320][h33t][schon55]","uid":4859499,"size":117548129,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a491b0a6d3d4613a7afe2aed9a4fb52ab292833&amp;dn=Herbie+Mann+-+Push+Push+%281971%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":13,"time":1240201800,"description":"Herbie Mann - Push Push\nOriginal Release Date: July 1, 1971 \nLabel: Atlantic / Wea \nBitrate: 320 kbps\n\nFlutist Herbie Mann opened up his music on this date (and during the era) toward R&amp;B, rock and funk music.  The results were generally appealing, melodic and danceable.  On such songs as &quot;What's Going On,&quot; &quot;Never Can Say Goodbye,&quot; &quot;What'd I Say&quot; and the title cut, Mann utilizes an impressive crew of musicians, which include guitarist Duane Allman and keyboardist Richard Tee.  This out-of-print LP is worth picking up. ~ Scott Yanow, All Music Guide \n\nThis is the only jazz disc currently in my collection, and despite the fact that Herbie Mann is definitely a jazz artist, some would dispute categorizing this as a jazz album. There are no vocals on the tracks, but the presence of Duane Allman, plus the heavy Top 40 song selection, and the fairly straight forward arrangements all tilt the disc more toward pop than jazz. Be forwarned if you're a Duane Allman fan seeking some of his trademark southern blues slide guitar: this is a Herbie Mann recording where the instrumentalists for the most part serve as a soapbox for Mann's flute excursions. Only one song, the title track, give Duane significant room to move. \n\n'Push Push' was released in 1971, directly on the heels of some of the most celebrated songs appearing in the collection. In March and April of that year Marvin Gaye took 'What's Going On' to number two on the national charts, The Jackson Five took 'Never Can Say Goodbye' to number two, and Bread took 'If' to number four. The other charting song is Ray Charles 1959 number six classic, 'What'd I Say'. The disc also offers two Mann compositions, the title track and 'Man's Hope', as well as a bonus track not appearing on the original vinyl, the Grammy winning 'Funky Nassau', which was penned by Bahamian songwriter Dr. Offff Fitzgerald and his cousin, Raphael Munnings. Aretha Franklin rounds out the songwriting, contributing 'Spirit In the Dark'. There is absolutely nothing to complain about in these selections; each is a stunner, with Mann's own work holding up well among the more highly touted commercial successes. \n\nThe session musicians employed by Mann have references that read like a who's who among the era's most accomplished artists. David Spinoza, whose credits include stints with Paul McCartney and Paul Simon, gives Allman a break, offering a lead guitar solo on 'Man's Hope'. Ralph McDonald, who supports Bernie Purdie and Al Jackson Jr.'s drums with percussion accompaniment has backed David Bowie and Jimmy Buffett. And Donald 'Duck' Dunn, who earned a space in the Rock and Roll Hall of Fame as an MG for Booker T. Jones, has aksi played behind The Blues Brothers and Neil Young. Chuck Rainey also plays bass, and he has performed with Steely Dan and The Eagles. Allman himself has added his talents to recordings by John Hammond, Wilson Pickett, Boz Scaggs, Eric Clapton, and Aretha Franklin. How's that for name dropping? \n\nThe music itself is an homage to sensuality. The album title and photographs accompanying the disc speak to Mann's desire to create a soundtrack for lovemaking. He succeeds to some degree, but rather than coming off as a celebration of sensuality, the album feels more traditionally romantic, especially the ballads 'If' and 'Never Can Say Goodbye'. The title track and 'Man's Hope' are the funkiest songs on the disc, and seem to produce the most inspired and imaginative response in the performers. \n\nI owned the original vinyl version of 'Push Push' while in college, and was also fortunate enough to catch Mann when he made a summer of 1975 appearance at the Pine Knob Music Theatre in Clarkston, Michigan. It was an unusual show as Mann's back-up band, The Family of Mann, got delayed at the airport, and Mann decided to perform the first set solo. I was only sitting a few rows from the stage, and I'll never forget the mesmerizing performance this Mann put on. I was close enough to be able to hear him keeping time by tapping his foot on the stage, and it was all the rhythm accompaniment he needed. He is truly a master of his instrument. \n\nWhile 'Push Push' doesn't, in my opinion, capture Herbie Mann at his best, the song selection and musical stylings probably make it his most accessible work. I'm not sure if the disc is remastered, but since it was released in 1989, I'm doubtful. Scanning the disc and inserts fail to reveal whether it is AAD, ADD or DDD. It does say &quot;reissue produced by Bob Porter&quot;, which sounds like a remastering. Go figure. Credits and a few comments by Mann are the only other offerings found in the inserts. ~ Running Man\n\nHerbie Mann - Push Push Tracks:\n01  Push Push (10:07)\n02  What's Going On (4:17)\n03  Spirit In The Dark (9:29)\n04  Man's Hope (6:59)\n05  If (4:37)\n06  Never Can Say Goodbye (3:37)\n07  What'd I Say (5:00)\n08  Funky Nassau (Bonus Track) (4:54)","torrent":{"xt":"urn:btih:3a491b0a6d3d4613a7afe2aed9a4fb52ab292833","amp;dn":"Herbie+Mann+-+Push+Push+%281971%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a491b0a6d3d4613a7afe2aed9a4fb52ab292833","infoHashBuffer":{"type":"Buffer","data":[58,73,27,10,109,61,70,19,167,175,226,174,217,164,251,82,171,41,40,51]},"announce":[],"urlList":[]}}