{"title":"Snooker Stars v1.61 (Mod) APK [SadeemPC]","uid":15454053,"size":38415261,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3ae0aba03afa67bfa0bf1d48a6efff992ae984b7&amp;dn=Snooker+Stars+v1.61+%28Mod%29+APK+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SadeemPC","files":1,"time":1469967245,"description":"Snooker Stars v1.61 (Mod)\r\nRequirements: Android 2.3+\r\n\r\nTry out the most realistic Snooker game on Mobile! It's simple enough so anybody can play, but intricate enough that it will take you years to master!\t\r\n\r\n- REAL FEELING OF PLAYING SNOOKER\r\nWe have created a simple and accurate touch control system that gets out of your way and makes you feel like you are almost standing in the game. Playing a snooker game on a mobile device should feel natural, and recreate a feeling that you are standing in the snooker arena. Try it out, it feels like being in the game!\r\n\r\n- PHYSICS THAT ROCK\r\nPhysics is the beating heart of any Snooker game or Pool game! This is why we built a revolutionary Physics Engine with only one purpose: To make sure that it can deliver the Real Feeling of Billiards. We challenge you to test it out: spin, cue action, breaking the balls, shots off the cushions. It behaves just like the real thing!\r\n\r\nIt takes serious simulation of even the most tiny details to reach this level of Physical accuracy, and we are especially proud to be able to bring the next level pool physics to your mobile phone!\r\n\r\n- HUGE CAREER\r\nPractice your snooker game over a set of challenges that will refine your snooker skills to perfection!\r\n\r\n- HEAD-TO-HEAD MATCHES\r\nChallenge other snooker players Head-To-Head in Online Snooker games!\r\n\r\n- WORLD ONLINE LEAGUE\r\nTake your place in the weekly online snooker league competitions. Each online match takes you closer to the top place in the Snooker League!\r\n\r\n- YOUR FRIENDS ARE THERE\r\nCreate a Snooker club with yourfriends, and challenge them for the title of Snooker champion on every challenge in the career! Bragging rights with some fantastic trick shots, and some high breaks in the process.\r\n\r\n- SLICK GRAPHICS\r\nThe feel of the room, the shininess of the polished balls, the fine wood of the snooker table, this is the atmosphere that a snooker star experiences. It's time to put on your polished shoes and a bow tie and become part of the Snooker action!\r\n\r\nWhat's new:\r\n- Fix for players who are using disconnect to get an advantage\r\n- Takes less space on phone\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.giraffegames.ggpool\r\n\r\nMod:\r\n1. Infinite Energy\r\n2. All Cues Unlocked\r\n3. Unlimited Money","torrent":{"xt":"urn:btih:3ae0aba03afa67bfa0bf1d48a6efff992ae984b7","amp;dn":"Snooker+Stars+v1.61+%28Mod%29+APK+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ae0aba03afa67bfa0bf1d48a6efff992ae984b7","infoHashBuffer":{"type":"Buffer","data":[58,224,171,160,58,250,103,191,160,191,29,72,166,239,255,153,42,233,132,183]},"announce":[],"urlList":[]}}