{"title":"The Beatles - Anthology 3 [320k MP3]","uid":7736423,"size":343086890,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3b17d93a0b202a5608cc147d74a35bfa7de706d3&amp;dn=The+Beatles+-+Anthology+3+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1350496770,"description":"Anthology 3 is a compilation album by The Beatles released in October 1996 by Apple Records as part of The Beatles Anthology series. The album includes rarities and alternative tracks from the final two years of the band's career, ranging from the initial sessions for The Beatles (also known as The White Album) to the last sessions for Let It Be and Abbey Road in later 1969 and early 1970.\n\nFollowing &quot;Free as a Bird&quot; in Anthology 1 and &quot;Real Love&quot; in Anthology 2, a third John Lennon solo demo entitled &quot;Now and Then&quot; was to be reworked by the three surviving members of The Beatles for Anthology 3. However, it was decided against due to complications and sound quality issues involving Lennon's recording. In its place is &quot;A Beginning&quot;, an orchestral instrumental track initially intended for The White Album. &quot;A Beginning&quot; was composed by producer George Martin and intended to be the intro track to the Ringo Starr penned &quot;Don't Pass Me By&quot;.\n\nSimilar to the previous Anthology albums, the cover image painted by Klaus Voorman features a collage of The Beatles-related imagery designed to appear as a wall of peeling posters and album covers. An updated picture of Voorman can be seen in George Harrison's hair in a segment of the Revolver album cover.\n\nThe album was certified 3x Platinum by the RIAA, and was the group's third double album in a row to reach #1 on the US charts, equalling a record set by Donna Summer back in the 1970s.\n\nTrack Listing [320k MP3]\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Anthology_3#Track_listing&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Anthology_3#Track_listing&lt;/a&gt;","torrent":{"xt":"urn:btih:3b17d93a0b202a5608cc147d74a35bfa7de706d3","amp;dn":"The+Beatles+-+Anthology+3+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b17d93a0b202a5608cc147d74a35bfa7de706d3","infoHashBuffer":{"type":"Buffer","data":[59,23,217,58,11,32,42,86,8,204,20,125,116,163,91,250,125,231,6,211]},"announce":[],"urlList":[]}}