{"title":"Dragon's World: A Fantasy Made Real [EN] [XVID]","uid":7120493,"size":732877072,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c6cce844d39262d7fb556214fc95d93bb5c6708&amp;dn=Dragon%27s+World%3A+A+Fantasy+Made+Real+%5BEN%5D+%5BXVID%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mitaruss","files":-1,"time":1332352652,"description":"Title: Dragons World-A Fantasy Made Real\nYear:  2005\nFile Size: 696 MB \nFormat:AVI\nVideo Length: 01:39:17\nVideo Codec: XviD\nVideo Resolution: 640x368\nVIdeo Bitrate:  981 kbit/s\nFPS:  29\nAudio Bitrate: 114 kbit/s\nAudio Codec: MPEG Layer-3\nChannels:  2\n\n\nThe Last Dragon, known as Dragons: A Fantasy Made Real in the United States, and also known as Dragon's World in other countries, is a docufiction made by Animal Planet that is described as the story of &quot;the natural history of the most extraordinary creature that never existed&quot;.\n\nIt posits a speculative evolution of dragons from the Cretaceous period up to the 15th century, and suppositions about what dragon life and behavior might have been like if they had existed and evolved. It uses the premise that the ubiquity of dragons in world mythology suggests that dragons could have existed. They are depicted as a scientifically feasible species of reptile that could have evolved, similar to the depiction of dragons in the Dragonology series of books. The dragons featured in the show were designed by John Sibbick.\n\nThe program switches between two stories. The first uses CGI to show the dragons in their natural habitat throughout history. The second shows the story of a modern day scientist at a museum, Dr. Tanner, who believes in dragons. When the frozen remains of an unknown creature are discovered in the Carpathian Mountains, Tanner, and two colleagues from the museum, undertake the task to examine the specimen to try to save his reputation. Once there, they discover that the creature is a dragon. Tanner and his colleagues set about working out how it lived and died.","torrent":{"xt":"urn:btih:3c6cce844d39262d7fb556214fc95d93bb5c6708","amp;dn":"Dragon%27s+World%3A+A+Fantasy+Made+Real+%5BEN%5D+%5BXVID%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c6cce844d39262d7fb556214fc95d93bb5c6708","infoHashBuffer":{"type":"Buffer","data":[60,108,206,132,77,57,38,45,127,181,86,33,79,201,93,147,187,92,103,8]},"announce":[],"urlList":[]}}