{"title":"The Human League 24 Bit Vinyl Pack","uid":9629540,"size":5097337090,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3c7b666260eeba2ef0b4153feaebc41a466f93ee&amp;dn=The+Human+League+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1392653057,"description":"\n  The Human League 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: New Wave, Synth Pop, Dance-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bitrate: ~ 3,000 kbps\n  Bit Depth: 24\n  Sampling Rate: 96 KHz\n\n  1980 Travelogue\n  1981 Dare!\n  1983 Fascination!\n  1984 Hysteria\n  1986 Crash\n  1990 Romantic?\n\n  Synth pop's first international superstars, the Human League were among the earliest and most innovative bands to break into the pop mainstream on a wave of synthesizers and electronic rhythms, their marriage of infectious melodies and state-of-the-art technology proving enormously influential on countless acts following in their wake. The group was formed in Sheffield, England, in 1977 by synth players Martyn Ware and Ian Marsh, who'd previously teamed as the duo Dead Daughters; following a brief tenure as the Future, they rechristened themselves the Human League after enlisting vocalist Philip Oakey. The trio soon recorded a demo, and played their first live dates; they soon tapped Adrian Wright as their &quot;Director of Visuals,&quot; and his slide shows quickly became a key component of their performances.\n\n  Signing with the indie label Fast, in 1978 the Human League issued their first single, &quot;Being Boiled&quot;; a minor underground hit, it was followed by a tour in support of Siouxsie &amp; the Banshees. After a 1979 EP, The Dignity of Labour, the group released its first full-length effort, Reproduction, a dark, dense work influenced largely by Kraftwerk. Travelogue followed the next year and reached the U.K. Top 20; still, internal tensions forced Ware and Marsh to quit the group in late 1980, at which time they formed the British Electronic Foundation. Their departure forced Wright to begin learning to play the synthesizer; at the same time, Oakey recruited bassist Ian Burden as well as a pair of schoolgirls, Susanne Sulley and Joanne Catherall, to handle additional vocal duties.\n\n  The first single from the revamped Human League, 1981's &quot;Boys and Girls,&quot; reached the British Top 50; recorded with producer Martin Rushent, the follow-up &quot;Sound of the Crowd&quot; fell just shy of the Top Ten. Their next single, &quot;Love Action,&quot; reached number three, and after adding ex-Rezillo Jo Callis the League issued &quot;Open Your Heart,&quot; another hit. Still, their true breakthrough was the classic single &quot;Don't You Want Me,&quot; from the album Dare!; both topped their respective charts in England, and went on to become major hits in the U.S. as well. A tour of the States followed, but new music was extremely slow in forthcoming; after a remix disc, Love and Dancing, the Human League finally issued 1983's Fascination! EP, scoring a pair of hits with &quot;Mirror Man&quot; and &quot;(Keep Feeling) Fascination.&quot;\n\n  The much-anticipated full-length Hysteria finally surfaced in mid-1984, heralding a more forceful sound than earlier Human League releases; the record failed to match the massive success of Dare!, however, with the single &quot;The Lebanon&quot; earning insignificant airplay. The group soon went on indefinite hiatus, and Oakey recorded a 1985 solo LP with famed producer Giorgio Moroder titled simply Philip Oakey &amp; Giorgio Moroder. To the surprise of many, the Human League resurfaced in 1986 with Crash, produced by the duo of Jimmy Jam and Terry Lewis; the plaintive lead single &quot;Human&quot; soon topped the U.S. charts, but the group failed to capitalize on its comeback success, disappearing from the charts for the remainder of the decade.\n\n  When the Human League finally returned in 1990 with Romantic?, their chart momentum had again dissipated, and the single &quot;Heart Like a Wheel&quot; barely managed to rise into the Top 40. The record was the band's last with longtime label Virgin; now a trio consisting of Oakey, Sulley, and Catherall, they ultimately signed with the EastWest label, teaming with producer Ian Stanley for 1995's Octopus. The album went largely unnoticed both at home and overseas, with the single &quot;Stay With Me Tonight&quot; issued solely in the U.K. A resurgent interest in synth pop and post-punk during the early 2000s enabled the group's 2001 album Secrets considerable press coverage, which saw the group update its early sound. Four years later, they released Live at the Dome.","torrent":{"xt":"urn:btih:3c7b666260eeba2ef0b4153feaebc41a466f93ee","amp;dn":"The+Human+League+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c7b666260eeba2ef0b4153feaebc41a466f93ee","infoHashBuffer":{"type":"Buffer","data":[60,123,102,98,96,238,186,46,240,180,21,63,234,235,196,26,70,111,147,238]},"announce":[],"urlList":[]}}