{"title":"Televilsion (conspiracy TV) [xyz]","uid":9180524,"size":1972693038,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:3dfe79570f0d32c15ed9c31c1640b9ec83cd5372&amp;dn=Televilsion+%28conspiracy+TV%29+%5Bxyz%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"one_last_round","files":31,"time":1384222309,"description":"youtube link: watch?v=agXOXCt6FM0\n\n It seems like my Internet provider Charter might be capping my upload and download because of how much I have been downloading of late. In other words, this might be a slow download. This series was interesting. The producer did some thoughtful things. Overall, the argument might fall short.\n\n There will be many parts to this series, as I feel it's the most important aspect to understand at this point, otherwise the vicious circle of destruction continues\n\n The only evil is ignorance, in fact it's due to ignorance that we're in this mess now...we did it to ourselves, and we have to take responsibility for that, but on that same note, we can dig ourselves out\n\n It's hard enough to get people to see the Federal Reserve is private, much less take a look at inter-dimensional entities that appear as Reptilian shape-shifters\n\n but it's the most important aspect of the whole mess we call the New World Order. \n\n Sure we can have a revolution, deal with every politician, corrupt businessman there is, but I guarantee you, that will solve nothing.We've seen it throughout history, the same agenda continues like clockwork\n\n Our scientific education far outweighs any grasp we have on the spiritual, in fact you're greeted with googly eyes if you suggest we even have a divine presence, and that is ultimately, the Great Deception, one which has been waged for thousands of years\n\n Check me out on facebook @ Craig Woyak Productions \n Two good torrent sites concen.org conspiracyhub.com ","torrent":{"xt":"urn:btih:3dfe79570f0d32c15ed9c31c1640b9ec83cd5372","amp;dn":"Televilsion+%28conspiracy+TV%29+%5Bxyz%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dfe79570f0d32c15ed9c31c1640b9ec83cd5372","infoHashBuffer":{"type":"Buffer","data":[61,254,121,87,15,13,50,193,94,217,195,28,22,64,185,236,131,205,83,114]},"announce":[],"urlList":[]}}