{"title":"Nullsoft WinAmp Pro v5.70 build 3392 with Key [TorDigger]","uid":8500843,"size":18097567,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:3eb5af830babb1ae8ad4f2423cab8d63fd582906&amp;dn=Nullsoft+WinAmp+Pro+v5.70+build+3392+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1369291766,"description":"WinAmp Pro\n\nWinamp is a free multimedia player made by Nullsoft. It supports numerous audio and video formats. It also plays streamed video and audio content, both live and recorded, authored worldwide. It has an extremely customizable media library, and allows you to rip and burn your favorite music CDs. \n\nWinamp has thousands of skins and plug-ins that allow you to change the look-and-feel of the player, as well as add new features. The player also has access to thousands of free songs, videos and online radio stations from SHOUTcast Radio and AOL Radio with XM.\n\nVersion 5.7 enhances dynamic Song Recommendations, discovers artist Songs, Videos, Radio and Photos, OL Radio Powered by CBS Radio. \n\nBurn CDs Faster - Up to 48x! \n\nWith Unrestricted Audio CD Burning, Winamp Pro enables you to burn your favorite music compilations at your computer's full potential. Once registered, Winamp Pro will allow you to burn your Audio CDs at speeds up to 48x, 9 times the speed of Winamp 5! (Actual speeds may differ, depending on your computer's specifications.)\n\nRip/Encode Music into aacPlus, AAC, MP3, and WMA!\n\nWith Winamp Pro, you can rip all your favorite music CDs into the industry leading MP3 format. When all your songs are encoded in MP3, it provides you the freedom to play them in all MP3 capable hardware and software media players. Your ripping doesn't end with the MP3 format, you'll also have the ability to rip into aacPlus, AAC, MP3, and WMA! Another bonus to Winamp Pro is the ability to rip HE-AAC at &gt;128k bitrate!\n\nFaster, Unlimited Ripping - Up to 48x! \n\nWith Unrestricted Audio CD Ripping, Winamp Pro enables you to convert all of your favorite music CDs into digital files at your computer's maximum potential. Once registered, Winamp Pro can rip your CDs at speeds up to 48x, 9 times the speed of Winamp 5! (Actual speeds may differ, depending on your computer's specifications.)\n\nSupported OS:\n\nWin All\n\nHomepage: http://www.winamp.com\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given name/key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:3eb5af830babb1ae8ad4f2423cab8d63fd582906","amp;dn":"Nullsoft+WinAmp+Pro+v5.70+build+3392+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb5af830babb1ae8ad4f2423cab8d63fd582906","infoHashBuffer":{"type":"Buffer","data":[62,181,175,131,11,171,177,174,138,212,242,66,60,171,141,99,253,88,41,6]},"announce":[],"urlList":[]}}