{"title":"Deer Tracks - The Archer Trilogy, Pt. 2  2011","uid":6731107,"size":234359542,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3eb8e09d95475c69326b6c815e0ab4be4196e507&amp;dn=Deer+Tracks+-+The+Archer+Trilogy%2C+Pt.+2++2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1318159369,"description":"The Deer Tracks are a Northern Light Electronica duo from Sweden, and if they arent recording in one woodland cabin or another, theyre off-duty in their tiny hometown of GÃƒÂ¤vle, best known for burning an effigy of a goat every Christmas.\n\nDavid Lehnberg &amp; Elin Lindfors are the only two constant pieces in the always evolving puzzle of The Deer Tracks. These two versatile multi-instrumentalists and singers, handle everything from writing to recording to production and even data recovery, depending on how badly behaved their way too-old computers are being. But they arent worried about the bumps and detours along the way. Says David: The universe has its own way of course connecting.\n\nAfter touring Europe and Japan, in the spring and summer of 2010 The Deer Tracks retreated to the Swedish wilderness to create their definitive statement to date. In Elins grandmothers remote cabin with no phone lines, no friends and one barely working computer, The Deer Tracks wrote and recorded their epic The Archer Trilogy, now releasing as their U.S. debut in three parts: Pt. 1, a five-song EP released last March; Pt. 2: a full album to be released on July 5. And Pt. 3 - yet to be revealed as the final installment.\n\nWe try to be close to nature, says David. If youre locked up in a studio where everything is perfect and theres no wind or rain blowing in to destroy the recording - if you dont push the boundaries  - its gonna sound like youre not trying to do something thats real. But if you lock yourself up in a cabin in the woods, things start to happen. Youll start to find your way back to your inner core, back to life.\n\nFor breaks, Elin would splash through a nearby stream and return soaking-wet to record. When their hard drive repeatedly crashed, David would fish through whatever digital fragments were left and stitch together brand-new songs. Cacophony and melody are their two favorite things, they say. On The Archer Trilogy, the otherworldly experimentation collides with the propulsive danceability - but then fractured and kaleidoscoped thanks to The Deer Tracks own unique inspirations and way of thinking about music.\n\nWe play with everything we can get our hands on! says David. Small music boxes, glockenspiels, forks, coffee mugs, pretty much whatever is laying around - we try to build our own instruments in a way. Take small parts from one to put with another and make special sound. Its like a big puzzle.\n\nThe Deer Tracks display their signature schizophrenia on The Archer Trilogy: PT.2; Elin sings breathlessly over an anxious synthesizer melody and suddenly a hard-edged guitar riff snaps the song in two, only to fall away as strings and bass sweeps in for a soaring chorus.\n\nTheir songs often stride fearlessly into the forest primeval armed with a stuttering beat and a rattling arsenal of percussion and somehow they blend them all together with other natural found sounds and deliberately lo-fi digital artifacts that adds bristles and grit to their relentless melodies.\n\nThey dont like to reveal too much about their lyrics, they say - They can find inspiration from books, movies, mathematicians, real life and things yet to be discovered. Even though I can write about others history, in every history I can find the history of myself, says Elin. Every character and every situation - its easy to make it your own.\n\nWere always adding things and doing things differently, says David. Were always changing. Were never satisfied. Everything is unfinished!\n\nBut I like that, says Elin. I like when theres not an ending.\n(thedeertracksmusic.com)\n\n- - -\n\nDen svenska duon som bestÃƒÂ¥r utav David Lehnberg &amp; Elin Lindfors har funnits sedan 2008, dÃƒÂ¥ deras album Aurora slog igenom i hela vÃƒÂ¤rlden. Stora tidningar som NME, The Guardian hyllade albumet. Att en utav bandets lÃƒÂ¥tar hÃƒÂ¶rs i fullÃƒÂ¤ngd i den populÃƒÂ¤ra tvserien Greys Anatomy, gjorde dem ju inte mindre populÃƒÂ¤ra, utan dÃƒÂ¤r ÃƒÂ¶kade deras antal anhÃƒÂ¤ngare storartat. Deras nya album, The Archer Trilogy Pt2 ÃƒÂ¤r det andra, av totalt tre som tillsammans ÃƒÂ¤r en fantastisk triologi. Och jag vÃƒÂ¤ntar ihÃƒÂ¤rdigt pÃƒÂ¥ det tredje. Musiken gÃƒÂ¥r under namnet Elektronica, men ÃƒÂ¤r ett alldeles eget pottpurri av passion, noggranhet, harmoni, romantik och tidlÃƒÂ¶shet. Elin Lindfors sÃƒÂ¶ta, men ack sÃƒÂ¥ skÃƒÂ¶ra rÃƒÂ¶st blandas perfekt med den underbara musiken och gÃƒÂ¶r mig berÃƒÂ¶rd, minst sagt. I sorlet av The Deer Tracks kommer hela tiden nya ÃƒÂ¶verraskningar nÃƒÂ¤r du minst anar det, vilket gÃƒÂ¶r att det aldrig heller blir trÃƒÂ¥kigt. Overraskningarna kan vara allt frÃƒÂ¥n ett vackert, dÃƒÂ¤mpat piano, till munspel eller en vacker sÃƒÂ¥ngslinga, men i bakrunden finns den dÃƒÂ¤r typiskt stabila elektronika/ambient-pulsen. Resultatet av alla element som blandas perfekt i The Deer Tracks-dimman erhÃƒÂ¥ller endast ett ord. Magiskt ÃƒÂ¤r ordet. (kulturbloggen.com)\n\n- - -\n\n\nDeer Tracks - The Archer Trilogy pt. 2  2011 \n(Stockholm Control Group)\n\n1. Meant to be \n2. Fra ro raa, Ro ra fraa \n3. The archer \n4. Dark passenger \n5. 1.000 vÃƒÂ¤nda kinder \n6. Fa-fire \n7. Tiger \n8. Fall with me \n9. U-turn\n","torrent":{"xt":"urn:btih:3eb8e09d95475c69326b6c815e0ab4be4196e507","amp;dn":"Deer+Tracks+-+The+Archer+Trilogy%2C+Pt.+2++2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eb8e09d95475c69326b6c815e0ab4be4196e507","infoHashBuffer":{"type":"Buffer","data":[62,184,224,157,149,71,92,105,50,107,108,129,94,10,180,190,65,150,229,7]},"announce":[],"urlList":[]}}