{"title":"Elementary Order (gnv64)","uid":6952548,"size":9419721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3edb22ef4f5f72970959b7b523634719fc19df63&amp;dn=Elementary+Order+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gnv65","files":-1,"time":1326413536,"description":"Elementary Order \nby Igor Petryanov, Dmitri Trifonov\nMIR | 1984 | 154 pages | PDF | 9 mb\nscanned to PDF by me\n\nThis is a book on the PERIODIC LAW. Mendeleev's periodic law had a tremendous influence on the progress of research in atomic structure and in the nature of matter. In turn, the advances in atomic physics, the development of new investigation techniques, and the evolution of quantum mechanics extended and deepened the essence of the periodic law.\nThe discovery of the periodic law is the supreme landmark in the annals of chemistry. Historians of science usually differentiate two periods in the development of chemical knowledge: before and after Mendeleev's law.\n\nIgor Vasilyevich Petryanov is an eminent Soviet scientist in the field of physical chemistry. He was born in 1907 and graduated from the Moscow University in 1931. He has been engaged in scientific research for over 50 years in the Karpov Physical Chemistry Insti-tute and is a professor of the Mendeleev Institute of Chemical Technology. He is one of the few investigators developing a new, highly important branch of science: the theory of aerosols.\nDmitri Nikolaevich Trifonov, D. Sc. (Chem.), is a Soviet chemist engaged in research in the history of chemistry. Dr. Trifonov was born in 1932. He graduated from the Chemical Department of the Moscow University. He is affiliated with the Institute. The principal scientific works of Dr. Trifonov deal with the theory and history of the periodic system of chemical elements. He has written several books on these subjects, some of which have been published abroad.\n\nContents\nHow the Elements Were Reduced to Order 7\nThe Arduous Road Travelled by the Periodic Law 29\nThe Periodic Law is the Law of Atomic Structure 56\nArtificial Elements 102\nForetelling the Future 132\nThe Omnipresent Law of Periodicity 151","torrent":{"xt":"urn:btih:3edb22ef4f5f72970959b7b523634719fc19df63","amp;dn":"Elementary+Order+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3edb22ef4f5f72970959b7b523634719fc19df63","infoHashBuffer":{"type":"Buffer","data":[62,219,34,239,79,95,114,151,9,89,183,181,35,99,71,25,252,25,223,99]},"announce":[],"urlList":[]}}