{"title":"Fiona Apple - The Idler Wheel Is Wiser Than The Driver Of The Sc","uid":8074345,"size":233568588,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3ee0edebf610ad3dbee6c66e7638569f54825516&amp;dn=Fiona+Apple+-+The+Idler+Wheel+Is+Wiser+Than+The+Driver+Of+The+Sc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1359346425,"description":"Artist: Fiona Apple\nRelease: The Idler Wheel Is Wiser Than The Driver Of The Screw And Whipping Cords Will Serve You More Than Ropes Will Ever Do\nDiscogs: 3669104\nReleased: 2012-06-19\nLabel: Clean Slate, Epic / Clean Slate\nCatalog#: 88691978631 / 88691978632\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Pop, Rock, Alternative Rock, Pop Rock, Ballad\n\nTracklisting:\n\n01. Every Single Night (3:33)\n02. Daredevil (3:28)\n03. Valentine (3:32)\n04. Jonathan (5:03)\n05. Left Alone (4:50)\n06. Werewolf (3:12)\n07. Periphery (4:58)\n08. Regret (5:16)\n09. Anything We Want (4:40)\n10. Hot Knife (4:02)\nIn March, a 12-year-old letter Fiona Apple once wrote to a young gay fan named Bill surfaced online. &quot;A person who loves is a righteous person,&quot; read the supportive note, &quot;and if someone has the ability and desire to show love to another-- to someone willing to receive it, then for goodness' sake, let them do it.&quot; The message was warm, thoughtful, sincere. But its presentation was just as important. It was written-out by hand, on lined paper. And there were Apple's pen marks-- a distinctive blend of print and cursive-- legible yet casual, perfect in its imperfections. The letter provided an instant reminder of the singer-songwriter's lasting appeal, why she can take six or seven years between albums and return to even-more-rabid followers. Unguarded honesty doesn't go out of style. \nThis is especially true in 2012, when major artists can get so caught up in &quot;brand management&quot; and web-based &quot;social engagement&quot; that the core of their art-- emotion, intelligence, meaningful connectivity-- is sometimes lost amidst bottomless scrolls. Being able to slice through the bullshit is arguably more coveted now than when Apple did just that during her ferocious acceptance speech at the 1997 VMAs. Another famed modern truth-teller and award-show crasher (and noted Fiona fan), Kanye West, has been able to harness technology, the media, and his own public projection by constantly negotiating with all things fresh and new. Apple doesn't really care about all that. In interviews from both 2000 and 2012, she claimed to not listen to any new music whatsoever, and when she recently sat down with Carrie Battan for a Pitchfork interview, she referred to Google as &quot;this whole Google thing,&quot; like an overwhelmed grandmother. On her entirely acoustic fourth album, The Idler Wheel Is Wiser Than the Driver of the Screw and Whipping Cords Will Serve You More Than Ropes Will Ever Do, the 34-year-old makes herself heard with her voice, her words, her piano, and not much else.\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:3ee0edebf610ad3dbee6c66e7638569f54825516","amp;dn":"Fiona+Apple+-+The+Idler+Wheel+Is+Wiser+Than+The+Driver+Of+The+Sc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ee0edebf610ad3dbee6c66e7638569f54825516","infoHashBuffer":{"type":"Buffer","data":[62,224,237,235,246,16,173,61,190,230,198,110,118,56,86,159,84,130,85,22]},"announce":[],"urlList":[]}}