{"title":"The Human Beinz - Evolutions (1968) MP3@320kbps","uid":9625699,"size":71762631,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3eff9c8ed855b8e64ef13b0d835aa1b639330552&amp;dn=The+Human+Beinz+-+Evolutions+%281968%29+MP3%40320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AaronVincent","files":10,"time":1392589317,"description":"The Beinz started in 1964 as The Premiers, launching their professional career to build a local fan base. In 1966, they changed their name to The Human Beingz because they felt their old name did not fit with the feel of the late 1960s. They recorded covers of songs by Them, The Yardbirds, The Who and Bob Dylan. The group was also the first[1] to record a cover of &quot;Gloria&quot; by Them, which became a hit for the Shadows of Knight, and covered &quot;The Pied Piper&quot;, which later became a hit for Crispian St. Peters.\n\nThe group signed to Capitol Records in 1967 and at that time Capitol misspelled their name, leaving out the &quot;g&quot;. The Beingz were told it would be changed on the next release if the debut single did not have any success. In September 1967 &quot;Nobody but Me&quot; was released and became their only Billboard Top 40 hit, which meant that Capitol would not correct the spelling. &quot;Nobody But Me&quot; (written and first recorded by The Isley Brothers in 1962) peaked at No. 8 in February 1968. The recording's two 31-fold repetitions of the word &quot;no&quot; fulfill Casey Kasem's &quot;Book of Records&quot; category of most repetitive word or phrase in a Hot 100 top 10 hit, besting the 26-fold repetition of &quot;I know&quot; in Bill Withers' &quot;Ain't No Sunshine&quot;. An album, Nobody But Me, followed.\n\nThe Beinz' next single, &quot;Turn On Your Love Light,&quot; flopped in the United States (peaking at No. 80), but reached No. 1 in Japan.[2] &quot;Turn On Your Love Light&quot;, originally a hit for Bobby Bland in 1962, was later covered by Jerry Lee Lewis and the Grateful Dead. In 1968, Capitol released a second album, Evolutions. They also released the single, &quot;Hold on Baby&quot;, exclusively in Japan, where it also hit the top of the charts. Despite their Japanese success, The Human Beinz broke up in March 1969, but due to contract obligations, had to undertake a tour there.\n\nTheir song &quot;Dance On Through&quot; was featured in an episode of The Addams Family.\t","torrent":{"xt":"urn:btih:3eff9c8ed855b8e64ef13b0d835aa1b639330552","amp;dn":"The+Human+Beinz+-+Evolutions+%281968%29+MP3%40320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3eff9c8ed855b8e64ef13b0d835aa1b639330552","infoHashBuffer":{"type":"Buffer","data":[62,255,156,142,216,85,184,230,78,241,59,13,131,90,161,182,57,51,5,82]},"announce":[],"urlList":[]}}