{"title":"Plasticity - Fundamentals and Applications","uid":14646630,"size":48728403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3f0d4fec6b27f92fc36420ab10cbe9a4534eeef7&amp;dn=Plasticity+-+Fundamentals+and+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463595349,"description":"Plasticity - Fundamentals and Applications - P. M. Dixit, U. S. Dixit (CRC, 2015).pdf\r\n\r\nISBN 978-1-4822-8242-9\r\n\r\nExplores the Principles of Plasticity\r\n\r\nMost undergraduate programs lack an undergraduate plasticity theory course, and many graduate programs in design and manufacturing lack a course on plasticity—leaving a number of engineering students without adequate information on the subject. Emphasizing stresses generated in the material and its effect, Plasticity: Fundamentals and Applications effectively addresses this need. This book fills a void by introducing the basic fundamentals of solid mechanics of deformable bodies. It provides a thorough understanding of plasticity theory, introduces the concepts of plasticity, and discusses relevant applications.\r\n\r\nStudies the Effects of Forces and Motions on Solids\r\n\r\nThe authors make a point of highlighting the importance of plastic deformation, and also discuss the concepts of elasticity (for a clear understanding of plasticity, the elasticity theory must also be understood). In addition, they present information on updated Lagrangian and Eulerian formulations for the modeling of metal forming and machining.\r\n\r\nTopics covered include:\r\n\r\nStress\r\nStrain\r\nConstitutive relations\r\nFracture\r\nAnisotropy\r\nContact problems\r\n\r\nPlasticity: Fundamentals and Applications enables students to understand the basic fundamentals of plasticity theory, effectively use commercial finite-element (FE) software, and eventually develop their own code. It also provides suitable reference material for mechanical/civil/aerospace engineers, material processing engineers, applied mechanics researchers, mathematicians, and other industry professionals","torrent":{"xt":"urn:btih:3f0d4fec6b27f92fc36420ab10cbe9a4534eeef7","amp;dn":"Plasticity+-+Fundamentals+and+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0d4fec6b27f92fc36420ab10cbe9a4534eeef7","infoHashBuffer":{"type":"Buffer","data":[63,13,79,236,107,39,249,47,195,100,32,171,16,203,233,164,83,78,238,247]},"announce":[],"urlList":[]}}