{"title":"iPredict Pro v1.0.3","uid":8644714,"size":1534575,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:3f3cf96a7d0497bcbbd8419a0f1f32067e320b1f&amp;dn=iPredict+Pro+v1.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1372959239,"description":"\nA mind-crippling prediction from a borrowed cell phone!\nFrom the creators of iForce and iPredict+ comes the World's FIRST professional magic app.\n\nImagine . . .\n\nYou want to leave your number with someone of the opposite sex. ;-)\nFor example, her name is Linda . . . she's a blonde, wearing a red sweater.\n\n&quot;I'm going to be leaving for a vacation tomorrow. I've already recorded my 'going away' message on my voicemail.&quot;\n\n&quot;Before I ask you anything, please punch in my mobile number on your phone.&quot;\n\n&quot;Here's a list of the cities I was considering for my vacation on this napkin. Why don't you point at your favorite city.&quot;\n\nLet's say she points at London.\n\n&quot;Wow, I can't believe it. You went straight for it. Hit 'Send' on your phone and call me.&quot;\n\nYou give your phone to her, she calls your number, and rejects the call on your phone so it goes to voicemail.\n\nHere's your voicemail: \n&quot;Hi, If you're trying to reach me this week, I'll be on vacation. I'm going to be in London, England. So, if you're the blonde with the red sweater from my dreams, AND if you like my city, perhaps you should join me. Leave a message after the beep.&quot;\n\nThe above is just one of infinite applications of iPredict Pro.\n\nYou can choose to have your spectators call/text a third party (psychic, friend, etc).\nIf they text this third party, he/she will reply with the correct prediction in a text message (this is great for loud environments where a phone call is hard to hear). \n\nThe phone call or text message looks completely real - because it IS completely real! On their OWN phone. \nStandard phone and text message rates may apply.\n\niPredict Pro is NOT a TOY.\nIt was designed for the professional magician that demands pro quality, AMAZING effect and customizability in a powerful utility that works ANYTIME, ANYWHERE, without ANY props.\n\n- Easy to do. Includes written/video instructions and a Training Mode.\n- Includes two preset effects (cards &amp; numbers) so you can start performing immediately.\n- Customize iPredict Pro to use your voice greeting messages . . . the possibilities are ENDLESS!\n- Your spectators can call or text from THEIR phone! \n- You can perform anytime (no need for any props). If you have your phone, you can perform.\n- You need to have any access to the internet, either through Wi-Fi or cellular data (3G, 4G, etc.) \n- iPredict Pro uses ONE number. You can hand out this number before you begin.\n- You can choose (on the fly) if that number is YOUR mobile number or another number.\n- If you perform with YOUR number, when your specs call you, THEY will reject the call to voicemail.\n- Since iPredict Pro uses a voicemail server, you can have ALL of your spectators call you at the SAME TIME! \n- Camouflage iPredict Pro to make your phone completely examinable.\n- The custom voicemail service costs $1/month + $0.01/performance . . . you can cancel the service ANY time. \n- No voice recognition. No assistants or stooges\n\nAre you ready for the ULTIMATE phone effect? Download iPredict Pro now.\n\nWhat's in this version:\n\nCustomize SMS text message responses for &quot;Custom&quot;.\nGo to Settings &gt; Preset &gt; Custom &gt; Details &gt; &quot;Customize SMS responses&quot;\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.rostamimagic.ipredict.pro.android&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.rostamimagic.ipredict.pro.android&lt;/a&gt;\n","torrent":{"xt":"urn:btih:3f3cf96a7d0497bcbbd8419a0f1f32067e320b1f","amp;dn":"iPredict+Pro+v1.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f3cf96a7d0497bcbbd8419a0f1f32067e320b1f","infoHashBuffer":{"type":"Buffer","data":[63,60,249,106,125,4,151,188,187,216,65,154,15,31,50,6,126,50,11,31]},"announce":[],"urlList":[]}}