{"title":"Pacific - The Ocean of the Future (2015).epub Gooner","uid":14888039,"size":24821770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:405726557ec1c63868ffca6b8d07e91f5579f28a&amp;dn=Pacific+-+The+Ocean+of+the+Future+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1465749177,"description":"Pacific - The Ocean of the Future (2015).epub Gooner\r\n\r\nPublisher: William Collins (22 Oct. 2015)\r\nLanguage: English\r\nISBN-10: 0007550758\r\nISBN-13: 978-0007550753\r\n\r\nTravelling the circumference of the truly gigantic Pacific, Simon Winchester tells the story of the world’s largest body of water, and – in matters economic, political and military – the ocean of the future.\r\n\r\nThe Pacific is a world of tsunamis and Magellan, of the Bounty mutiny and the Boeing Company. It is the stuff of the towering Captain Cook and his wide-ranging network of exploring voyages, Robert Louis Stevenson and Admiral Halsey. It is the place of Paul Gauguin and the explosion of the largest-ever American atomic bomb, on Bikini atoll, in 1951. It has an astonishing recent past, an uncertain present and a hugely important future.\r\n\r\nThe ocean and its peoples are the new lifeblood, fizz and thrill of America – which draws so many of its minds and so much of its manners from the sea – while the inexorable rise of the ancient center of the world, China, is a fixating fascination. The presence of rogue states – North Korea most notoriously today – suggest that the focus of the responsible world is shifting away from the conventional post-war obsessions with Europe and the Middle East, and towards a new set of urgencies. Navigating the newly evolving patterns of commerce and trade, the world’s most violent weather and the fascinating histories, problems and potentials of the many Pacific states, Simon Winchester’s thrilling journey is a grand depiction of the future ocean","torrent":{"xt":"urn:btih:405726557ec1c63868ffca6b8d07e91f5579f28a","amp;dn":"Pacific+-+The+Ocean+of+the+Future+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"405726557ec1c63868ffca6b8d07e91f5579f28a","infoHashBuffer":{"type":"Buffer","data":[64,87,38,85,126,193,198,56,104,255,202,107,141,7,233,31,85,121,242,138]},"announce":[],"urlList":[]}}