{"title":"Peter Beets Trio - 2005 - Live At The Concertgebouw FLAC","uid":8868454,"size":654341591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40ada6733891fe6c04e87c2c5dd3b97dad54c2be&amp;dn=Peter+Beets+Trio+-+2005+-+Live+At+The+Concertgebouw+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1377988986,"description":"Peter Beets Trio - 2005 - Live At The Concertgebouw\n\nJazz pianist Peter Beets was born June 12, 1971, in The Hague, Netherlands. From birth he was surrounded by classical music via his mother and jazz from his father, the latter of whom was a fan of Oscar Peterson and Art Blakey. Older brothers Marius, a bassist, and Alexander, a tenor saxophonist, and the family moved in 1972 to Groenlo, where Peter received his first piano lessons at the age of six. Peter studied in his late teens and early twenties at the Royal Conservatory in The Hague, and also attended law school. In 1985, the Beets Brothers teamed up professionally, and in 1988 Peter won the Pall Mall Swing Award and a year later the Princess Christina Award. In 1990 the first recording of the Beets Brothers was issued, followed by School Is Closed Now and Brotherwise. Then Peter recorded his debut as a leader, First Date, with drummer Jeff Hamilton. Completing conservatory studies, he won the Parisian Prix du Martial Solal, and became a member of the Jazz Orchestra of the Concertgebouw. He has been making recordings for the Criss Cross label, working with Americans like Rodney Whitaker, Willie Jones III, Larry Grenadier, Reginald Veal, Herlin Riley, Joe Cohn, and Reuben Rogers, as well as fellow Dutch jazzmen Martijn Van Iterson and Ruud Jacobs. Though rarely in the U.S., he has toured Europe extensively. Over the years Peter Beets has collaborated with Curtis Fuller, Chick Corea, Wynton Marsalis, Dee Dee Bridgewater, George Coleman, Johnny Griffin, Chris Potter, and John Clayton. (AllMusic)\n\nTrack list:\nCD 1\n01 - Degage.flac\n02 - It Has Happened.flac\n03 - The Judge.flac\n04 - Trisity.flac\n05 - I've Got My Love To Keep Me Warm.flac\n06 - It Has Happening.flac\nCD 2\n01 - For Simon.flac\n02 - Prelude In E Minor.flac\n03 - Is It Wrong o Be Right.flac\n04 - Without A Song.flac\n05 - Passport.flac\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:40ada6733891fe6c04e87c2c5dd3b97dad54c2be","amp;dn":"Peter+Beets+Trio+-+2005+-+Live+At+The+Concertgebouw+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ada6733891fe6c04e87c2c5dd3b97dad54c2be","infoHashBuffer":{"type":"Buffer","data":[64,173,166,115,56,145,254,108,4,232,124,44,93,211,185,125,173,84,194,190]},"announce":[],"urlList":[]}}