{"title":"Greil-Slawenlegende(origins of slavic nations)(1972)","uid":4747111,"size":1548316,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:40d1fced675fa7550805580b7938d67f4ba2657b&amp;dn=Greil-Slawenlegende%28origins+of+slavic+nations%29%281972%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1235938027,"description":"For english-only speaking:\nThis book is in german language. English title would be: The legend of Slavs - Germans as victims of faked history - Explanatory documentation (1972). History is often only a tool based on lies and fakeries in the hands of power politics that redirects the fate of the world according to its secret plans. If one today visits south and eastern Europe from a far-away land, he would immediately notice an incredible number of little nations that loosely describe themselves as slavic in origin but can barely understand eachother's language. But was it always like that? Where is the origin of this national schizophrenia? Lothar Greil goes back to history to uncover a startling origin of today's slavic nations and the political movement known as panslavism. In the times of communism it was politically correct to say that all these slavic people are immigrants from lands occupied by the former Soviet Union although a far more natural explanation should be obvious. As hinted by archeological excavations, many hundreds of years ago all these lands were occupied by a number of tribes that had no idea of what &quot;Poles&quot;, &quot;Czechs&quot;, &quot;Slovaks&quot;, &quot;Ukrainians&quot;, &quot;Romanians&quot;, &quot;Bulgars&quot;, &quot;Slovenians&quot;, &quot;Croatians&quot;, &quot;Serbs&quot; etc. mean. It is the physical historic record from excavations that tells a very different story of their actual origin. It seems that they were far more connected (if not identical) to the germanic tribes at the north than any other as indicated by their language and names of people and cities. As the author notices, something quite revolutionary had to have happened, that all these people &quot;suddenly&quot; started to speak in languages completely different from germanic dialects. It is interesting to note that this period also coincides with massive (and forceful) christianization of Europe as undertaken by the Church of Rome. Today we know that the strange writing known as &quot;glagolica&quot; was spread by catholic monks throughout of southern Balkans. Is it possible that this was just a small part in a larger plan of Roman catholic church to completely change the language, culture and national identity of germanic tribes throughout southern and eastern Europe? As the author concludes, this is exactly the case, resulting in unnatural language confusion and what is even more important - endless hatred against the Germans who refused to be christianized and later protested against Rome. In such a way a whole buffer of small now called &quot;slavic&quot; nations was created around central area of today's Germany that would throughout time feel completely alienated from their germanic roots. Greil convincigly demonstrates that simply all of names of people and cities throughout southern and eastern Europe evolved from their germanic roots and were later cleverly masked by the &quot;slavic&quot; counterparts. This rare and important documentation serves as a striking example of roman policy of &quot;divide et empera&quot; (divide/confuse and rule) that created the national madness that would result in incredible hatred and wars among the people that were once part of the same linguistic and racial group. 145 pages.\n\nFur Deutschsprachige:\nGeschichte ist oft nur ein Werkzeug auf LÃƒÂ¼gen und FÃƒÂ¤lschungen basierender Machtpolitik demjenigen in die HÃƒÂ¤nde manÃƒÂ¶vriert, der sie mangels eigener historisch fundierter Substanz bedenkenlos zur Durchsetzung seiner hintergrÃƒÂ¼ndigen Absichten einsetzen kann. Wir sind heute Zeugen dieser Politik, die sich die geballten KrÃƒÂ¤fte des europÃƒÂ¤ischen Ostens, mit der vom Russentum bestimmten Sowjetunion als Vorreiter, zu eigen und nutzbar gemacht haben, deren Wurzeln tatsÃƒÂ¤chlich in ferne Zeiten zurÃƒÂ¼ck-zuverfolgen sind. Als Werkzeug stellt sich der vor ÃƒÂ¼ber 100 Jahren aus der Retorte raffinierter Geschichtsalchimisten geborene sogenannte Panslawismus dar. Die ungeheuerlichen Auswirkungen dieser in die weltumstÃƒÂ¼rzende Praxis verwandelten Theorie unerbittlicher, aggressiv bestimmter Expansion durch &quot;das Slawentum&quot; aller Spielarten sind evident. Das menschenmÃƒÂ¶gliche dazu trugen und tragen unwissende Historiker, teils &quot;von Rang und Namen&quot;, und in deren Gefolge dilettantische oder bestochene Politiker des Westens bei. Seit etwa 170 Jahren webten - und knÃƒÂ¼pfen bis auf den heutigen Tag - an dem Netz der LÃƒÂ¼ge mit grÃƒÂ¶ÃƒÅ¸ter Vehemenz, die einer besseren Sache wert wÃƒÂ¤re, vor allem deutschsprachige &quot;Slawen&quot;-BegÃƒÂ¼nstiger (Slawophile). Wer aber waren nun &quot;die Slawen&quot;, ein Volk, dessen &quot;Hauptstamm&quot; noch nicht einmal mit eigenem Namen aufwarten konnte, oder eine zielgerichtete kirchenpolitische Manipulation? Woher kamen &quot;die Polen&quot;, waren sie als &quot;slawischer&quot; Volksstamm plÃƒÂ¶tzlich aus der Versenkung aufgetaucht oder stellen auch sie das Produkt einer wohlberechneten - klerikalen - KunstschÃƒÂ¶pfung (des 13. Jahrhunderts) dar? Und wer eigentlich bewohnte das bÃƒÂ¶hmisch-mÃƒÂ¤hrische Becken, waren und sind es Germanen bis auf den heutigen Tag oder etwa &quot;Tschechen&quot;, denen man nach jahrhundertelanger Vor- und jahrzehntelanger PrÃƒÂ¤zisionsarbeit diese konstruierte Bezeichnung als geistig-politische Trennmauer zum Deutschtum aufgezwungen hat? Waren &quot;die Wenden&quot; der Mark Brandenburg sowie anderer mittel- und norddeutscher Gebiete einst etwa &quot;Slawen&quot; gewesen oder nicht vielmehr heidnisch gebliebene, erst spÃƒÂ¤ter zwangschristianisierte Germanen? Was spielten die Bulgaren fÃƒÂ¼r eine Rolle, auf welche Weise traten Serben und Kroaten ins Licht der Geschichte? Diese AufklÃƒÂ¤rungsdokumentation zeigt dass die Slawen eigentlich Ostgermanen sein. 145 Seiten.\n","torrent":{"xt":"urn:btih:40d1fced675fa7550805580b7938d67f4ba2657b","amp;dn":"Greil-Slawenlegende%28origins+of+slavic+nations%29%281972%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40d1fced675fa7550805580b7938d67f4ba2657b","infoHashBuffer":{"type":"Buffer","data":[64,209,252,237,103,95,167,85,8,5,88,11,121,56,214,127,75,162,101,123]},"announce":[],"urlList":[]}}