{"title":"(PSX-PSP) Thousand Arms converted properly (Kingdom-games by Klo","uid":4628326,"size":984028581,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:40ef2253e48c54df74c7b06f472e9bdc63d3b12d&amp;dn=%28PSX-PSP%29+Thousand+Arms+converted+properly+%28Kingdom-games+by+Klo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicjuggalo","files":2,"time":1231289908,"description":"THOUSAND ARMS:\n\nMeis Triumph is a spirit blacksmith and the guardian of Kant. One day he is forced to leave his ancestral home by a gang of ruthless thugs. Luckily, he makes it to the capital city of Boyzby where he meets Sodina. Her brother Jyabil is a master spirit blacksmith and takes Triumph as an apprentice. However, the army that forced Meis out of Kant has its eyes on Boyzby. This is the start of your adventure to save the world. What separates THOUSAND ARMS from other role-playing games is its Master system. Since you (as Meis) are a spirit blacksmith, you can use your skills to improve the weapons and items your party carries. However, to gain better skills as a blacksmith you must answer questions from Sodina and try to keep her happy. If you is successful your intimacy level increases and you'll will learn new skills. It's up to you to save the world in THOUSAND ARMS.\n\n\nConverted both discs to a single EBOOT.. Tested and working flawlessly on CFW 5.00 M33-4 combined with Dark-Alex's 500 popsloader and using 3.72 POPS.\n\n","torrent":{"xt":"urn:btih:40ef2253e48c54df74c7b06f472e9bdc63d3b12d","amp;dn":"%28PSX-PSP%29+Thousand+Arms+converted+properly+%28Kingdom-games+by+Klo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ef2253e48c54df74c7b06f472e9bdc63d3b12d","infoHashBuffer":{"type":"Buffer","data":[64,239,34,83,228,140,84,223,116,199,176,111,71,46,155,220,99,211,177,45]},"announce":[],"urlList":[]}}