{"title":"Alex Jones Show - 2012 May 08 TU [sebaygo1]","uid":7254371,"size":67200744,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:41708a2eaffdf13a42759cd5e8a457f25599a9b2&amp;dn=Alex+Jones+Show+-+2012+May+08+TU+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":9,"time":1336544221,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nTuesday, 08 May 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn the Tuesday, May 8 edition of the Alex Jones Show, Alex covers a number of important and breaking news stories, including the curious disappearance of a key witness in the death of establishment gadfly Andrew Breitbart, growing outrage and opposition to the government's CISPA internet censorship legislation, and a new underwear bomber patsy proffered by the CIA in the government's war on terror.\n\nThough not mentioned on in the web site's description, Alex is joined in the second and third hours by Dr. Joel Wallach. Wallach is is a veterinarian and naturopath who claims that all diseases are due to mineral deficiencies, that everyone who dies of natural causes dies because of mineral deficiencies. In 1997 Wallach founded a supplement company, American Longevity, which in 2006 became Youngevity &quot;for greater global brand recognition.&quot; Youngevity is the manufacurer of the products Alex sells via InfowarsTeam.com.\n\nSince a merger in 2011, Youngevity is a wholly-owned subsidiary of AL International, Inc. The current CEO and Chairman of the Board of AL International is Steve Wallach, Dr. Wallach's son. The corporation's Chief Operating Officer is Michelle Wallach, Steve's wife.\n\nNet revenue for 2011 for AL International was $40,200,000. Estimated net revenue for 2012 is $66,500,000. For the intested, much more information is available here: &lt;a href=&quot;\nhttp://www.alintjcof.com/pdfs/AL_International_Initiation_Report.pdf&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.alintjcof.com/pdfs/AL_International_Initiation_Report.pdf&lt;/a&gt;\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:41708a2eaffdf13a42759cd5e8a457f25599a9b2","amp;dn":"Alex+Jones+Show+-+2012+May+08+TU+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41708a2eaffdf13a42759cd5e8a457f25599a9b2","infoHashBuffer":{"type":"Buffer","data":[65,112,138,46,175,253,241,58,66,117,156,213,232,164,87,242,85,153,169,178]},"announce":[],"urlList":[]}}