{"title":"Sex - The Case for Father Custody by Daniel Amneus","uid":4387174,"size":2253636,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:429e48aca50ccf7d291ea583268cc2b5a9f84ac7&amp;dn=Sex+-+The+Case+for+Father+Custody+by+Daniel+Amneus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"leraconteur","files":1,"time":1220978455,"description":"The Case for Father Custody by Daniel Amneus\n\nThis is a book feminist types certainly won't get! Daniel Amneus may be the principle defender of the recently much-maligned patriarchy, which has given us all the benefits of civilization: much longer lifespans due to decent food supplies and public health, generally affluent and peaceful societies, and such accomplishments of which the I-Net is only one of many if you step back and think about it a second.\n\nIn this book Amneus's central thesis is that all this is only possible if women allow men to participate equally in reproduction and have stable two-parent families, a system which benefits men, women, and children and has been breaking down over the last 30-35 years, with often catastrophic results. The way women do this is by accepting sexual law and order (monogamy and chastity generally), which gives men paternity certainty and motivates them to provide and produce all the wonderful benefits of civilization. In the presence of a liberalized female sexuality, things revert back to basic Stone Age and mammalian forms, with the males specializing in predatory and destructive behavior rather than productive and protective behavior -- the matriarchal pattern of the ghetto and the indian reservation. Because many women resist sexual control (but still want the benefits) it's necessary to bind them to males and families by making men the heads of families and doing away with the century-long tried-and-failed experiment in mother custody.\n\nFile Under:\nMGTOW, Men's Rights,mens rights, MRA, FRA, anti-feminism, feminism, mra, fra, Father's Rights, fathers rights, misandry, anti-misandry\n\nThe Essential Men's Rights Library - Torrent #8","torrent":{"xt":"urn:btih:429e48aca50ccf7d291ea583268cc2b5a9f84ac7","amp;dn":"Sex+-+The+Case+for+Father+Custody+by+Daniel+Amneus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"429e48aca50ccf7d291ea583268cc2b5a9f84ac7","infoHashBuffer":{"type":"Buffer","data":[66,158,72,172,165,12,207,125,41,30,165,131,38,140,194,181,169,248,74,199]},"announce":[],"urlList":[]}}