{"title":"Pernice Brothers - The World Won't End [2001] [EAC,log,cue. FLAC","uid":8742764,"size":302370043,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42a1817a001b9df9b659fdca9f9c24ec0d314b18&amp;dn=Pernice+Brothers+-+The+World+Won%27t+End+%5B2001%5D+%5BEAC%2Clog%2Ccue.+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":14,"time":1374834649,"description":"Artist: Pernice Brothers\nRelease: The World Won't End\nReleased: 2001\nLabel: Ashmont Records\nCatalog#: ASHM004\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: POP ROCK\n\n1 - Working Girls (Sunlight Shines) (3:20)\n2 - 7:30 (3:03)\n3 - Our Time Has Passed (3:53)\n4 - She Heightened Everything (2:38)\n5 - Bryte Side (3:11)\n6 - Let That Show (3:44)\n7 - Shaken Baby (4:06)\n8 - Flaming Wreck (5:34)\n9 - The Ballad of Bjorn Borg (3:38)\n10 - Endless Supply (3:51)\n11 - Cronulla Breakdown (3:07)\n\nSo maybe Joe Pernice isn't crazy. He spent his time between the release of the Pernice Brothers' Overcome By Happiness and The World Won't End by issuing Chappaquiddick Skyline and Big Tobacco under separate aliases, claiming that the material on those weren't from his top drawer and that the good stuff was being saved for the second Pernice Brothers record. Most listeners just rolled their eyes, figuring it to be yet another case of a musician's eccentricities and inability to recognize their own talents. After all, those &quot;interim&quot; releases did more than merely maintain fan attention; they might not have been as polished or perfected as Overcome By Happiness, but they were chipped from the same precious ore. So here's the payoff, proving that he was being accurate after all, if a twinge modest. With much of the support from Overcome staying on board with a couple of relative newcomers (this lineup has been in place over two years), The World Won't End is every bit on par with its predecessor, if not an improved effort thanks to the increased importance of those Pernice surrounds himself with. This is a record made by a band, not a singer/songwriter aided by seasoned session hands. The sound is as lush, melodic, and clean as ever (not sterile), with sweet arrangements standing at the polar opposite of lyrics dealing with sinking relationships and pesky emotional ghosts. This is all-purpose pop; you can hum merrily along to the melodies or sink yourself in the lyrics and wonder where everything went wrong. Or both. Regardless of where you're at, you won't lose sight of Pernice's voice, one that most vocalists would cross the river Styx to possess. Most indicative song title: &quot;Endless Supply.&quot; That seems to be the case.","torrent":{"xt":"urn:btih:42a1817a001b9df9b659fdca9f9c24ec0d314b18","amp;dn":"Pernice+Brothers+-+The+World+Won%27t+End+%5B2001%5D+%5BEAC%2Clog%2Ccue.+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a1817a001b9df9b659fdca9f9c24ec0d314b18","infoHashBuffer":{"type":"Buffer","data":[66,161,129,122,0,27,157,249,182,89,253,202,159,156,36,236,13,49,75,24]},"announce":[],"urlList":[]}}