{"title":"Peter Tosh - Legalize It (FLAC) [1976]","uid":5318758,"size":224851900,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4350adb707b5c15c638cf03d1d98689f7c0b7f42&amp;dn=Peter+Tosh+-+Legalize+It+%28FLAC%29+%5B1976%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"black mamba TNT","files":-1,"time":1264798318,"description":"Year: 1976\nGenre: Reggae\n\nTracklist:\n\n01 - Legalize It\n02 - Burial\n03 - Whatcha Gonna Do\n04 - No Sympathy\n05 - Why Must I Cry\n06 - Igziabeher(Let Jah be Praised)\n07 - Ketchy Shuby\n08 - Till Your Well Runs Dry\n09 - Brand New Second Hand\n\nReview:\n\n\nAfter spending 12 years as a member of Bob Marley's Wailers, Peter Tosh was eager to break free from the shadow of the legendary frontman. In 1976, he released LEGALIZE IT, still one of the most significant albums in the history of reggae. The title track expresses one of Tosh's many political causes, justifying the legalization of marijuana as a remedy for various medical ailments. &quot;Burial&quot; is one of several tracks that features the talents of the Wailers' stand-out lead guitarist, Al Anderson.\n\nTosh adds his own seasoning to the reggae pot as he incorporates keyboards in &quot;Whatcha Gonna Do&quot; and synthesizers and sound effects on &quot;Igziabeher.&quot; &quot;Ketchy Shuby,&quot; a sing-along about fooling around, features the background vocal talents of Rita Marley, Bunny Wailer, and Judy Mowatt. Tosh's life ended too early, and LEGALIZE IT is the strongest testament to his legacy. Take a listen, and share the spirit of his genius.\n\nAfter years of being overshadowed by Bob Marley, Peter Tosh left the Wailers to pursue a solo career. Released in 1976, Legalize It is a bold statement that Peter Tosh had arrived and was a creative force in his own right. Although he explores some issues of spirituality, this is Tosh's most lightweight album in the sense that it is his least political. This is not meant as a criticism -- in fact, Tosh's playfulness and joy (&quot;Ketchy Shuby&quot;) only add to the album's charm. He does make political statements (the title track celebrates and promotes the use of marijuana), but they are done with a sense of humor and a melodic infectiousness that belie his sincere concern for the issues. Tosh incorporates many instruments and mixes slower ballads with upbeat grooving tunes. The album's highlight is &quot;Why Must I Cry,&quot; a multi-layered song (co-written with Bob Marley) that conveys a sense of personal failure when fighting an uphill battle, whether it be against injustices of the world or within the confines of a relationship. Legalize It cemented Tosh's position as a giant in reggae, and the album is one of the best albums of the genre. ","torrent":{"xt":"urn:btih:4350adb707b5c15c638cf03d1d98689f7c0b7f42","amp;dn":"Peter+Tosh+-+Legalize+It+%28FLAC%29+%5B1976%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4350adb707b5c15c638cf03d1d98689f7c0b7f42","infoHashBuffer":{"type":"Buffer","data":[67,80,173,183,7,181,193,92,99,140,240,61,29,152,104,159,124,11,127,66]},"announce":[],"urlList":[]}}