{"title":"Sexually Broken--2012 Urban X Perf. of the year!! Skin Diamond  ","uid":7774568,"size":1273864061,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:43dacb65d85c594e2ae2fbdd2ac545e5150f66ae&amp;dn=Sexually+Broken--2012+Urban+X+Perf.+of+the+year%21%21+Skin+Diamond++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1351621456,"description":"2012 Urban X Performer of the year!! Extreme fucking, deep throating and massive orgasm overload! | Skin Diamond | Matt Williams\n            \nOctober 29, 2012\n\n\nMP4 only.\n\n\nWelcome back Skin Diamond to Sexually Broken.com. Skin was the \nUrban X performer of the year for 2012. Did you know that AVN \nhas never in it's history awarded a black female performer of \nthe year? Things that make you go hmmm...\n\nSkin is about to be sexually wrecked. Overloaded, with cock, \norgasms, and brutal bondage. Most girls only ever deal with \none of those things, not all 3, and certainly not at the same \ntime. We start with Skin bound spread against a wall, a rope \nneck holding her in place. We oil up her perfect body, \nmassaging the oil in working her body over. She is pulled taut \nby the ropes, breathing is difficult. We turn her around and \noil up her amazing ass. We vibrate her to near orgasm, but we \ndo NOT let her cum. \n\nWe take the same ropes that held her spread and change the \nbondage before your eyes. Now Skin is completely helpless with \nher arms trapped behind her body. Her oiled up body glistens, \nwe knock her to her knees, her mouth opens, she knows her face \nis about to be devastated with cock. The cock fucks the deep \nback part of her throat cutting off her air supply, we control \nwhen she breaths if she breath with cock. \n\nWe toss Skin onto the bed and bind her legs to her neck and \nslid into her wet tight pussy. With in seconds she cums! The \ncock fucks her deep and hard. We fuck orgasm after orgasm out \nof Skin. We manhandle her hard, switching between deep throat \nskull fucking upside on the bed to pussy fucking. Back and \nforth, never giving Skin a chance to even catch her breath. \nShe is a complete and utter sex toy we use and abuse. Her \nholes are ours to impale at will. She is lost in subspace, \neach orgasm sending her deeper and deeper. \n\nWe look deep into Skin's eyes and there is no one looking \nback. She is cum drunk to the extreme. We take the bondage and \nscorpion her legs and back into a brutal category 5 bondage \nposition. We pull out the vibrator and make Skin cum over and \nover. She is a drooling slobbering mess, her humanity scraped \nraw, reduced to a primitive state of sexual survival. It will \nbe sometime before she is fit for the end interview, some time \nindeed...\n\nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_29skin2/SexuallyBroken-Skin-Diamond-Matt-Williams-2012-Urban-X-Performer-of-the-year-Extreme-fucking-deep-throating-and-massive-orgasm-overload.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2012/10_29skin2/SexuallyBroken-Skin-Diamond-Matt-Williams-2012-Urban-X-Performer-of-the-year-Extreme-fucking-deep-throating-and-massive-orgasm-overload.php&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:43dacb65d85c594e2ae2fbdd2ac545e5150f66ae","amp;dn":"Sexually+Broken--2012+Urban+X+Perf.+of+the+year%21%21+Skin+Diamond++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43dacb65d85c594e2ae2fbdd2ac545e5150f66ae","infoHashBuffer":{"type":"Buffer","data":[67,218,203,101,216,92,89,78,42,226,251,221,42,197,69,229,21,15,102,174]},"announce":[],"urlList":[]}}