{"title":"Martha Wainwright - I Know You're Married But 2008","uid":7028331,"size":336616699,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:467a7498bef6cba13af49a6c651b340ef30eff3e&amp;dn=Martha+Wainwright+-+I+Know+You%5C%27re+Married+But+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1329146067,"description":"Martha Wainwright (born May 8, 1976) is a Canadian-American folk-rock singer-songwriter. She is the daughter of American folk singer and actor Loudon Wainwright III and Canadian folk singer-songwriter Kate McGarrigle. She was raised in a musical family along with her older brother, Rufus Wainwright, in Montreal, Quebec, Canada.\n\nWainwright released an independent cassette, Ground Floor, in 1997. The following year, her song 'Year of the Dragon' appeared on The McGarrigle Hour, an album released by Kate and Anna McGarrigle. Shortly after this recording, Martha began singing backup vocals for her brother, and released the six-song EP Martha Wainwright in 1999.\nFollowing her drama classes at Montreal's Concordia University, she moved to New York City, where she established herself as singer and songwriter. She made contacts within the industry, one of whom was producer Brad Albetta, who worked with Wainwright to produce her self-titled debut album, Martha Wainwright (released April 12, 2005, by MapleMusic Recordings).\nAlbetta worked again with Wainwright to produce her second album, I Know You're Married But I've Got Feelings Too, released in Canada on June 10, 2008. Artists contributing to the album include Pete Townshend (The Who), Donald Fagen (Steely Dan), Garth Hudson (The Band), as well as her mother, brother and aunt.\nWainwright is signed with the independent record labels Rounder Records in the United States, DiS in the United Kingdom, MapleMusic Recordings in Canada, V2 Records in Europe and Shock Records in Australia.\nShe performed 'Tower of Song' and 'The Traitor' at the Cohen tribute concert which became the film and album Leonard Cohen: I'm Your Man. (wikipedia)\n\n- - -\n\nMartha Wainwright - I Know You're Married But I've Got Feelings Too 2008\n(Drowned in Sound Recordings V2 Records)\n\n 1. Bleeding All over You\n 2. You Cheated Me\n 3. Jesus and Mary\n 4. Comin' Tonight\n 5. Tower Song\n 6. Hearts Club Band\n 7. So Many Friends\n 8. In the Middle of the Night\n 9. The George Song\n10. Niger River\n11. Jimi\n12. See Emily Play\n13. I Wish I Were\n","torrent":{"xt":"urn:btih:467a7498bef6cba13af49a6c651b340ef30eff3e","amp;dn":"Martha+Wainwright+-+I+Know+You%5C%27re+Married+But+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"467a7498bef6cba13af49a6c651b340ef30eff3e","infoHashBuffer":{"type":"Buffer","data":[70,122,116,152,190,246,203,161,58,244,154,108,101,27,52,14,243,14,255,62]},"announce":[],"urlList":[]}}