{"title":"War.Horse.2011.CS.NL.ES.HU.MS.PT.RO.SW.Subtitles","uid":7022951,"size":3207394834,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46d5cecb1bb31697472495de9de4220ad215b36d&amp;dn=War.Horse.2011.CS.NL.ES.HU.MS.PT.RO.SW.Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jpsnetccs","files":4,"time":1328906640,"description":"Del director Steven Spielberg llega WAR HORSE (CABALLO DE BATALLA), una ÃƒÂ©pica aventura para espectadores de todas las edades. Ambientada en la Inglaterra rural y Europa durante la Primera Guerra Mundial, WAR HORSE (CABALLO DE BATALLA) comienza con el relato de la extraordinaria amistad entre un caballo llamado Joey y un joven muchacho, Albert, encargado de domesticarlo y entrenarlo. Cuando ambos son apartados a la fuerza, la pelÃƒÂ­cula sigue el viaje del animal a travÃƒÂ©s de territorios en guerra, que irÃƒÂ¡ modificando e inspirando la vida de todas los personajes que conoce a su paso -la caballerÃƒÂ­a britÃƒÂ¡nica, los soldados alemanes y hasta un granjero francÃƒÂ©s y su nieta- antes de que la historia alcance su emotivo clÃƒÂ­max, en el corazÃƒÂ³n de una tierra de nadie. La Primera Guerra Mundial es magistralmente retratada a travÃƒÂ©s de la travesÃƒÂ­a del animal, una odisea de gozo y penas, de profundo afecto y de gran aventura. WAR HORSE (CABALLO DE BATALLA) es una de las mÃƒÂ¡s grandiosas historias de amistad en tiempos de guerra; exitosa novela, la obra fue adaptada para teatro y alcanzÃƒÂ³ un enorme ÃƒÂ©xito a nivel internacional en Londres. TambiÃƒÂ©n llegarÃƒÂ¡ en 2012 al circuito teatral de Broadway, en Nueva York. En la pantalla grande se la verÃƒÂ¡ en una ÃƒÂ©pica adaptaciÃƒÂ³n, realizada por uno de los mÃƒÂ¡s grandes directores de la historia del cine.","torrent":{"xt":"urn:btih:46d5cecb1bb31697472495de9de4220ad215b36d","amp;dn":"War.Horse.2011.CS.NL.ES.HU.MS.PT.RO.SW.Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46d5cecb1bb31697472495de9de4220ad215b36d","infoHashBuffer":{"type":"Buffer","data":[70,213,206,203,27,179,22,151,71,36,149,222,157,228,34,10,210,21,179,109]},"announce":[],"urlList":[]}}