{"title":"The Simpsons - Season 6 - Audio Commentary - DVDRip - AAC","uid":7415141,"size":322675505,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:47315f53f711a63fdddc086e56413ca37ba4aca7&amp;dn=The+Simpsons+-+Season+6+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"schleicher","files":26,"time":1341493585,"description":"'Round Springfield (2F32) (Audio Commentary by Al Jean, Mike Reiss, Joshua Sternin, Jeffrey Ventimilia and Steven Dean Moore)\n\nA Star Is Burns (2F31) (Audio Commentary by James L. Brooks, Al Jean, Mike Reiss, Ken Keeler, Dan Castellaneta, Jon Lovitz and Susie Dietter)\n\nAnd Maggie Makes Three (2F10) (Audio Commentary by Matt Groening, David Mirkin, Swinton O. Scott III. and David Silverman)\n\nAnother Simpsons Clip Show (2F33) (Audio Commentary by Matt Groening, David Mirkin and David Silverman)\n\nBart of Darkness (1F22) (Audio Commentary by Matt Groening, David Mirkin, Jim Reardon, David X. Cohen, Greg Daniels and David Silverman)\n\nBart vs. Australia (2F13) (Audio Commentary by Matt Groening, Bill Oakley, Josh Weinstein and Wes Archer)\n\nBart's Comet (2F11) (Audio Commentary by Matt Groening, David Mirkin, Dan Castellaneta, Yeardley Smith and Bob Anderson)\n\nBart's Girlfriend (2F04) (Audio Commentary by Matt Groening, David Mirkin, Jonathan Collier, Julie Kavner, Susie Dietter and David Silverman)\n\nFear of Flying (2F08) (Audio Commentary by Matt Groening, David Mirkin and Mark Kirkland)\n\nGrampa vs. Sexual Inadequacy (2F07) (Audio Commentary by Matt Groening, Bill Oakley, Josh Weinstein and Wes Archer)\n\nHomer - Bad Man (2F06) (Audio Commentary by Matt Groening, David Mirkin, Greg Daniels, Julie Kavner, Jeff Lynch and David Silverman)\n\nHomer the Great (2F09) (Audio Commentary by Matt Groening, David Mirkin, Dan Castellaneta and Yeardley Smith)\n\nHomer vs. Patty and Selma (2F14) (Audio Commentary by Matt Groening, David Mirkin, Mark Kirkland and David Silverman)\n\nHomie the Clown (2F12) (Audio Commentary by Matt Groening, David Mirkin, Mark Kirkland and David Silverman)\n\nItchy &amp; Scratchy Land (2F01) (Audio Commentary by Matt Groening, David Mirkin, Dan Castellaneta, Yeardley Smith and Wes Archer)\n\nLemon of Troy (2F22) (Audio Commentary by Matt Groening, David Mirkin, Jim Reardon, Greg Daniels, David X. Cohen and David Silverman)\n\nLisa on Ice (2F05) (Audio Commentary by Matt Groening, David Mirkin, Mike Scully and Bob Anderson)\n\nLisa's Rival (1F17) (Audio Commentary by Matt Groening, David Mirkin, Mike Scully, Dan Castellaneta, Yeardley Smith and Mark Kirkland)\n\nLisa's Wedding (2F15) (Audio Commentary by James L. Brooks, David Mirkin and Greg Daniels)\n\nSideshow Bob Roberts (2F02) (Audio Commentary by Matt Groening, David Mirkin, Bill Oakley, Josh Weinstein and Mark Kirkland)\n\nThe PTA Disbands (2F19) (Audio Commentary by Matt Groening, David Mirkin, Swinton O. Scott III. and David Silverman)\n\nThe Springfield Connection (2F21) (Audio Commentary by Matt Groening, David Mirkin, Jonathan Collier, Dan Castellaneta, Yeardley Smith and Mark Kirkland)\n\nTreehouse of Horror V (2F03) (Audio Commentary by Matt Groening, David Mirkin, David X. Cohen, Greg Daniels and Jim Reardon)\n\nTwo Dozen and One Greyhounds (2F18) (Audio Commentary by Matt Groening, David Mirkin, Mike Scully and Bob Anderson)\n\nWho Shot Mr. Burns (Part One) (2F16) (Audio Commentary by David Mirkin, Bill Oakley, Josh Weinstein and Jeff Lynch)","torrent":{"xt":"urn:btih:47315f53f711a63fdddc086e56413ca37ba4aca7","amp;dn":"The+Simpsons+-+Season+6+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47315f53f711a63fdddc086e56413ca37ba4aca7","infoHashBuffer":{"type":"Buffer","data":[71,49,95,83,247,17,166,63,221,220,8,110,86,65,60,163,123,164,172,167]},"announce":[],"urlList":[]}}