{"title":"Open Design - New Paths - Expanded Spell-Less Ranger","uid":8645735,"size":5464861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47a2caf3a7a82859abea8150c9c63f1767d83f10&amp;dn=Open+Design+-+New+Paths+-+Expanded+Spell-Less+Ranger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Malkira","files":1,"time":1372980905,"description":"Aragorn Didn't Cast Spells!\n\nJust because some designer thought rangers should be spell-slingers doesn't make it right! With The Expanded Spell-Less Ranger, you can now play an authentic ranger without spells, but with great new abilities.\n\nWelcome to the Expanded Spell-Less Ranger, a base class for the Pathfinder RPG that was first presented in Kobold Quarterly #11 and which reviewers called a &quot;must-read&quot; at RPG Geek.\n\nThe removal of spells makes this a true ranger-type, but the new powers and expanded abilities mean that the Spell-Less Ranger can hold his own in a fight. With new animal companion options and Ranger Talents, this class covers the hunter's bond, fast movement, expanded tracking, hunting, additional favored enemies, trap handling, and much more, all in keeping with the ranger you know from The Lord of the Rings.\n\nThe Expanded Spell-less Ranger includes much new material beyond the original magazine version, such as two new archetypes for the companion-bound ranger and the dual-style ranger, plus new feats specific to this ranger that make them masters of their terrain. Includes a full 20-level character progression plus tracking sheets for favored terrain, enemies, and companions.\n\nBe a real ranger! Get The Expanded Spell-Less Ranger today!","torrent":{"xt":"urn:btih:47a2caf3a7a82859abea8150c9c63f1767d83f10","amp;dn":"Open+Design+-+New+Paths+-+Expanded+Spell-Less+Ranger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47a2caf3a7a82859abea8150c9c63f1767d83f10","infoHashBuffer":{"type":"Buffer","data":[71,162,202,243,167,168,40,89,171,234,129,80,201,198,63,23,103,216,63,16]},"announce":[],"urlList":[]}}