{"title":"Impellitteri - Power Station DVD","uid":10398565,"size":2219503616,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:48e25f99583b9d94cd6631f62c7cbeff931cf88b&amp;dn=Impellitteri+-+Power+Station+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flyfisher61","files":8,"time":1403313192,"description":"Chris Impellitteri is one of those metal guitar heroes that one might expect to find on the Shrapnel Records roster. His style has often been favorably compared to Yngwie Malmsteen, and with good reason, as both are neo-classical speed/shred guitarists of the highest order. Chris is a little less flashy (but only a little), though he's arguably a better songwriter, as his tunes tend to be less self-indulgent than Yngwie's. Impellitteri the band plays uptempo, mainstream speed metal, the kind of stuff that is quite popular in Europe these days, with Chris' flashy licks and solos complemented by the forceful vocals of Rob Rock (Graham Bonnet, another accomplished vocalist, has sung with this band as well). A fair comparison style-wise might be Racer X, or (particularly the earlier work) a more speed-metal version of Rainbow. The basic style has scarcely altered from day one, as the various albums are pretty interchangeable (minus points for lack of variety, plus points for consistent quality). Impellitteri is hardly a contemporary/modern metal band in style terms (this style was much more in vogue in the 80's), but Chris' virtuoso playing and general professionalism keep the band fresh.","torrent":{"xt":"urn:btih:48e25f99583b9d94cd6631f62c7cbeff931cf88b","amp;dn":"Impellitteri+-+Power+Station+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48e25f99583b9d94cd6631f62c7cbeff931cf88b","infoHashBuffer":{"type":"Buffer","data":[72,226,95,153,88,59,157,148,205,102,49,246,44,124,190,255,147,28,248,139]},"announce":[],"urlList":[]}}