{"title":"PBS THE DINOSAURS Flesh on the Bones 2 of 4.mpg","uid":8800613,"size":3547973632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:494209b851303c3660c118599e30846b7d6b58a2&amp;dn=PBS+THE+DINOSAURS+Flesh+on+the+Bones+2+of+4.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DinoLuigi","files":1,"time":1376191196,"description":"The Dinosaurs!\n\nFLESH ON THE BONES\n\nFlesh on the Bones invites you to solve a fascinating mystery.  A mystery with clues scattered over 200 million years of history.  Where did dinosaurs live?  How fast did they move? And most intriguing of all, were they warm or cold-blooded? Find out what actually happened before the &quot;masters of the planet&quot; suddenly died.  Scientific detectives have dedicated their lives to solving these age-old mysteries.  The answers they've come up with will amaze you: a Triceratops could outrun a Tyrannosaur; the foot claws of one specimen indicate they used aggressive, warm-blooded hunting techniques; and to escape chilly Alaska, dinosaurs went south for the winter!  These and other discoveries make the dinosaur more fascinating than ever.\n\nDinosaurs may be extinct, but they keep coming back.  In THE DINOSAURS, discover startling facts and dramatic new theories that have revolutionized our understanding of these earth shakers-the largest, most ferocious animals to ever roam this planet.  Featuring Dr. John Ostrum, the paleontologist who inspired Michael Crichton to create Alan Grant, the main character of JURASSIC PARK, THE DINOSAURS! Sheds light on the truth about the lifestyles of dinosaurs.  Surprising new discoveries now show that dinosaurs were intensely active, fleet-footed hunters; devoted, child-rearing parents; and warm-blooded.\n\nDynamic on-location footage of prominent scientists as they unearth the latest discoveries, and exciting, innovative animation will help you develop an understanding of the beauty of these awesome and unique beasts.","torrent":{"xt":"urn:btih:494209b851303c3660c118599e30846b7d6b58a2","amp;dn":"PBS+THE+DINOSAURS+Flesh+on+the+Bones+2+of+4.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"494209b851303c3660c118599e30846b7d6b58a2","infoHashBuffer":{"type":"Buffer","data":[73,66,9,184,81,48,60,54,96,193,24,89,158,48,132,107,125,107,88,162]},"announce":[],"urlList":[]}}