{"title":"3D Minimalistic &amp; Interactive Narrative Pack 1","uid":10114413,"size":4678453333,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4c2afa1b67efabe5e79b11529367b27a08c9fbc1&amp;dn=3D+Minimalistic+%26amp%3B+Interactive+Narrative+Pack+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"noad1818","files":44,"time":1399566121,"description":"Hello all! \n\nI present you forty four freeware games that are very different from your average game. I would have included a lot more but at over four gigabyte it's already way more than I can handle upload wise. \n\nThis pack is for people who love games like &quot;Dear Esther&quot; or &quot;The Stanley Parable.&quot; Or &quot;Gone Home.&quot; Those types of games that are best described as just &quot;explorative&quot; and interactive visual novels or poetry, and works of art in the forms of video games. \n\nAll of these games are freeware, but it would have taken you quite awhile to hunt them all down yourself, even using YouTube indie gaming channels as a source. This pack will contain many gems for a gamer that likes the three games I mentioned above. There are going to be games you don't care for, no doubt as not everything is a masterpiece and you have to keep in mind these are freeware. Nevertheless a lot of these are really good! \n\nThere are a range of games. From voice acting ones, to horror, and even games that are just complete wacky and make you feel like you're on LSD. It's hard to describe them all at once really. \n\nAs far as what kind of computer you'll need to run them all. It varies but I would say if you could run The Stanley Parable at decent settings you'll be just fine. And I'm assuming you've played that if you're downloading this pack. But just a 512mb GPU, basic dual core 2-4gb of ram would do fine. These games aren't *that* intense. \n\nAnyway enjoy the games and please, Please, PLEASE SEED BACK!! I have really slow crappy internet and don't even know if my client is configured correctly for uploading. I don't upload torrents for people so I don't know how this works. Please have a caring heart and seed back if I manage to upload it a few times. I beg of you. XD \n","torrent":{"xt":"urn:btih:4c2afa1b67efabe5e79b11529367b27a08c9fbc1","amp;dn":"3D+Minimalistic+%26amp%3B+Interactive+Narrative+Pack+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c2afa1b67efabe5e79b11529367b27a08c9fbc1","infoHashBuffer":{"type":"Buffer","data":[76,42,250,27,103,239,171,229,231,155,17,82,147,103,178,122,8,201,251,193]},"announce":[],"urlList":[]}}