{"title":"Tom Russell - Blood and Candle Smoke [2009] [EAC/FLAC]","uid":10441060,"size":375047151,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4c634f85c49f5410bd021a2bbad66bcf83b4f24c&amp;dn=Tom+Russell+-+Blood+and+Candle+Smoke+%5B2009%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1403890502,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Proper Records #PRPCD 049\nCountry: USA\nYear: September 18, 2009\nGenre: Americana\nFormat: CD, Album,\n\n[b]\n\n1\tEast of Woodstock, West of Viet Nam 4:25\n2\tSanta Ana Wind 4:08\n3\tNina Simone 5:22\n4\tCriminology 5:23\n5\tCrosses of San Carlos 6:13\n6\tFinding You 3:18\n7\tMississippi River Runnin' Backwards 4:24\n8\tThe Most Dangerous Woman in America 6:22\n9\tDon't Look Down 5:21\n10\tGuadalupe 6:05\n11\tAmerican Rivers 6:16\n12\tDarkness Visible 3:23\n\n\n\nOn 19 previous albums, songwriter Tom Russell has told stories about secret histories and compelling, desperate characters along the way. He's written about William Faulkner in Hollywood, the camps at Manzanar, a prisoner in Washington State whose cellmate was Little Willie John, and name-checked -- without artifice -- everyone from to Archie Moore to Charles Bukowski. On 2006's Love and Fear, the songs began to change shape. &quot;The Pugilist at 59,&quot; &quot;Beautiful Trouble,&quot; &quot;Stealing Electricity,&quot; and &quot;Ash Wednesday&quot; transcended his usual tropes; they were darker, more vulnerable and tautly confessional and poetic. Here, on Blood and Candle Smoke, he's perfected this method of songwriting and learned to record in a completely new way, to boot.\nCo-produced with Craig Schumacher, and cut at Wave Lab Studios in Tucson with members of Calexico and others, it sounds like nothing else in his catalog. Russell played his guitar and sang live with the band, providing little direction and allowing the musicians to open up a natural space around him. Instrumentally, this collaboration employs everything from mariachi and jazz horn sections, reverbed electric guitars, organic acoustics, and miniscule drum kits to hand percussion, marimbas, accordions, talking drums, Vox organs, and Rhodes pianos. The backing and duet vocals by songwriter Gretchen Peters add warmth, depth, dimension, and presence to Russell's songs.\nYet, as is always the case with Russell's records, it's the songs; and on this set, they are so inspired and strikingly visual that they reach a place beyond his own margins. The opener, &quot;East of Woodstock, West of Viet Nam,&quot; is one of a couple of tracks here that are uncharacteristically honest and open. The normally cagey Russell sings candidly of his experiences in Africa in the late '60s. The singalong feel in the refrain only adds to his story. Peters' backing vocal on top of the mariachi trumpet and guitars gives it an anthemic feel. &quot;Criminology&quot; melds West African highlife, reggae, and a Bo Diddley shuffle, and reveals more of his sometimes-harrowing, life-enriching incidents in Nigeria and in Canada, including getting guns pointed in his face by motel clerks quoting e.e. cummings, playing music with Sir Victor Uwaifo, being arrested by the Ton Ton Macoutes for taking pictures, and other escapades. There are gorgeous love songs such as &quot;Finding You,&quot; tough homages to &quot;Nina Simone&quot; and Joan Didion; the &quot;Santa Ana Winds,&quot; and Mother Jones -- &quot;The Most Dangerous Woman in America.&quot; There are lonesome travelogues through many places in the forgotten, displaced, or historically erased America of myth, mania, and magic including New Orleans after Katrina (&quot;Mississippi River's Runnin' Backwards.&quot;) There are also a few songs such as &quot;Crosses of San Carlos,&quot; &quot;Guadalupe,&quot; and &quot;American Rivers&quot; that in their wide-open, spacious Western feel report the pride, history, and plight of the North American Indians.\nMusically, this set is all over the place: folk, country, rock, desert blues, New Orleans-inspired jazz, waltzes, and early Sunday morning sidewalk-gospel shimmer, all seamlessly melded together in wildly various, irresistible, intoxicating ways. It's roots music whose limbs are so knotted and twisted they are inseparable. Blood and Candle Smoke is unlike anything in Russell's catalog. It is his most musically ambitious, lyrically sophisticated album. He's become a novelist in song, but offers his tomes with a medicine show pitchman's sense of phrasing. While he tell stories that are unlikely and sometimes larger than life, they are, without question, truths worth investigating, chuckling at, and meditating upon. Blood and Candle Smoke is the perfect vehicle to introduce him anew to those who never knew he existed. After nearly 40 years in the business, who thought this even possible?\n","torrent":{"xt":"urn:btih:4c634f85c49f5410bd021a2bbad66bcf83b4f24c","amp;dn":"Tom+Russell+-+Blood+and+Candle+Smoke+%5B2009%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c634f85c49f5410bd021a2bbad66bcf83b4f24c","infoHashBuffer":{"type":"Buffer","data":[76,99,79,133,196,159,84,16,189,2,26,43,186,214,107,207,131,180,242,76]},"announce":[],"urlList":[]}}