{"title":"UDEMY HORSE RACE BETTING HOW TO LAY FAVORITES AND MAKE MONEY TUT","uid":12018794,"size":342844564,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4c8921563d44b522f3f0e29de44b3f92d4d449b2&amp;dn=UDEMY+HORSE+RACE+BETTING+HOW+TO+LAY+FAVORITES+AND+MAKE+MONEY+TUT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RandalPaul","files":20,"time":1434368099,"description":"\nCourse Description\n\nHorse racing is a marvellous sport and one enjoyed by zillions of people. Considered a game of skill, some of us follow horse racing for the sheer thrill of it but for most people it is all about the betting.\n\nHorse race betting is not as complicated as some people would want you to believe. With the advent of online betting exchanges you can also take on the role of a bookmaker by lay betting - betting that a horse won't win the race!\n\nIn this course, we'll teach you all the basics you need to know about horse race betting and provide a step-by-step guide to identify false favourites to lay and make money. This strategy will involve using an online betting exchange for UK Horse Races.\n\n\nWhat are the requirements?\n\n* Students should know how to read and analyse UK horse race data either online or via daily newspapers (if in UK)\n\nWhat am I going to get from this course?\n\n* Over 18 lectures and 40 mins of content!\n* Understand the terminology used in horse race betting\n* Use a proven strategy to lay favourite horses at the right prices and win\n\nWhat is the target audience?\n\n* This course is meant for people who have attained a legal age for betting and who have a basic understanding of horse race betting\n* People should be able to read and understand horse race cards\n* This course is NOT for citizens of countries where online betting is illegal or have not attained the legal age for betting as per the law of the land","torrent":{"xt":"urn:btih:4c8921563d44b522f3f0e29de44b3f92d4d449b2","amp;dn":"UDEMY+HORSE+RACE+BETTING+HOW+TO+LAY+FAVORITES+AND+MAKE+MONEY+TUT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c8921563d44b522f3f0e29de44b3f92d4d449b2","infoHashBuffer":{"type":"Buffer","data":[76,137,33,86,61,68,181,34,243,240,226,157,228,75,63,146,212,212,73,178]},"announce":[],"urlList":[]}}