{"title":"NINO ROTA - THE SYMPHONIC FELLINI[TNTVILLAGE]","uid":5259885,"size":99636487,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4c91677d70ee8b89ec667eb7530dd4a1541248f2&amp;dn=NINO+ROTA+-+THE+SYMPHONIC+FELLINI%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"carlosjrincon","files":17,"time":1262701422,"description":"[b][color=blue] FELLINI ROTA[/COLOR]\n\n[color=red]THE SYMPHONIC FELLINI ROTA[/color][/b]\n\n[b][color=green]::-&gt;Cover&lt;-::[/b][/color]\n\n[IMG]http://img341.imageshack.us/img341/9774/symphonicfellinrotarc4.jpg[/IMG]\n\n[b][color=green]::-&gt;Dati Album&lt;-::[/color][/b]\n\n[b]Titolo:[/b] The Symphonic Fellini Rota\n[b]Data Uscita:[/b] 16/12/1993\n[b]Genere:[/b] Colonna Sonora\n[b]Etichetta:[/b] Silva America\n[b]Durata:[/b] 68'56\n\n[b][color=green]::-&gt;Tracklist&lt;-::[/color][/b]\n\n1. Lo Sceicco Bianco (The White Sheikh) \t\n2. I Vitelloni \t\n3. La Strada \t\n4. Il Bidone (The Swindle) \t\n5. Le Notte Di Cabiria (The Nights Of Cabiria) \t\n6. La Dolce Vita \t\t\n7. Boccacio \t\t\n8. Otto E Mezzo (8 1/2) \t\t\n9. Giulietta Degli Spiriti (Juliet Of The Spirits) \t\t\n10. Fellini Satyricon \t\t\n11. I Clowns (The Clowns) \t\t\n12. Roma \t\t\n13. Amarcord \t\t\n14. Il Casanova (Casanova) \t\t\n15. Prova D'Orchestra (Orchestra Rehearsal)\n \n[b][color=green]::-&gt;Biografia&lt;-::[/color][/b]\n\nNato da una famiglia di musicisti, inizia a studiare pianoforte con la madre, la pianista Ernesta Rinaldi. Prende le prime lezioni di composizione da Giacomo \n\nOrefice e Ildebrando Pizzetti e all'etÃƒÂ  di otto anni inizia a comporre.\n\nEntrato al Conservatorio di Milano nel 1923, ÃƒÂ¨ stato allievo di Paolo Delachi e Giulio Bas. Nel 1922 compone L'infanzia di S. Giovanni Battista un oratorio \n\nper soli, coro e orchestra scritto a quasi undici anni ed eseguito nello stesso anno a Milano e l'anno successivo a Turcoing, in Francia; in occasione della \n\nesecuzione francese, chiamato alla ribalta dal pubblico entusiasta ne diresse la replica del finale. Nel 1926 Nino Rota scrive Il Principe Porcaro, \n\nun'operina per ragazzi ispirata ad una fiaba di Hans Christian Andersen. Tre quarti d'ora di una musica che, considerata l'etÃƒÂ  del compositore, ÃƒÂ¨ giudicata \n\ndai critici giÃƒÂ  matura, senza sbavature, intensa e al tempo stesso ironica. Di questo lavoro rimane superstite presso l'Archivio Rota della Fondazione \n\nGiorgio Cini di Venezia soltanto lo spartito per canto e piano (nel 2003 ha provveduto ad orchestrarlo, su commissione del Teatro La Fenice di Venezia, il \n\ncompositore barese Nicola Scardicchio, discepolo di Rota e revisore ufficiale di tutte le sue opere).\n\nSuccessivamente Nino Rota studia privatamente con Alfredo Casella a Roma, conseguendo il diploma in composizione al Conservatorio di Santa Cecilia nel 1930.\n\nNel 1930 si reca negli Stati Uniti incoraggiato dal direttore Arturo Toscanini, e vi rimane due anni, per alcuni corsi di perfezionamento vincendo una borsa \n\ndi studio al Curtis Institute di Philadelphia. Qui lavora, tra gli altri per Fritz Reiner. Torna in patria per laurearsi in lettere all'UniversitÃƒÂ  degli \n\nstudi di Milano con una tesi dedicata al compositore Gioseffo Zarlino.\n\nNel 1937 insegna teoria e solfeggio al Liceo Musicale di Taranto, mentre due anni dopo passa al Conservatorio NiccolÃƒÂ² Piccinni di Bari, dove insegna armonia \n\ne composizione; di quest'ultimo istituto diventa direttore nel 1950.\n\nDopo aver realizzato il suo primo accompagnamento musicale per il film ZazÃƒÂ  di Renato Castellani nel 1944, incontra, successivamente, Federico Fellini \n\nimpegnato a produrre Lo sceicco bianco. Da allora tra i due artisti si instaura un'amicizia lunga trent'anni e una collaborazione per numerosi film, ben 16 \n\ntra il 1951 e il 1979, tra i quali 8 e Ã‚Â½. Nel 1972 compose le musiche del film Il Padrino, perÃƒÂ² non fu ammesso alla corsa per il premio Oscar perchÃƒÂ© aveva \n\nutilizzato alcune musiche scritte giÃƒÂ  per il film Fortunella di Eduardo De Filippo. Due anni dopo, perÃƒÂ², riuscÃƒÂ¬ a vincere l'ambito premio con le musiche del \n\nfilm Il Padrino: Parte II. Il compositore muore poco dopo la fine delle registrazioni della sua ultima colonna sonora per Fellini, Prova d'orchestra.\n\nPur essendo conosciuto soprattutto per il suo lavoro nel mondo del cinema, Nino Rota ha composto anche per il teatro ed il balletto con notevole riscontro \n\ninternazionale.\n\n[b][color=green]::-&gt;Dati Tecnici&lt;-::[/color][/b]\n[color=red][b]\nMp3 256-320 Kbps\nLocandina allegata\n\n[/b][/color]\n\nTNTVILLAGE.SCAMBIOETICO.ORG\n","torrent":{"xt":"urn:btih:4c91677d70ee8b89ec667eb7530dd4a1541248f2","amp;dn":"NINO+ROTA+-+THE+SYMPHONIC+FELLINI%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c91677d70ee8b89ec667eb7530dd4a1541248f2","infoHashBuffer":{"type":"Buffer","data":[76,145,103,125,112,238,139,137,236,102,126,183,83,13,212,161,84,18,72,242]},"announce":[],"urlList":[]}}