{"title":"CRADLE OF FILTH - Discography 1992 - 2014    cybr_blly","uid":10195049,"size":5438403153,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d183ab1b0dab01ee0c2d8bef5b6bee21f165362&amp;dn=CRADLE+OF+FILTH+-+Discography+1992+-+2014++++cybr_blly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybr_blly","files":473,"time":1400683361,"description":" As far as I can tell this is the most complete Cradle torrent around. There are a lot of gems in here.\n\nThanks to cookiemonster, justinmetal88 and rustyjerk and anyone else I got music from.\nAnd a major shout out to You really need to check out this dude's blog. He has links to zip files of SOOOOOOOOOOOO much 90's metal. That's where I got all of the old goodies from.\n\nSome of the singles and compilations are redundant. You decide if you wanna DL everything. \nFor example all of the singles are on other releases except Her Ghost in the Fog. \nEarly demos are at the end of a few live bootlegs. \n11 Burial Masses is the same exact concert as Live Bait, minus the bonus CD. The bonus DVD for Thornography is Harder, Darker Faster. \nThe Unmixed LP is Spattered in Faeces which is better on TFD. The entire 1993 Rehearsal and bootleg TFD are on the official TFD release. Life is better with exotic marijuana. Devil Mayfair is This Fetid Dank Oasis.\n\nA Pungent and Sexual Miasma is the complete Cradle portion that wasn't on my other torrent. The songs I added are already on Invoking and Orgiastic.\n\nI didn't include Lycanthrophy because it's some fan made, remix BS.\n\nI left the Black Goddess Rises Demo for completist's but I'm pretty sure this is a fan made tape too. Every version of this demo I've heard has the studio version of Dawn of Eternity. The other songs on it are clearly from the other demos. I think some asshole heard APASM, didn't know what it was, and dreamt up TBGR demo. Someone needs to get to the bottom of this shit.\n\nManticore Extended Claws is missing the demo for Unveiling of O. If someone has it, help us out. I deleted it a while ago. Oops.\n\nMidnight in the Labyrinth is horrible and it's hardly a COF album but I included it anyway. Most of you have this already and never listen to it, you are not alone.\n\nSome of the early demos, the promo and all of the early live boots sound like shit.\n\n\nPeace Through Superior Firepower and Rock AM Ring were taken from youtube if you wanna skip it. They were the only setlists I could complete.\nI know a lot of people taking songs from youtube but I can't find these anywhere else. (I'm not buying Peace Through Superior Firepower just to convert it.) \nThere are actually a lot of rare gems on youtube [like Freezing Moon from Manchester 93 (?)] if you look and don't mind the quality. \n\nThe random folder is all from youtube. With the exception of Dinner at Deviants Palace and Midnight Shadows which I reversed myself.  I think that the Live 1992 Instrumental is the middle part of TBGR, when Dani repeats, &quot;Come with me, come with me, Black Goddess rise.&quot;\n\n\nIf anyone has better copies of any of these songs please share them.\nIf a Shat Out of Hell demo actually exists, someone please share it.\nIf anyone gets the Unveiling of O demo, please share it.\nIf anyone knows of any actual bootleg soundboards, please inform me.\nIf anyone's favorite song is Nymphetamine or The Death of Love, you probably have a vagina.\n\nI really could ramble on all day...\n","torrent":{"xt":"urn:btih:4d183ab1b0dab01ee0c2d8bef5b6bee21f165362","amp;dn":"CRADLE+OF+FILTH+-+Discography+1992+-+2014++++cybr_blly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d183ab1b0dab01ee0c2d8bef5b6bee21f165362","infoHashBuffer":{"type":"Buffer","data":[77,24,58,177,176,218,176,30,224,194,216,190,245,182,190,226,31,22,83,98]},"announce":[],"urlList":[]}}