{"title":"Ebook: Fundamentals of Transportation","uid":5945703,"size":8739223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d274e8079611d8cc72ad35badc952e530f7be29&amp;dn=Ebook%3A+Fundamentals+of+Transportation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freehist2","files":1,"time":1289352474,"description":"see: \n &lt;a href=&quot;\nhttp://en.wikibooks.org/wiki/Fundamentals_of_Transportation&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikibooks.org/wiki/Fundamentals_of_Transportation&lt;/a&gt;\n\nFundamentals of Transportation/About\n\nFrom Wikibooks, the open-content textbooks collection\n\n\n\nThis book is aimed at undergraduate civil engineering students, though the material may provide a useful review for practitioners and graduate students in transportation. Typically, this would be for an Introduction to Transportation course, which might be taken by most students in their sophomore or junior year. Often this is the first engineering course students take, which requires a switch in thinking from simply solving given problems to formulating the problem mathematically before solving it, i.e. from straight-forward calculation often found in undergraduate Calculus to vaguer word problems more reflective of the real world.\n\n\n\n\nThe plot of this textbook can be thought of as \\&quot;How an idea becomes a road\\&quot;. The book begins with the generation of ideas. This is followed by the analysis of ideas, first determining the origin and destination of a transportation facility (usually a road), then the required width of the facility to accommodate demand, and finally the design of the road in terms of curvature. As such the book is divided into three main parts: planning, operations, and design, which correspond to the three main sets of practitioners within the transportation engineering community: transportation planners, traffic engineers, and highway engineers. Other topics, such as pavement design, and bridge design, are beyond the scope of this work. Similarly transit operations and railway engineering are also large topics beyond the scope of this book.\n\n\n","torrent":{"xt":"urn:btih:4d274e8079611d8cc72ad35badc952e530f7be29","amp;dn":"Ebook%3A+Fundamentals+of+Transportation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d274e8079611d8cc72ad35badc952e530f7be29","infoHashBuffer":{"type":"Buffer","data":[77,39,78,128,121,97,29,140,199,42,211,91,173,201,82,229,48,247,190,41]},"announce":[],"urlList":[]}}