{"title":"Democracy Now - 19 oct 2011","uid":6756710,"size":453554529,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4d308e730d860dcb3be197bfa1a7ddde7866e94e&amp;dn=Democracy+Now+-+19+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1319058949,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 19, 2011\n\n- Clinton Visits Libya; NATO Reduces Sorties\n- Yemeni Forces Kill 7 Protesters\n- Nobel Laureate Tawakkul Karman Calls for International Sanctions on Saleh Regime\n- Slain U.S. Drone Victim Was 16\n- Turkish Troops Enter Iraq After Kurdish Attack\n- U.S. Deportations Hit Record; Report Finds Immigration Program Disproportionately Targeting Latinos\n- Cain Defends Tax Plan, Occupy Wall Street Comments at GOP Debate\n- U.N. Torture Chief: Ban Solitary Confinement for Teens, Mentally Disabled\n- Occupy Wall Street Protesters Rally Against Arrests, Charges\n\n\nSpecial reports\n\n- Former Financial Regulator William Black: Occupy Wall Street a Counter to White-Collar Fraud\n\nBroadcasting on the road from Kansas City, Missouri, we're joined by William Black, a white-collar criminologist, former financial regulator, and author of &quot;The Best Way to Rob a Bank is to Own One.&quot; Black teaches economics and law at the University of Missouri-Kansas City and recently took part in Occupy Kansas City. &quot;If you look [at the Occupy protests], not just nationwide, but worldwide, you will see some pretty consistent themes developing,&quot; Black says. &quot;Those themes include: we have to deal with the systemically dangerous institutions, the 20 biggest banks that the administration is saying are ticking time bombs, that as soon as one of them fails, we go back into a global crisis. We should fix that. There's no reason to have institutions that large. That's a theme. That accountability is a theme, that we should put these felons in prison... That we should get jobs now, and that we should deal with the foreclosure crisis. So those are four very common themes that you can see in virtually any of these protest sites... I think, over time, you won't necessarily have some grand written agenda, but you'll have, as I say, increasing consensus. And it's a very broad consensus.&quot;\n\n\n- Colleagues of Slain Kansas Abortion Doctor George Tiller Continue His Fight for Reproductive Rights\n\nA federal judge has blocked the impact of one of the laws aimed at defunding Planned Parenthood, ordering Kansas to restore federal family planning funds to a clinic that claims it suffered &quot;collateral damage&quot; from the law because it would be forced to close, leaving 650 mostly low-income patients without access to reproductive healthcare services. Planned Parenthood of Kansas and Mid-Missouri, and the unaffiliated Dodge City clinic, are challenging a law requiring the state to first allocate Title X funds to public health departments and hospitals, which leaves no funds for specialty family planning clinics. This is just the latest development in Kansas, which saw the murder of one of its staunchest supporters of women's access to abortion: Dr. George Tiller. For more, we are joined by Julie Burkhart, who worked for eight years with Tiller before he was killed in 2009. She is the founder and director of the Trust Women Foundation and PAC, which focuses on protecting women's access to reproductive healthcare, as well as the rights of the physicians who provide these services.\n\n\n- Amidst Soaring Poverty, New MLK Monument Should Be Seen as &quot;Testament to [His] Unfinished Work&quot;\n\nA new report by the University of New Hampshire reveals that nearly 22 percent of America's children live in poverty. Another study by the the Pew Hispanic Center found that Hispanics now make up the largest group of children living in poverty: 6.1 million Hispanic children are poor, compared with five million non-Hispanic white children and 4.4 million black children. The Pew Center said Hispanic poverty numbers have dramatically increased because of the impact of the recession on the growing number of Latinos. On the heels of this week's unveiling of the new memorial to Dr. Rev. Martin Luther King, Jr., on the National Mall, we speak with Lewis Diuguid of the Kansas City Star who has written extensively on civil rights issues and the impoverished conditions of African Americans. Dr. King would &quot;look at America as being an unfinished work, as it has always been from the start, but particularly when it comes to people of color and when it comes to people who are poor,&quot; said Diuguid. &quot;We have a problem in the country when you see 46 million people are living in poverty, when you see 50 million people have no health insurance... The monument should stand as a testament to the unfinished work.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4d308e730d860dcb3be197bfa1a7ddde7866e94e","amp;dn":"Democracy+Now+-+19+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d308e730d860dcb3be197bfa1a7ddde7866e94e","infoHashBuffer":{"type":"Buffer","data":[77,48,142,115,13,134,13,203,59,225,151,191,161,167,221,222,120,102,233,78]},"announce":[],"urlList":[]}}