{"title":"An Inquiry Into Science Education, Where the Rubber Meets Road -","uid":9677671,"size":715011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4de85b07ba5126a3e3cc67e8842c2634742ed5f2&amp;dn=An+Inquiry+Into+Science+Education%2C+Where+the+Rubber+Meets+Road+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AtomTPB","files":1,"time":1393594485,"description":"Pages: 140 pages\nPublished: 23 September 2011\nLanguage: English\nISBN-10: 9460916880\nISBN-13: 978-9460916885\nFormat: PDF\n\n\nAn inquiry into science education is an exploration into education in a context that is grounded and significant. It is written by a college professor of Physics and Science Education who spent sabbatical year as a full time science teacher in a neighborhood high school in a poor area of New York City. His varied experiences highlight the contrast of what science education is and what it can be. The framework through which the book is written is that science education should be an active, purposeful process which promotes functional understanding and critical thinking. Science learners should be given the opportunity to build an understanding of benchmark principals of science based on their own observations and reasoning. In much the same way, this book explores benchmark principals of science education through real classroom experiences. Standard approaches of teaching and assessment are presented and alternative opportunities are described. Theories and strategies of science education emerge from analysis of classroom observations. Although the focus is on the teaching and learning of science, the subtext is implications of a failing educational system and what can be done about it. The primary intended audience is educators of all capacities, but particularly science teachers. An inquiry into science education integrates critical topics of science education in a contextualized, accessible, and easy to read narrative. The secondary intended audience is non-fiction readers. This book examines educational issues relevant to a general audience from the perspective of a scientist with a focus on inquiry and reasoning. Critical issues are addressed through case histories, some with touches of humor, but all with insight into children and learning.","torrent":{"xt":"urn:btih:4de85b07ba5126a3e3cc67e8842c2634742ed5f2","amp;dn":"An+Inquiry+Into+Science+Education%2C+Where+the+Rubber+Meets+Road+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4de85b07ba5126a3e3cc67e8842c2634742ed5f2","infoHashBuffer":{"type":"Buffer","data":[77,232,91,7,186,81,38,163,227,204,103,232,132,44,38,52,116,46,213,242]},"announce":[],"urlList":[]}}