{"title":"A Tribute To Kraftwerk - Trans Slovenia Express TQMP","uid":4546154,"size":435227572,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4e593f3cc1383e1d2f7b52c4516c89dc51140642&amp;dn=A+Tribute+To+Kraftwerk+-+Trans+Slovenia+Express+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"zootallure","files":19,"time":1228090887,"description":"A tribute of Slovenian musicians, including Laibach, to Kraftwerk. The album is including 15 songs, remaked by  bands whcih started their career when Kraftwerk was born, to newcomers with their first recordings on this album. An interseting point of view of the music of a group that set standards in electronic music.\n\nKraftwerk, the pioneers of electronic music are well known to all music experts and lovers. They were setting the path, along with Jean Michel Jarre, on which many of the bands stepped in decades that followed after the beginning of 70's, when &quot;Power Plant&quot; (from german word Kraftwerk) powered up in Duesseldorf, Germany. Florian Schneider and Ralf HÃƒÆ’Ã‚Â¼tter, the band founders, met  as students on Duesseldorf conservatory, participating to a German experimental music scene, which was dubbed as &quot;Krautrock&quot;.\nThe duo performed together in a quintet called Organistaion, then in, following years, set up their own studio,  which later became known as &quot;Kling Klang&quot;. The line ups of the group changed a lot until 1975, when Wolfgang FlÃƒÆ’Ã‚Â¼r and Karl Bartos joined the group for the Autobahn tour. This line up became a classic Kraftwerk one.\n\nThe band is notoriously reclusive; providing rare and enigmatic interviews, using life size mannequins and robots to conduct official photo shoots, refusing to accept mail and not allowing visitors at the Kling Klang Studio. Another notable example of this eccentric behavior was reported to Johnny Marr of The Smiths by Karl Bartos, who explained that anyone trying to contact the band for collaboration would be told the studio telephone did not have a ringer, since during recording, the band did not like to hear any kind of noise pollution. Instead, callers were instructed to phone the studio precisely at a certain time, whereupon the phone would be answered by Ralf HÃƒÆ’Ã‚Â¼tter, despite never hearing the phone ring. Chris Martin, lead singer of UK group Coldplay, anecdotally recalled, in a late 2007 article in Q about Kraftwerk, the process of requesting permission to sample the melody from the track &quot;Computer Love&quot; in its 2005 release &quot;Talk&quot; from its album X&amp;Y. He recalled writing them a letter and sending it through the lawyers of the respective parties and several weeks later receiving an envelope containing a handwritten reply that simply said 'yes'.\n\nThey started to tour again in 1990's, after years of withdrawal from live performances and, they are still touring nowadays. \n\nEnjoy!\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project  fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:  &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nYou can find all TQMP uploads at: www.thepiratebay.se  (Simply use the TQMP searchtag :)\n\n","torrent":{"xt":"urn:btih:4e593f3cc1383e1d2f7b52c4516c89dc51140642","amp;dn":"A+Tribute+To+Kraftwerk+-+Trans+Slovenia+Express+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e593f3cc1383e1d2f7b52c4516c89dc51140642","infoHashBuffer":{"type":"Buffer","data":[78,89,63,60,193,56,62,29,47,123,82,196,81,108,137,220,81,20,6,66]},"announce":[],"urlList":[]}}