{"title":"The Disorders Specialty Articles from the Encyclopedia of Mental","uid":12232301,"size":37374861,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f5f2920fe5ef94f80782f01a41da284861bd74f&amp;dn=The+Disorders+Specialty+Articles+from+the+Encyclopedia+of+Mental&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1439589854,"description":"Stupid fecking Torrent Name box wouldn't allow the full title so here it is......\n\nThe Disorders - Specialty Articles from the Encyclopedia of Mental Health - 1st Edition (2001).pdf Gooner\n\nPublisher: Academic Press; 1 edition (July 23, 2001)\nLanguage: English\nISBN-10: 0122678052\nISBN-13: 978-0122678059\n\nThe Disorders is a derivative volume of articles pulled from the award-winning Encyclopedia of Mental Health, providing A-to-Z coverage of the many disorders afflicting mental health patients, including alcohol problems, Alzheimer's disease, depression, epilepsy, gambling, obsessive-compulsive disorder, phobias, and suicide. \n\nAccording to 1990 estimates, mental disorders represent five of the ten leading causes of disability.* Among &quot;developed&quot; nations, including the United States, major depression is the leading cause of disability. Also near the top of these rankings are bipolar depression, alcohol dependence, schizophrenia, and obsessive-compulsive disorder. In addition, mental disorders are tragic contributors to mortality, with suicide perennially representing one of the leading preventable causes of death worldwide.\n\nThe Disorders presents a comprehensive overview of the disorders afflicting mental health patients. It describes the impact of mental health on the individual and society and illustrates the factors that aid positive mental health. Thirty-five peer-reviewed articles written by more than 50 expert authors include essential material on specific disorders affecting modern society. Professionals and libraries will find this timely work indispensable","torrent":{"xt":"urn:btih:4f5f2920fe5ef94f80782f01a41da284861bd74f","amp;dn":"The+Disorders+Specialty+Articles+from+the+Encyclopedia+of+Mental","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f5f2920fe5ef94f80782f01a41da284861bd74f","infoHashBuffer":{"type":"Buffer","data":[79,95,41,32,254,94,249,79,128,120,47,1,164,29,162,132,134,27,215,79]},"announce":[],"urlList":[]}}