{"title":"The Airborne Toxic Event - Such Hot Blood (2013) [FLAC]","uid":8420455,"size":266719877,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:50d249dafe9662cdf24a905c9e8fe40a58f8bfc0&amp;dn=The+Airborne+Toxic+Event+-+Such+Hot+Blood+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1367173202,"description":"\n  The Airborne Toxic Event - Such Hot Blood (2013) [FLAC]\n  \n  Released: 2013\n  Genre: Pop/Rock\n  Style: Alternative, Indie Rock\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 850 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 The Secret\n  02 Timeless\n  03 What's in a Name\n  04 The Storm\n  05 Safe\n  06 Bride &amp; Groom\n  07 True Love\n  08 This Is London\n  09 The Fifth Day\n  10 Elizabeth\n\n  After two albums of increasingly big indie rock, the Airborne Toxic Event take a little time to wander with their third album, Such Hot Blood. Working this time with producer Jacquire King, who has worked with artists like Dawes, Of Monsters and Men, and Tom Waits, the band make full use of his versatility, stepping away from the rhapsodic, Arcade Fire-inflected rock of their previous albums to try something a little smaller and more personal. On the country-inflected &quot;Bride &amp; Groom,&quot; it feels as if the band is going for something a little more earnest, evoking emotion from the listener through the song's narrative rather than strapping it to a rocket of strings and synths and shooting for the stars. \n\n  The problem is, shooting for the stars is really where the Airborne Toxic Event are at their best, so while songs like &quot;Timeless&quot; and &quot;The Fifth Day&quot; might feel like the band treading on old ground, it's when they have the time and space to really stretch out that they're able to get up to full speed. It's a tough thing for an artist to balance branching out with sticking to the tried and true formula, and while the band's excursions into uncharted waters provide listeners with some interesting findings, it breaks up the moodiness that bound their earlier work together. This makes Such Hot Blood an album that, while certainly containing some interesting moments, lacks the sense of atmosphere and cohesion possessed by their previous records.","torrent":{"xt":"urn:btih:50d249dafe9662cdf24a905c9e8fe40a58f8bfc0","amp;dn":"The+Airborne+Toxic+Event+-+Such+Hot+Blood+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50d249dafe9662cdf24a905c9e8fe40a58f8bfc0","infoHashBuffer":{"type":"Buffer","data":[80,210,73,218,254,150,98,205,242,74,144,92,158,143,228,10,88,248,191,192]},"announce":[],"urlList":[]}}