{"title":"Mastering (Advanced) Git - O'Reilly (2011 / 2012) [MP4]","uid":13694563,"size":3067436985,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:51ef8b9dfd735dfda981f092da0649a712f12596&amp;dn=Mastering+%28Advanced%29+Git+-+O%27Reilly+%282011+%2F+2012%29+%5BMP4%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"bey0nd","files":20,"time":1456663673,"description":"McCullough and Berglund on Mastering Git\r\n========================================\r\n\r\nLearn the Git version control system through visual examples and step-by-step explanations in this in-depth video course. Experts Matthew McCullough and Tim Berglund demonstrate how Git not only incorporates the best features of existing source control systems, but also includes unique distributed capabilities that make version control commands available without connectivity, allowing you to choose when to interact with a network.\r\n\r\nExplore the full spectrum of Git, from the foundations of how objects are hashed to the practical commands you need to be productive every day. Through live demos, you'll learn in detail how each of Git's new terms and commands works in practice, and discover how this unique distributed version control system compares to centralized systems such as Subversion. You'll also get workflow ideas and practical tips to help you get started most effectively with this revolutionary source code control system.\r\n\r\n\r\n\r\nMcCullough and Berglund on Mastering Advanced Git\r\n=================================================\r\n\r\nGo beyond the basics and take Git to a higher level of productivity. If you’re familiar with this popular distributed revision control system (DVCS), Mastering Advanced Git will help you leverage Git’s powerful yet underused advanced features.\r\n\r\nMany developers are anxious to learn more about Git’s more complex capabilities, but unfortunately, not much documentation on them is available. For the first time on video, advanced Git features are demonstrated in an easy-to-grasp form with the use case, operation, and behavior all thoroughly explained.\r\n \nhttp://shop.oreilly.com/product/0636920017462.do \nhttp://shop.oreilly.com/product/0636920024774.do","torrent":{"xt":"urn:btih:51ef8b9dfd735dfda981f092da0649a712f12596","amp;dn":"Mastering+%28Advanced%29+Git+-+O%27Reilly+%282011+%2F+2012%29+%5BMP4%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51ef8b9dfd735dfda981f092da0649a712f12596","infoHashBuffer":{"type":"Buffer","data":[81,239,139,157,253,115,93,253,169,129,240,146,218,6,73,167,18,241,37,150]},"announce":[],"urlList":[]}}