{"title":"How to Read Egyptian Hieropglyphs","uid":4748132,"size":155298754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51f1f964b67f3a94f66e94febefa319e394b5b1a&amp;dn=How+to+Read+Egyptian+Hieropglyphs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"VasiaZozulia","files":1,"time":1236004044,"description":"Hieroglyphs are pictures used as signs in writing. When standing before an ancient tablet in a museum or visiting an Egyptian monument, we marvel at this unique writing and puzzle over its meaning. Now, with the help of Egyptologists Mark Collier and Bill Manley, museum-goers, tourists, and armchair travelers alike can gain a basic knowledge of the language and culture of ancient Egypt.\nCollier and Manley's novel approach is informed by years of experience teaching Egyptian hieroglyphs to non-specialists. Using attractive drawings of actual inscriptions displayed in the British Museum, they concentrate on the kind of hieroglyphs readers might encounter in other collections, especially funerary writings and tomb scenes. Each chapter introduces a new aspect of hieroglyphic script or Middle Egyptian grammar and encourages acquisition of reading skills with practical exercises.\nThe texts offer insights into the daily experiences of their ancient authors and touch on topics ranging from pharaonic administration to family life to the Egyptian way of death. With this book as a guide, one can enjoy a whole new experience in understanding Egyptian art and artifacts around the world.\n\nYou need no previous experience reading hieroglyphs to benefit from this book. This is a hieroglyphs guide for the layperson, tourist, or museum enthusiast who'd like to have more of a clue when it comes to understanding Egyptian hieroglyphs. Focusing on the funerary symbols one would be likely to see in Egypt or at a museum, and illustrated with hieroglyphs that are on display in the British Museum (drawn by Richard Parkinson, curator in the Department of Egyptian Antiquities at the British Museum), How to Read Egyptian Hieroglyphs makes possible a deeper appreciation not just of museum displays but of the Egyptian culture that used this writing system.\n\nBoth experts in Egyptology (Collier teaches Egyptology at the University of Liverpool, and Manley teaches the subject at the University of Glasgow), they explain how most hieroglyphs are used to convey the sound of the ancient Egyptian language, then go on to teach, in easily digestible segments, the basic phonograms (sound-signs) used in inscriptions a traveler or museum-goer would be most likely to encounter. Each chapter teaches a new portion of hieroglyphic script and a new aspect of the Middle Egyptian grammar, with a section to practice the new reading skills and exercises to solidify the lessons taught. It provides a wonderful opportunity to sit at home and learn about the pharaonic administration, ancient Egyptian family life, and the Egyptian way of death, while building a firm understanding of the most common features of hieroglyphs. --Stephanie Gold","torrent":{"xt":"urn:btih:51f1f964b67f3a94f66e94febefa319e394b5b1a","amp;dn":"How+to+Read+Egyptian+Hieropglyphs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f1f964b67f3a94f66e94febefa319e394b5b1a","infoHashBuffer":{"type":"Buffer","data":[81,241,249,100,182,127,58,148,246,110,148,254,190,250,49,158,57,75,91,26]},"announce":[],"urlList":[]}}