{"title":"Hidden Secrets - Part 38 - Dark Fellowships UFOs and Occult","uid":12217190,"size":7525662897,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:51f435a20491d6a7bfd67c59e063489295bab43c&amp;dn=Hidden+Secrets+-+Part+38+-+Dark+Fellowships+UFOs+and+Occult&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":39,"time":1439258114,"description":" The Nazi New Age UFO 2012 Deception - Rev Jim Wilhelmsen:\nFrom the author of &quot;Beyond Science-Fiction&quot;, Rev. Jim Wilhelmsen about New Age, the Nazi, Theosophy, UFOs, Aliens, the Thule and Vril Society, Time Travel, Stargates, the Antarctic War, WW2, Hollow Earth, hidden archeology, the supernatural, Fallen Angels, Nephilim, genetic engineering, symbolism, the Bible, the New World Order and much more.\n\nConventional History mentions astrology as the occult beliefs of the Nazis. In truth the entire Nazi organization was Occult based. Find out the specific details that led the Nazis to discover things completely outside of the box.  Hollow Earth, Nazi UFOs, cloning and the possible breaching of space and time, the Nazis were pioneers into realms unthought of, which their occult beliefs produced. Stranger yet is the fact that this was all predicted in the Bible!\n\nNazis believed their Nordic Gods came from outer space. They believed their pure blood relatives lived in a Hollow Earth. In 1938 they went on a occult based search for them and found something.  See how the Nazi SS scientists deciphered ancient myths and mysteries into technology that produced UFOs.  If the Nazis had such technology Why didn't they win the war. The answer to this and many more questions about Nazi UFOs and sightings in general are answered here.\n\nThe biggest battle in all of History was WWII. The most damage and loss of lives, do you really think it is not mentioned in the Bible. WWII is one of the most important prophetic pieces of the puzzle that we need to know now!  There is a remarkable connection to the early UFO sightings and the contactee phenomena with Nazi ideology. Can they both be saying the same thing? Find out how this is just a change of presentation of the same agenda.\n\nThe message and personal backgrounds of leading &quot;contactees&quot; are more than coincidence to their occult and Nazi connections. See how this is a continuation of the Nazi plan to win the hearts and minds of Americans and in turn the World!  An army of Locust comes out of the bottomless pit mentioned in Revelation 9 and Joel 2. What could this mean and how does it have anything to do with events today? Could it be the 'Army the Darkness'?\n\nSee how this fake 2nd Coming may play out using false doctrines and a twisting of Biblical prophecy and the well known Washington Vision.  This video gives you many of the scriptures that tell you of the truths to this end time deception. A technology not magic is provided to mankind that makes them think they are independent and not in any need of God.  Jim Wilhelmsen is not the first to make this Nazi connection to UFOs but is the first to make the Biblical prophetic connection to it.\n--------------------------------------------------------------------------------------------------------\n\nDark Fellowships - The Vril:\nThis 2008 documovie called Dark Fellowships attempts to uncover the truth about some of the most renowned and feared secret organizations throughout history. In the first episode, Dark Fellowships: the Vril, meet a bizarre occult group, whose members allegedly included many leaders of the Nazi Party, even Hitler himself.  Written by Matt Bennett","torrent":{"xt":"urn:btih:51f435a20491d6a7bfd67c59e063489295bab43c","amp;dn":"Hidden+Secrets+-+Part+38+-+Dark+Fellowships+UFOs+and+Occult","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f435a20491d6a7bfd67c59e063489295bab43c","infoHashBuffer":{"type":"Buffer","data":[81,244,53,162,4,145,214,167,191,214,124,89,224,99,72,146,149,186,180,60]},"announce":[],"urlList":[]}}