{"title":"AstroNavigator II SymPda","uid":4448355,"size":2874858,"categoryP":"applications","categoryS":"handheld","magnet":"?xt=urn:btih:52f35a69f3c3c278333e793e9178567660e2fcaf&amp;dn=AstroNavigator+II+SymPda&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tanauser","files":2,"time":1224152844,"description":"Astro Navigator\nWith new AstroNavigator II you can literally touch the sky. Just slide with a finger to rotate the screen and see a star, a planet, or a constellation. Tap one of them to read a wealth of information about it in a pop-up window.\n\nAstroNavigator II is the GPS application that displays sky map above you according to your current location, time and direction of movement.\n\nEven if you do not have a GPS receiver AstroNavigator II can display the actual sky picture above you. All you need to do is to point to your place in the world map window.\n\nmain features\n# The sky map in AstroNavigator II contains over 9000 stars visible to the naked eye, planets of solar system including Sun, Moon and constellations.\n# AstroNavigator II provides you with easy search of sky objects. You can quickly pick a necessary planet, constellation or star by sliding the list with a finger.\n# With AstroNavigator II you are now able to identify any sky object and receive general information with a single tap.\n# Just slide with a finger to rotate the screen and see a star, a planet, or a constellation. Tap one of them to read a wealth of information about it in a pop-up window.\n# You can choose what celestial bodies you want to be displayed for more convenient viewing. It is possible to turn on or off displaying of stars, planets, constellations, grid.\n# night view Skin - dim red colors don&amp;#039;t dazzle you and you can clearly see the stars above you.\n\n\n\ncracked version SymPda","torrent":{"xt":"urn:btih:52f35a69f3c3c278333e793e9178567660e2fcaf","amp;dn":"AstroNavigator+II+SymPda","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f35a69f3c3c278333e793e9178567660e2fcaf","infoHashBuffer":{"type":"Buffer","data":[82,243,90,105,243,195,194,120,51,62,121,62,145,120,86,118,96,226,252,175]},"announce":[],"urlList":[]}}