{"title":"Wilbur Smith - Złoty Lis [PL]","uid":14177383,"size":528062085,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:53ff6aeb385cccfe4b817389b180c8fee2f8f8df&amp;dn=Wilbur+Smith+-+Z%C5%82oty+Lis+%5BPL%5D+mp3%4064&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":42,"time":1459812261,"description":"Audiobook PL - 40 części /   \r\nrozmiar: 503 MB / czas: 18:20:02\r\nczyta: Leszek Teleszyński\r\n\r\nIsabella - córka Sashy Courtneya, jednego z najbogatszych ludzi w RPA i pełniącego funkcję ambasadora tego kraju w Wielkiej Brytanii - pada ofiarą perfidnej intrygi uknutej przez sowiecki wywiad. Jej bezpośrednim wykonawcą jest Ramón Machado, zwany &quot;Złotym Lisem&quot; - kuzyn Fidela Castro, który jest agentem KGB działającym w Ameryce Środkowej, Europie i Afryce i który oddaje nieocenione usługi swoim mocodawcom. To on zebrał informacje, które doprowadziły do fiaska amerykańskiej operacji w Zatoce Świń, oraz umożliwił wkroczenie Rosjan do Etiopii i rozpętanie tam rządów &quot;czerwonego terroru&quot;. Wybitnie inteligentny, obdarzony niezwykłym urokiem osobistym Ramón, któremu nie potrafi oprzeć się żadna kobieta, nawiązuje romans z Isabellą, rozkochując ją w sobie.\r\nGdy dziewczyna rodzi mu syna, porywa go i pozoruje również własne porwanie... Od tej pory Isabella jest utrzymywana w przeświadczeniu, że może ocalić życie dziecka i ukochanego, posłusznie wykonując rozkazy porywaczy. Zmuszona szantażem do współpracy - zostaje sowieckim szpiegiem. Dzięki rodzinnym wpływom robi karierę w administracji RPA oraz koncernie zbrojeniowym zarządzanym przez jej ojca, uzyskując dostęp do najpilniej strzeżonych tajemnic. Kiedy prawda wychodzi w końcu na jaw, skłóceni dotąd ze sobą członkowie klanu Courtneyów łączą siły, by ciosem odpowiedzieć Za cios - oraz powstrzymać przerażający akt terroru, planowany przez Złotego Lisa","torrent":{"xt":"urn:btih:53ff6aeb385cccfe4b817389b180c8fee2f8f8df","amp;dn":"Wilbur+Smith+-+Z%C5%82oty+Lis+%5BPL%5D+mp3%4064","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53ff6aeb385cccfe4b817389b180c8fee2f8f8df","infoHashBuffer":{"type":"Buffer","data":[83,255,106,235,56,92,204,254,75,129,115,137,177,128,200,254,226,248,248,223]},"announce":[],"urlList":[]}}