{"title":"Roadside Graves - No One Will Know Where You've Been [2007][EAC,","uid":8721508,"size":242044419,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:54098f1296a40bbc945d8e6234fd8747942226d6&amp;dn=Roadside+Graves+-+No+One+Will+Know+Where+You%27ve+Been+%5B2007%5D%5BEAC%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":13,"time":1374429468,"description":"Artist:Roadside Graves\nRelease:No One Will Know Where You've Been\nReleased: 2007\nLabel: Kill Buffalo\nCatalog#: KB004\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: indie folk\n\n1. Family and Friends \n2. Women in Black \n3. West Coast \n4. The Black Hills \n5. If California Didn't End\n6. No One Will Know Where You've Been \n7. Stranger \n8. Live Slow \n9. Man at Every Port \n10. Radio \n11. Oh Boy, It's a Girl\n\nVocalist John Gleason and guitarist Jeremy Benson wrote the Roadside Graves' first song, &quot;Song for a Dry State&quot;, following a cross-country road trip to Utah. And judging from the New Jersey group's vibrant third album No One Will Know Where You've Been, that's hardly the last time they've drawn inspiration with a little help from Rand McNally. The album showcases the Roadside Graves' affection for the American landscape-- both physical and musical-- and hearkens back to the days when long-distance drivers were at the mercy of whichever classic rock or country station carried the strongest signal, and those lonely instances when a well-timed selection from Creedence, George Jones, or the Band might make your whole evening.\nAfter beginning life as a trio, for the bulk of No One Will Know Where You've Been, the Roadside Graves have settled in as a versatile seven-piece outfit. Thanks largely to the band's Jersey roots and Mike DeBlasio's dramatic contributions on piano and organ, this lineup all but guarantees a few unavoidable E-Street echoes. But their sweet-tempered country-rock is far more slippery than it might first appear, buffered as it is by rich Jayhawks vocal harmonies, Benson's quicksilver guitar leads, and frequent detours that can occasionally conjure images of a roadhouse Bad Seeds. These unexpected instrumental flourishes serve well to illuminate the intimate psychic geography that Gleason ambitiously maps out in his lyrics.\n&quot;If California didn't end, you'd still be driving around,&quot; Gleason sings to the wayward characters that populate &quot;If California Didn't End&quot;, one of several examples in his lyrics where lives and plans are forcibly reconfigured by the facts on the ground. This theme is repeated on the album's best track, the triumphant &quot;West Coast&quot;, a bittersweet tribute to family and the heart's resilience. &quot;I've got a heart that won't quit, won't break/ no matter what you do&quot; the Graves sing together, with a passion and vitality that quashes any hint of melodrama, the irresistible chorus framed perfectly by Benson's sun-drizzled, Jerry Garcia guitar.\nElsewhere, the album's shades can take a darker hue, as on the cheerfully macabre &quot;Women in Black&quot;, which finds the Roadside Graves taking their name rather literally with a car-crash narrative that nearly skirts into &quot;Teen Angel&quot; territory. And on the folk-like ballad &quot;The Black Hills&quot;, Gleason further internalizes the details of the American topography, repeating &quot;She walks the Black Hills for me&quot; with a baleful gravity. These gloomier passages are balanced out by the presence of spirited, sawdust-floor country numbers like the rollicking &quot;Man at Every Port&quot; or &quot;Stranger&quot;, whose closing guitar jam should easily gather the My Morning Jacket faithful into the congregation.\n&quot;I've drank enough to know that I've drank enough,&quot; announces Gleason on the world-weary &quot;Live Slow&quot;, the one track that seemingly comes closest to encapsulating the enduring spirit behind No One Will Know Where You've Been. Performed with an uncommonly deft touch and subtle grace, these songs concern themselves primarily with the pause for breath that comes after reaching their original destinations, and the long, careful glance at the atlas that should come before determining what exactly is supposed to happen next.","torrent":{"xt":"urn:btih:54098f1296a40bbc945d8e6234fd8747942226d6","amp;dn":"Roadside+Graves+-+No+One+Will+Know+Where+You%27ve+Been+%5B2007%5D%5BEAC%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54098f1296a40bbc945d8e6234fd8747942226d6","infoHashBuffer":{"type":"Buffer","data":[84,9,143,18,150,164,11,188,148,93,142,98,52,253,135,71,148,34,38,214]},"announce":[],"urlList":[]}}