{"title":"Green Day Comprehensive Discog [320kbps] + The Network, Foxboro","uid":6099302,"size":2002171566,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:54747eb561b1094f8495a88aa4db4f5f0941afa6&amp;dn=Green+Day+Comprehensive+Discog+%5B320kbps%5D+%2B+The+Network%2C+Foxboro+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HMD3","files":289,"time":1294900485,"description":"Okay, again, same as a few other of my torrents, my nazi media player changed id3's causing 1st upload to be uncompleteable, so remove that torrent from your client, but not the files, then download this 1, and it will finish it. \n\nAnd Orig Description\n\nGreen Day is an American punk rock band formed in 1987. The band consists of lead vocalist and guitarist Billie Joe Armstrong, bassist and backing vocalist Mike Dirnt, and drummer TrÃƒÂ© Cool. Cool replaced former drummer John Kiffmeyer in 1991, prior to the recording of the band's second album, Kerplunk, and has been a member of the band ever since.\n\nGreen Day was originally part of the punk scene at 924 Gilman Street in Berkeley, California. The band's early releases for independent record label Lookout! Records earned it a grassroots fanbase.[1] In 1994, its major label debut Dookie became a breakout success and eventually sold over 10 million copies in the U.S.[2] As a result, Green Day was widely credited, alongside fellow California punk bands The Offspring and Rancid, with popularizing and reviving mainstream interest in punk rock in the United States.[3][4] Green Day's three follow-up albums, Insomniac, Nimrod, and Warning did not achieve the massive success of Dookie, but they were still successful, reaching double platinum, double platinum, and gold status respectively.[5] Their 2004 rock opera American Idiot reignited the band's popularity with a younger generation, selling five million copies in the U.S.[5] The band's eighth studio album, 21st Century Breakdown, was released in 2009.\n\nGreen Day has sold over 65 million records worldwide and 24.639 million in the US alone.[6] They have won four Grammy Awards: Best Alternative Album for Dookie, Best Rock Album for American Idiot, Record of the Year for &quot;Boulevard of Broken Dreams&quot;, and Best Rock Album for the second time for 21st Century Breakdown. In 2010, a stage adaptation of American Idiot debuted on Broadway. The musical has been nominated for several Tony Awards, including Best Musical and Best Scenic Design, and has received generally positive reviews.\n\nSee full history at: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Green_Day&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Green_Day&lt;/a&gt; \n\nThe most Comprehensive Green Day discog ANYWHERE!, All in 320*, fully tagged, 500x500 album art.\n\nAll Studio Albums\n1.  1039/Smoothed Out Slappy Hours (2007 Remaster)\n2.  Kerplunk\n3.  Dookie\n4.  Insomniac\n5.  Nimrod\n6.  Warning [Bonus Track]\n7.  International Super Hits\n8.  Shenanigans (A B-Side collection from albums up to this 1)\n9.  American Idiot [Japanese Bonus Track]\n10. 21st Century Breakdown [Bonus Tracks]\n\nSingles**\n1. Warning #1 [Single]\n2. American Idiot 1\n3. American Idiot 2\n4. The Saints Are Coming (U2 &amp; Green Day)\n5. Working Class Hero (From Darfur Aid Album)\n6. 21 Guns w/ American Idiot Cast\n7. Know Your Enemy [Maxi Single]\n\nSoundtrack appearences\n1. Godzilla OST\n2. The Simpsons Movie\n\nCompliation Appearence\n1. Short Music For Short People\n\nLive Album\n1. Bullet In A Bible\n\nTheir Two Side Bands I have also included here, as they are not as well known\n1. The Network - Money Money 2020\n2. Foxboro Hot Tubs - Stop Drop &amp; Roll!!! EP***\n3. Foxboro Hot Tubs - Stop Drop &amp; Roll!!!\n\nLast But Not Least, a Bonus Inclusion of\nAmerican Idiot: The Broadway Cast Recording****\n\n*=Note 1: With the exception of 1 song, which the original recording itself is low quality.\n\n**=Note 2: This doesn't include all singles, only ones that have content not found elsewhere in the discog, and not ones that are just repeated content. So to my research, singles not included do not have any content not already else where in this Discog.\n\n***Note 3: What is the difference you might ask, The EP Pre-Release includes &quot;Highway 1&quot; Not on the full release. EP is also only 6 songs.\n\n****Note 4: This album isn't Green Day Exactly, but they do appear in some songs, and 1 Bonus song is Green Day. Also I included in the comments of the ID3 the individual performers' names if the whole cast isn't in that song, so when it says Cast, that means everyone.\n\nENJOY, please help me Seed, let this Green Day torrent over take all others, so all can enjoy all thier content in crisp 320 :)\n\nHMD3","torrent":{"xt":"urn:btih:54747eb561b1094f8495a88aa4db4f5f0941afa6","amp;dn":"Green+Day+Comprehensive+Discog+%5B320kbps%5D+%2B+The+Network%2C+Foxboro+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54747eb561b1094f8495a88aa4db4f5f0941afa6","infoHashBuffer":{"type":"Buffer","data":[84,116,126,181,97,177,9,79,132,149,168,138,164,219,79,95,9,65,175,166]},"announce":[],"urlList":[]}}