{"title":"CSI:Miami [Season 1] [Ep1-12] HDTV Xvid NLsubs -NLT Release","uid":4753510,"size":3785830714,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54cd1f230be52d628c9a3e80608f26c29d5202d1&amp;dn=CSI%3AMiami+%5BSeason+1%5D+%5BEp1-12%5D+HDTV+Xvid+NLsubs+-NLT+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nappoo","files":-1,"time":1236325960,"description":"CSI: Miami [Season 1] (2002)  - NLT Release\n\nRip info\n\nTitle...........: CSI: Miami [Season 1]\nYear............: 2002\nGenre...........: Thriller\nSource..........: HDTV\nRip Method......: AVIrecomp, two passes\nAudio Bitrate...: 125Kbps\nResolution......: 576 x 320\nFPS.............: 25\nVideo Codec.....: Xvid\nLength..........: 42min per aflevering / 495min hele torrent\nRelease Date....: 23 September 2002\nSize............: 3,52GB\nSubtitles.......: Dutch [Nederlands]\nIMDB............: http://www.imdb.com/title/tt0313043/\n\nAfleveringen\n\nAflevering 1.1 - Golden Parachute\nHet CSI-team zoekt naar overlevenden van een vliegtuigcrash in de Everglades. \nOp onverklaarbare wijze treffen ze een vrouwelijk slachtoffer aan, op zon acht \nkilometer van de plek waar het vliegtuig is neergestort. De enige overlevende \nbeweert dat de vrouw het luik van het vliegtuig had geopend om zelfmoord te \nplegen, maar Horatio vertrouwt het zaakje niet. Wanneer de puzzelstukjes in \nelkaar vallen, moet het team de gebeurtenissen tijdens de fatale vlucht zien \nte reconstrueren.\n\nAflevering 1.2 - Losing Face\nWanneer de mentor van Horatio tijdens het onschadelijk maken van een bom omkomt,\nziet het CSI-team het als een persoonlijke missie om de dader op te sporen. \nDe plaats van de explosie wordt minutieus uitgekamd, met het team blijft met meer\nvragen dan antwoorden zitten. Wanneer Horatio en Megan echter weggeroepen worden\nnaar een andere bommelding, zijn ze verbijsterd wanneer ze erachter komen wie \nhet eigenlijke doelwit van de bommenterreur is.\n\nAflevering 1.3 - Wet Foot / Dry Foot\nIemand heeft ogenschijnlijk de dood gevonden bij een aanval van een haai. Horatio\nen Megan gaan echter twijfelen wanneer ze een kogel aantreffen in een deel van \neen menselijk torso. Wanneer het CSI-team vervolgens op een verlaten boot vol\ngeheimen stuit, volgen Horatio en het team het spoor verder. Ze ontdekken dat er sprake was van een geheime missie, met vrijheid als doel, die verschrikkelijk misliep.\n\nAflevering 1.4 - Just One Kiss\nWanneer op een strand bij Miami een verkrachting en moord plaatsvinden, worden \nHoratio en het team op onderzoek uitgezonden. Na verhoor van de vriend van een \nverkrachtingsslachtoffer komen Megan en Horatio erachter dat het stel een \nonstuimig feest had bijgewoond in het landhuis van de Hamiltons, een familie \nvan politici en met oud geld. Wanneer de bewijzen zich tegen de familie \nopstapelen, nemen de machtige Hamiltons zelf maatregelen om de goede naam \nvan hun familie te beschermen.\n\nAflevering 1.5 - Ashes to Ashes\nEen priester wordt doodgeschoten en het bewijsmateriaal geeft aan dat de \n12jarige misdienaar Cameron Medina de hoofdverdachte is. Nader onderzoek naar \nCamerons tumultueuze thuissituatie leidt het CSI-team in een andere richting. \nOndertussen doen Horatio en Delko onderzoek naar de verkoolde overblijfselen \nvan een zwangere vrouw die het slachtoffer van een misdrijf is geworden. \nHet is aan hen om fysiek bewijsmateriaal te verzamelen om de persoon te kunnen \nveroordelen van wie Horatio instinctief aanvoelt dat hij de moordenaar is.\n\nAflevering 1.6 - Broken\nEen 5-jarig meisje wordt dood aangetroffen in de toiletruimte van het \nrestaurant van een pretpark. Het CSI-team ontdekt dat de moordenaar geprobeerd \nheeft haar naar buiten te smokkelen. Calleigh, Delko en Speedle ontdekken \ntussen de bezoekers een zedendelinquent die een bekende van de politie is, maar \nde bewakingsvideo verschaft hem een alibi. Naarmate het team nieuwe \naanknopingspunten vindt, laat het bewijsmateriaal zien hoever iemand gaat om \naan zijn straf te ontsnappen.\n\nAflevering 1.7 - Breathless\nHoratio en het team onderzoeken de moord op een jonge mannelijke stripper die \nna een seksfeestje dood wordt aangetroffen. Het bewijsmateriaal wijst in de \nrichting van vergiftiging. Verschillende motieven passeren de revue en Horatio \nontdekt dat de stripper tijdens het feestje geobsedeerd was door een van de \nvrouwen. Ondertussen onderzoeken Megan en Delko de dood van een diepzeeduiker\ndie op zee dood is gestoken.\n\nAflevering 1.8 - Slaughter House\nEen peuter die alleen door de straten van een buitenwijk doolt, brengt de \npolitie op het spoor van een brute moord op een gezin in hun eigen huis. De moeder, een kleuter en twee zonen zijn allen dood: alleen de vader en de peuter zijn de overlevenden. Met behulp van de bloedsporen die her en der op de plaats delict worden aangetroffen, moet het CSI-team bewijsmateriaal verzamelen om vast te kunnen stellen wanneer, en in welke volgorde, de verschillende gebeurtenissen hebben plaatsgevonden.\n\n\nAflevering 1.9 - Kill Zone\nTijdens de spits in het centrum van Miami worden drie mensen doodgeschoten. Horatio en het team beginnen aan een race tegen de klok om de, naar zij denken, \nprofessionele scherpschutter te vinden. Het team staat echter voor een raadsel wanneer een vierde slachtoffer wordt aangetroffen en de sporen niet overeenkomen met die van de vorige drie moorden. Dan moeten de CSI-ers proberen zich in de moordenaar te verplaatsen voordat hij nog meer angst en verderf in de stad gaat zaaien.\n\nAflevering 1.10 - A Horrible Mind\nEen professor van de universiteit, berucht om zijn colleges over kwaad en geweld, wordt dood aangetroffen, ernstig verminkt en opgehangen aan een boom op de campus. De CSI-ers plakken versnipperde documenten van de hoogleraar weer aan elkaar en doen nader onderzoek naar zijn ongebruikelijke lesmethoden.\n\nAflevering 1.11 - Camp Fear\nWanneer een ongeidentificeerd meisje dood wordt aangetroffen in de buurt van de campus van een zeer streng heropvoedingscamp, gaan Horatio en het team op onderzoek uit. De CSI-ers denken dat een van de cadetten uit het kamp wellicht vitale informatie  achterhoudt. Het team volgt de sporen en stuit op een doodsoorzaak die geen van allen had verwacht. Ondertussen onderzoeken Speedle en Delko de dood van een zwendelaar wiens gezicht en keel met vuur zijn bewerkt.\n\nAflevering 1.12 - Entrance Wound\nHoratio en het team gaan op onderzoek uit wanneer een prostituee doodgestoken onder een bed in een plaatselijk hotel wordt aangetroffen. De moordenaar heeft op de plaats delict alle sporen minutieus verwijderd en het lichaam van het slachtoffer in de badkuip schoongewassen. Het bewijsmateriaal wijst weliswaar in een bepaalde richting, maar Horatios instinct zegt hem dat de werkelijke moordenaar de plaats delict wellicht in scene heeft gezet. Ondertussen onderzoeken Calleigh en Delko de moord op een Duitse toerist tijdens een, naar het lijkt, poging tot autodiefstal.\n\n\n\nNLT RELEASE\nwww.nlt.ons-forum.nl","torrent":{"xt":"urn:btih:54cd1f230be52d628c9a3e80608f26c29d5202d1","amp;dn":"CSI%3AMiami+%5BSeason+1%5D+%5BEp1-12%5D+HDTV+Xvid+NLsubs+-NLT+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54cd1f230be52d628c9a3e80608f26c29d5202d1","infoHashBuffer":{"type":"Buffer","data":[84,205,31,35,11,229,45,98,140,154,62,128,96,143,38,194,157,82,2,209]},"announce":[],"urlList":[]}}