{"title":"Evander Holyfield vs. Riddick Bowe I.avi","uid":10931557,"size":1573656576,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:54d38e238523a4e69c3b739f2f329b2a3f172471&amp;dn=Evander+Holyfield+vs.+Riddick+Bowe+I.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"parsoma2006","files":1,"time":1409408418,"description":"Evander Holyfield vs. Riddick Bowe was a professional boxing match that took place on November 13, 1992 in Las Vegas, Nevada. The fight was contested for the undisputed world heavyweight championship, which consisted of the WBA, WBC and IBF titles as well as the lineal championship.\n\n\nOn October 25, 1990, world #1 contender Holyfield fought Buster Douglas in the first defense of the title Douglas won eight months earlier by upsetting Mike Tyson in Tokyo. Holyfield defeated an out-of-shape Douglas by knocking him out in the third round, and had made three defenses of his title entering this fight. The first was against George Foreman, the former champion who was attempting a comeback and to become the oldest heavyweight champion ever. After winning a unanimous decision Holyfield signed to fight Tyson on November 8, 1991, but Tyson pulled out with an injury. Instead, Holyfield took on journeyman Bert Cooper and suffered his first career knockdown, nearly falling to defeat before rallying to knock out the lightly regarded contender ina fight the WBC refused to sanction as a title fight. The Tyson fight was then scuttled altogether after Tyson was convicted of rape and incarcerated in early 1992.\n\nWith Holyfield in need of an opponent, undefeated Riddick Bowe emerged as the frontrunner to land the next shot at Holyfield's Undisputed championship. Holyfield's manger Shelly Finkel and Bowe's manager Rock Newman were nearly able to get a deal done shortly after Tyson's conviction, but it fell apart after the two sides could not agree on financial issues. Eventually, Bowe landed a number-one contendership match with Pierre Coetzer, which he won by seventh round technical knockout, earning the right to challenge Holyfield for his Undisputed Heavyweight championship.\n\nMeanwhile, Holyfield took a tune up fight in June 1992 against another aging former champion in Larry Holmes. Although the 43-year old Holmes had won six consecutive fights after recording what were his only career losses to that point and went the distance with the champion, Holyfield emerged with another unanimous decision win. Afterwards he faced criticism for taking the title from an uninterested Douglas and then defending it against two past-their-prime fighters in Foreman and Holmes and nearly getting knocked out by the journeyman Cooper. As a result, some in the boxing world looked at Holyfield's match with Bowe as a way for the champion to legitimize his championship reign and earn the respect of his doubters despite his two year reign as champion.\n\nOriginal file taken from the World Boxing Video Archive","torrent":{"xt":"urn:btih:54d38e238523a4e69c3b739f2f329b2a3f172471","amp;dn":"Evander+Holyfield+vs.+Riddick+Bowe+I.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54d38e238523a4e69c3b739f2f329b2a3f172471","infoHashBuffer":{"type":"Buffer","data":[84,211,142,35,133,35,164,230,156,59,115,159,47,50,155,42,63,23,36,113]},"announce":[],"urlList":[]}}