{"title":"Smithsonian Civil War - Inside the National Collection (History ","uid":9739881,"size":82214483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:558abff436b0d8f816c920794bfb3a090a92e39b&amp;dn=Smithsonian+Civil+War+-+Inside+the+National+Collection+%28History+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"STBGD","files":-1,"time":1394495337,"description":"Smithsonian Institution, Neil Kagan, Hugh Talman, &quot;Smithsonian Civil War: Inside the National Collection&quot; \nEnglish | ISBN: 1588343898 | 2013 | EPUB | 368 pages | 78,4 MB\n\nSmithsonian Civil War is a lavishly illustrated coffee-table book featuring 150 entries in honor of the 150th anniversary of the Civil War. From among tens of thousands of Civil War objects in the Smithsonian's collections, curators handpicked 550 items and wrote a unique narrative that begins before the war through the Reconstruction period. The perfect gift book for fathers and history lovers, Smithsonian Civil War combines one-of-a-kind, famous, and previously unseen relics from the war in a truly unique narrative.\n\nSmithsonian Civil War takes the reader inside the great collection of Americana housed at twelve national museums and archives and brings historical gems to light. From the National Portrait Gallery come rare early photographs of Stonewall Jackson and Ulysses S. Grant; from the National Museum of American History, secret messages that remained hidden inside Lincoln's gold watch for nearly 150 years; from the National Air and Space Museum, futuristic Civil War-era aircraft designs. Thousands of items were evaluated before those of greatest value and significance were selected for inclusion here. Artfully arranged in 150 entries, they offer a unique, panoramic view of the Civil War.","torrent":{"xt":"urn:btih:558abff436b0d8f816c920794bfb3a090a92e39b","amp;dn":"Smithsonian+Civil+War+-+Inside+the+National+Collection+%28History+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558abff436b0d8f816c920794bfb3a090a92e39b","infoHashBuffer":{"type":"Buffer","data":[85,138,191,244,54,176,216,248,22,201,32,121,75,251,58,9,10,146,227,155]},"announce":[],"urlList":[]}}