{"title":"Call Of The Valley","uid":3784552,"size":61950776,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:55e3b32842fc1c7f477c6d7e712cabc9b6e2e187&amp;dn=Call+Of+The+Valley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bestiapb","files":9,"time":1188089099,"description":"Conceived as a fantasia depicting a day in a Kashmiri village, Call of the Valley is predicated on the deliciously simple, yet at the time radical, idea of marking the passage of the day with ragas appropriate to the hour. Together with the de facto producer G.N. Joshi, they worked out a sequence of ragas to project the story. Opening with the early morning raga &quot;Ahir Bhairav&quot;, Kabra&amp;#039;s guitar announces daybreak. Shortly afterwards, Chaurasia&amp;#039;s bansuri (bamboo flute) picks up Kabra&amp;#039;s sunrise theme. Just under two minutes into &quot;Ahir Bhairav&quot; Sharma&amp;#039;s santoor (a trapezoid-shaped hammer dulcimer) joins in. As the defining instrument of Kashmir, santoor places the action firmly in a landscape of mountains and lakes. &quot;Ahir Bhairav&quot; gives way to &quot;Nat Bhairav&quot;. &quot;Piloo&quot;, &quot;Bhoop&quot;, &quot;Des&quot; and &quot;Pahadi&quot; follow. Originally released in the late 1960s, this masterpiece has remained in catalogue with the Gramophone Company of India ever since. That alone speaks volumes. The remastered Hemisphere edition has three additional track, one apiece from each principal soloist. Call of the Valley has probably awakened more people to Hindustani music than any other single recorded project. That is the measure of its importance and accessibility. --Ken Hunt","torrent":{"xt":"urn:btih:55e3b32842fc1c7f477c6d7e712cabc9b6e2e187","amp;dn":"Call+Of+The+Valley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55e3b32842fc1c7f477c6d7e712cabc9b6e2e187","infoHashBuffer":{"type":"Buffer","data":[85,227,179,40,66,252,28,127,71,124,109,126,113,44,171,201,182,226,225,135]},"announce":[],"urlList":[]}}