{"title":"Treatment of Biogas for Feeding High Temperature Fuel Cells","uid":14974317,"size":2943546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:561c0563e14243a7b6ee003f5fa07f9c2ce0a733&amp;dn=Treatment+of+Biogas+for+Feeding+High+Temperature+Fuel+Cells&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466223435,"description":"Treatment of Biogas for Feeding High Temperature Fuel Cells - Maria Turco et al. (Springer, 2016).pdf\r\n\r\nISBN 978-3-319-03214-6\r\n\r\nThis book reports on the most recent applications of processes with a particular focus on the source and the properties of biogas and on the characteristics of the fuel cells (FCs). It describes adsorbing materials of potential interest are reviewed and the preparation methods and treatments employed to improve the adsorption properties as well as the stability and regenerability. The characterization of the chemical and physical properties involved in these processes is examined in particular detail. The book also covers aspects that concern the development of the adsorption apparatus with particular attention on the target of low residual concentration and high selectivity.High temperature FCs, such as molten carbonates (MCFCs) or solid oxides (SOFCs), are efficient, with a low environmental impact, and they can use a wide variety of fuels, such as biogas. The presence of some poisonous compounds such as sulphides, halides, and siloxanes can react with electrode catalysts and electrolyte, leading to the degradation and short lifetime of the cell. The treatment of raw biogas to obtain a FC-compatible fuel is mainly based on adsorption processes on suitable materials","torrent":{"xt":"urn:btih:561c0563e14243a7b6ee003f5fa07f9c2ce0a733","amp;dn":"Treatment+of+Biogas+for+Feeding+High+Temperature+Fuel+Cells","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"561c0563e14243a7b6ee003f5fa07f9c2ce0a733","infoHashBuffer":{"type":"Buffer","data":[86,28,5,99,225,66,67,167,182,238,0,63,95,160,127,156,44,224,167,51]},"announce":[],"urlList":[]}}