{"title":"Anatomy For Beginners","uid":3284068,"size":2878718605,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5748325128d000662724e836559a499ef397827c&amp;dn=Anatomy+For+Beginners&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cully","files":24,"time":1107336157,"description":"Anatomist Gunther von Hagens and pathologist John Lee begin a series of\nanatomy classes, including a human dissection filmed before an invited\naudience.\n\nPart 1/4 - Lesson 1: Movement\n\nThis first programme investigates movement. Dr von Hagens \ndissects a man he knew, removing the skin in a single piece to enable \na demonstration of muscle movement. Then the skull is opened and the \nspinal cord and sciatic nerve removed in a single piece.\n\nPart 2/4 - Lesson 2: Circulation\n\n\nAnatomist Dr Gunther von Hagens and pathologist Professor John Lee continue\ntheir exploration of the human body. Respiration and circulation are the subjects\nof this programme's dissection as von Hagens demonstrates the inflation and deflation\nof the lungs, as well as the flow of blood through the vascular system.\n\nPart 3/4 - Lesson 3: Digestion\n\nDr Gunther von Hagens and pathologist Professor John Lee reveal the science \nand beauty of the human body in a series of filmed dissections. Focusing on \nthe digestive system, von Hagens removes the entire abdominal block from a\nwoman's body and demonstrates the passage of a mouthful of food through the\nseven metres of the digestive tract. \n\nPart 4/4 - Lesson 4: Reproduction\n\nThe final programme in which Dr Gunther von Hagens and Professor John Lee \nreveal the science of the human body by means of dissection. On this occasion \nmale and female bodies are examined as the anatomists expose the wonders of the\nhuman reproductive system in graphic detail.\n\npart 5 - The Final Cut\n\nA special compilation programme drawing on the four televised anatomy\nclasses conducted by Dr Gunther von Hagens and pathologist Professor\nJohn Lee. Using illustrations, human skeletons and dissections of \nactual corpses, they help explain the intricacies of the human body\nand the functions that we take for granted.\n\noriginal samples\nVideo: XviD at 1000kb/s\nAudio: MP3 at 128kb/s\nResolution: 352x288\nFrame Rate: 25fps\n\nconverted to \npal dvd\nwith menues","torrent":{"xt":"urn:btih:5748325128d000662724e836559a499ef397827c","amp;dn":"Anatomy+For+Beginners","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5748325128d000662724e836559a499ef397827c","infoHashBuffer":{"type":"Buffer","data":[87,72,50,81,40,208,0,102,39,36,232,54,85,154,73,158,243,151,130,124]},"announce":[],"urlList":[]}}