{"title":"Carmageddon 2 ZOMFG Pack V5","uid":5457253,"size":283003453,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:57f42c29b56ab45236e2ba1f0f158ca4f95a2ada&amp;dn=Carmageddon+2+ZOMFG+Pack+V5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"james9753","files":-1,"time":1269361153,"description":"This is the Carmageddon 2 &quot;ZOMFG&quot; Pack, Version 5 (says 4 in text file - mistake on my part)\n\n== What's New ==\n\n- Some original car models replaced by high-res ones.\n- High-res blood patch.\n- High-res pedestrian models pack.\n- Improved &quot;Car Wasted&quot; explosion effect.\n- New Car / Ped Sounds.\n- Applied the V2.0 Super Patch &amp; XP/Vista patch.\n- Added a whole bunch of extra peds, amongst them the &quot;GOATY&quot; ped which was left out of the game by SCi.\n- Replaced some drones by newer models:\n  generic city cars, 747 in Beaver County Airport and train in Beaver Woods\n- Shitloads of extra cars! There are 138 cars in total now.\n  Drive cars from Carmageddon 1, 3, movies/tv, and some other oddities.\n- Meddled with settings; draw distance has been increased, magnets and air vents in Max's Junkyard work now.\n  Also increased texture and sound detail level. See below for more information on this.\n- Supplies with a 'Completed Game' savegame.\n- Supplies with Zeckensack's Glide wrapper for playing the game in high resolutons.\n\n- Deleted all 'thumbs.db' files in some addon image folders.\n  Also deleted all other 'cruft' files.\n  Seriously people, clean your directories before uploading stuff.\n  It may just be a few files / Kb's per folder but this quickly amounts to Mb's / hundreds of files\n  when more and more folders/addons are installed, which means unnecesary bits to download \n  thus longer download times.\n\n- Included the add-on installation files.\n\n\n== Changes==\nv5 - added a bunch of new peds, re-tested all car addons.\nv4 - added 10 more Carmageddon 1 cars\nv3 - changed config options / found bugs\nv2 - changed config options due to bug\nv1 - initial release\n\n\n== General Notes of General Interest ==\n\n* You want to install the Glide Wrapper first.\n  After installing, run configurator.exe to set up the resolution and such.\n  After this the Carmageddon 2 startup menu should show the &quot;Glide&quot; option to be available.\n\n  THE ZECKENSACK'S GLIDE WRAPPER CAUSES SOME ANTI VIRUS PROGRAMS TO GIVE A FALSE POSITIVE!!!\n  There is no virus/trojan in the Zeckensack's Glide Wrapper, you can install it without worry.\n  Google for 'Zeckenzacks Glide Wrapper Virus Warning' if you want to confirm the false positive yourself.\n\n* If you go to the settings; the game will overwrite the manual settings.\n\n  Go to data/options.txt and change 'Yon 35.000000' to 'Yon 125.000000', this will increase draw distance.\n  You can set the Yon higher, but it will start to cause visual bugs and drops the framerate.\n  The next things you want to change are\n  CarTexturingLevel, RoadTexturingLevel, WallTexturingLevel, ShadowLevel and SoundDetailLevel.\n\n  Set all of these to 3, this will cause textures to be drawn without that ugly blur right in front of the car.\n\n  Setting &quot;SoundDetailLevel&quot; to 3 will let you hear your opponents cars, altough it sometimes causes\n  your own engine to 'drop out' due to the game's engine not being able to handle that much sounds playing at once.\n\n  Set &quot;RusselsFannies&quot; to 1 to make the magnets and air vents in Max's Junkyard work. If this option does not exist yet, add it.\n\n  NOTICE: Setting the Yon too high will cause the engine to glitch and crash on some levels.\n  The level mostly affected by this seems to be the ship. Set Yon to 60 or lower to play this map.\n\n* Check out http://carma.jjunkies.com/ for more of this goodness!\n\n\nThis Pack was created by SireCP. Credits for mods should go to their respectable authors.\nI did not create any custom content, only added new stuff and edited a few game files.\nOnce again, credits for mods should go to their respectable authors.\n\n\n== Installation Notes ==\n\n[WINDOWS]\nDownload and install the 7-zip archiver (if you have not installed this yet) at: http://www.7-zip.org/. \n \n[LINUX]\nUse your favorite distribution's package management tool to install the p7zip program.\nYou might like a graphical frontend for your zip programs; you can try file-roller for Gnome, ark for KDE or xarchiver for X(fce).\n \nAlso be sure to install wine to be able to run windows programs and games on linux.\n \n[ALL SYSTEMS]\nAfter installing the neccesary tools, extract the archive into its own folder.\nThere is no need to extract it over an already existing carmageddon 2 installation.\n \nNow you can start the game by either double clicking &quot;carma2.exe&quot; in windows, \nor cd'ing to the Carmageddon 2 ZOMFG pack folder and running &quot;wine carma2.exe&quot; in linux.\n\n\n== Disclaimer ==\n\nPlease note that I do not and can not take any responsibilities for this pack.\nI think I'm not even supposed to share many of these cars in this way, but what the hell,\nthe game is like 10 years old or something, someone had to do it.\nEither way if this pack fucks up your life, computer etc etc,\nwhich it theoretically should not since I tested all this crap myself,\ntough luck for you.\n\n\n== Final Note ===\n\nThis (version 5) is the last release of the ZOMFG pack from my hand. Yes, really!\nFeel free to take over the Carmageddon 2 ZOMFG pack management from here.\nI have included all used add-ons in a 7zip file so *you* can pick up and continue the 'update' process easier.\n\nComments and Questions should go to robert[dot]tigelaar[monkeytail]gmail[dot]com\n\nI would be grateful to hear who is taking over the pack management. This game ain't dead yet! :)","torrent":{"xt":"urn:btih:57f42c29b56ab45236e2ba1f0f158ca4f95a2ada","amp;dn":"Carmageddon+2+ZOMFG+Pack+V5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57f42c29b56ab45236e2ba1f0f158ca4f95a2ada","infoHashBuffer":{"type":"Buffer","data":[87,244,44,41,181,106,180,82,54,226,186,31,15,21,140,164,249,90,42,218]},"announce":[],"urlList":[]}}