{"title":"The Anthony Cumia Show 2015-03-17 MP4 MP3 combo","uid":11764580,"size":354988289,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:580ea1d50c9b820ba2cfe4fe23ce9b45522d60d9&amp;dn=The+Anthony+Cumia+Show+2015-03-17+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426698939,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): \n\nGreen is the Key\n\nEpisode 128: Dressed in all green (or is he??), Anthony is definitely in the holiday spirit as he reminisces about St. Patty's Day drinking and puking, talks about protesters at the NYC St. Patrick's Day parade, plays a news clip from the parade, and bags a bit on Irish tunes. We see a world record attempt in Dubai with an eagle, Ant admits he's faggy for cat video's, the &quot;dick dress&quot; makes an appearance, we learn about Gene Gene the Dancing Machine (RIP), watch Terrence Howard talk about the &quot;n word&quot;, hear about Ant's Nana, and see a clip from The Boondocks. Since it wasn't done yesterday, Anthony goes through Monday's mail, reads a &quot;heartwarming&quot; story about a woman who donated her kidney, plays a &quot;racist&quot; video out of Japan, and addresses Rat's lack of women with some help from Mike Damone. Rat explains WTF a &quot;highlighter party&quot; is, we see a news clip about a private part creeper, an aftermath video of a crazy dude on an airplane, Carlton calls in to comment on the Japan video, Ashley Judd fights back against internet trolls, Ant breaks down his opinion on trolls, and the show ends with a few calls.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\n\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:580ea1d50c9b820ba2cfe4fe23ce9b45522d60d9","amp;dn":"The+Anthony+Cumia+Show+2015-03-17+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"580ea1d50c9b820ba2cfe4fe23ce9b45522d60d9","infoHashBuffer":{"type":"Buffer","data":[88,14,161,213,12,155,130,11,162,207,228,254,35,206,155,69,82,45,96,217]},"announce":[],"urlList":[]}}