{"title":"The Chief Culprit: Stalin &amp; WWII (2008) by Viktor Suvorov","uid":10160489,"size":5564217,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:59278b1e85f6a3216ea04f193dfaa76e29a81fdc&amp;dn=The+Chief+Culprit%3A+Stalin+%26amp%3B+WWII+%282008%29+by+Viktor+Suvorov&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1400240283,"description":"The Chief Culprit - Stalin's Grand Design to Start World War II (2008) by Viktor Suvorov.pdf\n\nBestselling author Victor Suvorov probes newly released Soviet documents and reevaluates existing material to analyze Stalin's strategic design to conquer Europe and the reasons behind his controversial support for Nazi Germany. A former Soviet army intelligence officer, the author explains that Stalin's strategy leading up to World War II grew from Vladimir Lenin's belief that if World War I did not ignite the worldwide Communist revolution, then a second world war would be needed to achieve it. Stalin saw Nazi Germany as the power that would fight and weaken capitalist countries so that Soviet armies could then sweep across Europe. Suvorov reveals how Stalin conspired with German leaders to bypass the Versailles Treaty, which forbade German rearmament, and secretly trained German engineers and officers and provided bases and factories for war. He also calls attention to the 1939 nonaggression pact between the Soviet Union and Germany that allowed Hitler to proceed with his plans to invade Poland, fomenting war in Europe.\n\n\nSuvorov debunks the theory that Stalin was duped by Hitler and that the Soviet Union was a victim of Nazi aggression. Instead, he makes the case that Stalin neither feared Hitler nor mistakenly trusted him. Suvorov maintains that after Germany occupied Poland, defeated France, and started to prepare for an invasion of Great Britain, Hitler's intelligence services detected the Soviet Union's preparations for a major war against Germany. This detection, he argues, led to Germany's preemptive war plan and the launch of an invasion of the USSR. Stalin emerges from the pages of this book as a diabolical genius consumed by visions of a worldwide Communist revolution at any cost--a leader who wooed Hitler and Germany in his own effort to conquer the world. In contradicting traditional theories about Soviet planning, the book is certain to provoke debate among historians throughout the world.\n\n384 pages\nPublisher: Naval Institute Press (November 14, 2008)\nLanguage: English\nISBN-10: 1591148383\nISBN-13: 978-1591148388","torrent":{"xt":"urn:btih:59278b1e85f6a3216ea04f193dfaa76e29a81fdc","amp;dn":"The+Chief+Culprit%3A+Stalin+%26amp%3B+WWII+%282008%29+by+Viktor+Suvorov","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59278b1e85f6a3216ea04f193dfaa76e29a81fdc","infoHashBuffer":{"type":"Buffer","data":[89,39,139,30,133,246,163,33,110,160,79,25,61,250,167,110,41,168,31,220]},"announce":[],"urlList":[]}}