{"title":"Dick Gaughan - Handful of Earth [1981][EAC,log,cue. FLAC]","uid":8982885,"size":244796565,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:59589031a38f2f0f639dd0e0e4c592ef1d89082a&amp;dn=Dick+Gaughan+-+Handful+of+Earth+%5B1981%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":13,"time":1380603384,"description":"Artist: Dick Gaughan\nRelease: Handful of Earth\nReleased: 1981\nLabel: 1993 - Green Linnet\nCatalog#: GLCD-3062\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: UK\nStyle: Folk\n\n1. Erin Go Bragh \n2. Now Westlin' Winds \n3. Craigie Hill \n4. World Turned Upside Down \n5. Snows They Melt The Soonest \n6. Lough Erne \n7. First Kiss At Parting \n8. Scojun Waltz \n9. Randers Hopsa \n10. Song For Ireland \n11. Workers' Song \n12. Both Sides Of The Tweed1. Erin Go Bragh \n\nFrom Dick Gaughans Website...\n\nRecorded at Robin Morton's Temple Studios near Edinburgh.\n\nThis was the first album I had recorded in Scotland. For some reason, it seemed to strike a chord with people and it is the most succesful recording I have made in terms of acclaim and sales.\n\nIt was Melody Maker's Album of the Year in 1981 and in 1989 it was voted in the Critics' Poll, and more important to me, the Readers' Poll, in Folk Roots as Album of the Decade. I have had hundreds of reviews, good and bad, and I pay little attention to them. But when the actual people you're playing to confer an honour like that upon you, you shed the odd tear of thanks that you've been privileged to be able to do something which means something to them.Why they voted it such was a complete mystery to me then and still is today. As a friend of mine says, 'Never ask one of the actors what they thought of the play'.\n\nAfter leaving Five Hand Reel at the end of 78 my life appeared to disintegrate. I had had bouts of depression and mental illness on and off for several years and ended up having a total breakdown in 79 - the years of excessive consumption of alcohol etc and unhealthy living, which at that time were all an inevitable part of life on the road, had finally caught up. I spent the next 2 years trying to get some solo gigs again but it was very difficult - I didn't exactly have a reputation for being stable or reliable - and for most of these 2 years I did very little but work on getting back to health, apart from the odd short tour in Europe, including the making of the Folk Friends 2 album. I was still under contract to make another album for Topic and finally felt well enough to tackle it. \n\nA bit of background to the making of this album.\n\nJust before my breakdown, May 79, the Conservatives under Margaret Thatcher had won the General Election with a majority in England but a minority in Scotland and Wales and we were saddled with the most extreme Rightwing Government of my lifetime. We had just had the Devolution Referendum debacle and people in Scotland, particularly on the Left, were reeling under the economic consequences of the Thatcher strategy for solving inflation by crashing the economy and creating mass unemployment.\n\nWhat seemed to be required was to openly stand up and be counted. Although all my solo albums prior to this had included songs which reflected my political ideas, they had been more as chronicler than as protagonist. It was quite clearly time to stop reporting and start participating.&quot;","torrent":{"xt":"urn:btih:59589031a38f2f0f639dd0e0e4c592ef1d89082a","amp;dn":"Dick+Gaughan+-+Handful+of+Earth+%5B1981%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59589031a38f2f0f639dd0e0e4c592ef1d89082a","infoHashBuffer":{"type":"Buffer","data":[89,88,144,49,163,143,47,15,99,157,208,224,228,197,146,239,29,137,8,42]},"announce":[],"urlList":[]}}