{"title":"The Bond Book, Third Edition","uid":14273891,"size":6639932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:595d89b1ac28de865ee4cd5e13d7bd342acab0eb&amp;dn=The+Bond+Book%2C+Third+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dwizzlex10","files":1,"time":1460330463,"description":"The financial crisis of 2008 caused major disruptions to every sector of the bond market and left even the savviest investors confused about the safety of their investments. To serve these investors and anyone looking to explore opportunities in fixed-income investing, former bond analyst Annette Thau builds on the features and authority that made the first two editions bestsellers in the thoroughly revised, updated, and expanded third edition of The Bond Book.\r\n\r\nThis is a one-stop resource for both seasoned bond investors looking for the latest information on the fixed-income market and equities investors planning to diversify their holdings. Writing in plain English, Thau presents cutting-edge strategies for making the best bond-investing decisions, while explaining how to assess risks and opportunities. She also includes up-to-date listings of online resources with bond prices and other information. Look to this all-in-one guide for information on such critical topics as:\r\n\r\nBuying individual bonds or bond funds\r\nThe ins and outs of open-end funds, closed-end funds, and exchangetraded funds (ETFs)\r\nThe new landscape for municipal bonds: the changed rating scales, the near demise of bond insurance, and Build America Bonds (BABs)\r\nThe safest bond funds\r\nJunk bonds (and emerging market bonds)\r\nBuying Treasuries without paying a commission read more","torrent":{"xt":"urn:btih:595d89b1ac28de865ee4cd5e13d7bd342acab0eb","amp;dn":"The+Bond+Book%2C+Third+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"595d89b1ac28de865ee4cd5e13d7bd342acab0eb","infoHashBuffer":{"type":"Buffer","data":[89,93,137,177,172,40,222,134,94,228,205,94,19,215,189,52,42,202,176,235]},"announce":[],"urlList":[]}}