{"title":"Render - Spanning Time with Ani DiFranco (DVDrip x264 AC3)","uid":6359912,"size":617193198,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:59638a9708e71a147d1a37e76ca404ee4f650955&amp;dn=Render+-+Spanning+Time+with+Ani+DiFranco+%28DVDrip+x264+AC3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"opalever","files":1,"time":1304298307,"description":"Join Ani DiFranco, her band, and members of the extended Righteous Babe family as they crisscross the country in this long-awaited, one-of-a-kind portrait of the Li'l Folksinger at work. Videographers spent years on Ani's trail, capturing her onstage, in the studio, and on the tour bus--footage which Ani herself shaped into a very personal self-portrait. The resulting movie, which draws on material from as far back as 1997, focuses on her 2000 and 2001 tours. This impressionistic collage takes you way behind the scenes; you'll watch a new song take shape and learn the stories behind some favorite older ones. Over two dozen songs are featured, including two brand new Ani songs and previously unreleased live versions of many of her classics. As dynamic, thought-provoking, and fun as one of her concerts, Render gives you a sneak peek into Ani's life and music in her own words, on her own terms. It's a visual live album, it's a road film, it's an art flick, it's a document of a movement in time.\n\n\nVIDEO\nCodec: AVC (x264)\nBitrate: 544 Kbps\nResolution: 640x480\nFramerate: 29.97\n\nAUDIO\nCodec: AC-3\nBitrate: 192 Kbps\nChannels: 2 (Stereo)\n\nNote: The opening of this DVD was intentionally done in an artistic style that looks choppy. Please don't confuse that with this being a bad-quality rip. :)","torrent":{"xt":"urn:btih:59638a9708e71a147d1a37e76ca404ee4f650955","amp;dn":"Render+-+Spanning+Time+with+Ani+DiFranco+%28DVDrip+x264+AC3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59638a9708e71a147d1a37e76ca404ee4f650955","infoHashBuffer":{"type":"Buffer","data":[89,99,138,151,8,231,26,20,125,26,55,231,108,164,4,238,79,101,9,85]},"announce":[],"urlList":[]}}