{"title":"The Maytals - Do The Reggae 1966-70 (1988) [FLAC]","uid":6320228,"size":247188374,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b089d08f34f829a5622acb4f8404f4d845db74d&amp;dn=The+Maytals+-+Do+The+Reggae+1966-70+%281988%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1302924290,"description":"The Maytals\nDo The Reggae 1966-70 (1988)\n\n\n\nThis is not my rip. I'm just sharing. I think it's a vinyl rip but not sure. It has some slight crackling. But very listenable. Enjoy.\n\n\nThe consummate vocal group, the Maytals are inextricably tied to Jamaica's musical history, and their long and prolific career has seen the group at the forefront of virtually every shift in musical direction up until the ragga era. Their influence has been so vast, both on their homeland and abroad, their canon of music so immense, that in many ways no band better represents the island's sound than their own. The Maytals formed in 1962, bringing together the vocal talents of Frederick &quot;Toots&quot; Hibbert, Nathaniel McCarthy (aka Jerry Matthias), and Henry &quot;Raleigh&quot; Gordon. Matthias was the only one of the trio with any name recognition. Born in 1939, in Portland, Jamaica, the singer had moved to Kingston and cut a single for producer Duke Reid in 1958, while still in his teens. However, the song wasn't successful enough for Reid to record the youngster again. Hibbert hadn't even gotten that far.\n\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nAudio Quality:\t\tPerfect (Lossless)\nContains:\t\tAlbum Art, CRC, ID Tag [Vorbis Comments]\nM3U File:\t\tYes\n\nFormat:\t\t\tFlac\nGenre:\t\t\tReggae\t\nLabel:\t\t\tAttack Records\n\n\n\nThe Maytals released a deluge of singles in the late '60s, slews of them were hits, with the bulk also seeing release in Britain, while many were also bundled on to full-length albums. Which rather begs the question why most modern compilations seem to inevitably draw from the same much smaller pot of songs, leaving vast swaths of the trio's canon moldering away in the archives. Do the Reggae 1966-70 attempts to redress this wrong, weighing the set heavily towards less compiled numbers. First though, a note on the title's dates. Only &quot;Bam Bam&quot; pre-dates 1968, not that surprising really, as it was one of the few songs the trio had time to record before Toots Hibbert was arrested and jailed in 1966. Upon his release in 1968, the trio went into overdrive, recording at a fever pitch right up to the untimely death of their producer Leslie Kong in 1971. Do the Reggae however, hones in on the period immediate following Hibbert's release, 1968-1969, with only 1971's &quot;Johnny Cool Man&quot; falling later. So much for the nit-picking, it's the fabulous music within that really matters. &quot;Bam Bam,&quot; the trio's winning number at Jamaica's first Independence Song Festival gets the party started, a potent reminder of their standing before Hibbert's arrest, &quot;Struggle&quot; recalls that terrible period of confinement, &quot;Reborn&quot; the faith that saw him through, &quot;54-46 That's My Number&quot; celebrates his freedom, while &quot;Bim Today&quot; revisits &quot;Bam Bam&quot;'s greatness, at least musically. From there on out, the Maytals move towards more universal, everyday concerns: love, romance and marriage, nostalgia for &quot;School Days,&quot; and the always popular game of musical king of the hill, with the band boasting of their toughness and coolness. Easily returning to their ska peaks, the trio's performances were astonishing throughout this period (and beyond), be it the intricate vocal arrangement of &quot;School Days&quot; or Hibbert's soulful tour de force on &quot;Reborn,&quot; the exhilaration of their gospel-fired harmonies, or the more pop-inflected, sweeter styling they occasionally dipped into as on &quot;Just Tell Her.&quot; The Maytals' really were virtually beyond compare at this point, as was Kong's splendid productions, and his studio band Beverley's All Stars sensational backings. No matter how many Maytals' albums you own, chances are there's a still a clutch of songs here you don't have, and you definitely want to hear them all. \n\n\nTrack List:\n\n01.Bam Bam\n02.54-46 That's My Number\n03.Struggle\n04.Reborn\n05.Just Tell Me\n06.Do The Reggay\n07.School Days\n08.Bim Today\n09.Hold On\n10.Don't Trouble Trouble\n11.Alidina\n12.Sweet &amp; Dandy\n13.Oh Yeah\n14.Water Melon\n15.Johnny Cool Man\n16.Night And Day\n\n\n\n\n\n\n\n\n\n\n          ****Support the artists &amp; buy it if you like it.****\n\n              ****Enjoy &amp; please don't forget to seed!****\n\n\n\n\n","torrent":{"xt":"urn:btih:5b089d08f34f829a5622acb4f8404f4d845db74d","amp;dn":"The+Maytals+-+Do+The+Reggae+1966-70+%281988%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b089d08f34f829a5622acb4f8404f4d845db74d","infoHashBuffer":{"type":"Buffer","data":[91,8,157,8,243,79,130,154,86,34,172,180,248,64,79,77,132,93,183,77]},"announce":[],"urlList":[]}}