{"title":"[SoM]Incontri ravvicinati del terzo tipo[DvdRip-DivX5-Ita-Mp3]","uid":4488810,"size":909979648,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b54202f2901c32e92eabe1958041a9efa4e7c3b&amp;dn=%5BSoM%5DIncontri+ravvicinati+del+terzo+tipo%5BDvdRip-DivX5-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1225891284,"description":"Il film ÃƒÂ¨ diviso fondamentalmente in due episodi, strettamente intrecciati tra loro.\nIl primo episodio vede protagonista una madre e suo figlio, misteriosamente rapito da parte dei temuti alieni, che ormai appaiono spesso nel piccolo paesino nel quale abitano da piÃƒÂ¹ di una settimana, spaventando gli abitanti; appaiono con le loro navi nel cielo e brillano come stelle di vari colori. Il secondo episodio narra di un uomo il quale, sulla via del ritorno a casa, si trova fermo nel bel mezzo della strada con un UFO sopra la sua auto; presto l&amp;#039;uomo, Roy (Richard Dreyfuss) si incontrerÃƒÂ  con la madre, Jillian (Melinda Dillon), e il bambino, Barry (Cary Guffey), che ancora non ÃƒÂ¨ stato rapito.\nLa vita dei due ÃƒÂ¨ profondamente sconvolta dalla continua visione di una forma che cercano di ricreare in ogni modo: con la schiuma da barba, col purÃƒÂ¨ di patate addirittura e perfino con la terra del giardino! Ma gli episodi sono soltanto un ulteriore coinvolgimento, perchÃƒÂ© un altro episodio viene creato come cardine tra questi episodi: ÃƒÂ¨ quello che coinvolge il francese studioso Claude (FranÃƒÂ§ois Truffaut). Egli infatti lavora per il governo degli Stati Uniti da quando una squadriglia di caccia militari viene ritrovata in Messico dopo essere stata (presumibilmente) rapita dagli alieni.\nSuccessivamente, nel deserto del Gobi, in Mongolia, viene ritrovata una porta-aerei, anch&amp;#039;essa sequestrata dai misteriosi esseri svariati anni prima. Sempre nel deserto del Gobi, i terrorizzati abitanti di un villaggio informano Claude dello strano suono sentito prima che apparisse la porta-aerei. L&amp;#039;esercito degli Stati Uniti, compreso ormai il luogo dove queste entitÃƒÂ  vogliono farsi scoprire, decide di smantellare la zona attorno la Torre del Diavolo, una gigantesca montagna; per far sgomberare gli abitanti, l&amp;#039;esercito dÃƒÂ  la falsa informazione che proprio lÃƒÂ¬ intorno si ÃƒÂ¨ rovesciato un carico di un gas mortale.\nQuando le telecamere dei giornalisti inquadrano la montagna, Roy capisce che la forma che lui ha disegnato e cercato di ricreare in ogni modo ÃƒÂ¨ la Torre del Diavolo! CosÃƒÂ¬, lui e Jillian, incontratisi casualmente, decidono di oltrepassare le frontiere che l&amp;#039;esercito ha messo, sfidando il presunto pericolo e andando inconto alla montagna. Quando, ben presto, giunge la notte, Jillian e Roy assisteranno al piÃƒÂ¹ strabiliante di tutti gli &quot;Incontri ravvicinati del terzo tipo&quot;.","torrent":{"xt":"urn:btih:5b54202f2901c32e92eabe1958041a9efa4e7c3b","amp;dn":"%5BSoM%5DIncontri+ravvicinati+del+terzo+tipo%5BDvdRip-DivX5-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b54202f2901c32e92eabe1958041a9efa4e7c3b","infoHashBuffer":{"type":"Buffer","data":[91,84,32,47,41,1,195,46,146,234,190,25,88,4,26,158,250,78,124,59]},"announce":[],"urlList":[]}}