{"title":"Wings.of.Life.(aka.Pollen).2011.1080p.BluRay.MULTIAUDIO.x264.AC3","uid":10213995,"size":11180194814,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5be9a435ccd6812bd13dc4aeb15cd1a9027d36e9&amp;dn=Wings.of.Life.%28aka.Pollen%29.2011.1080p.BluRay.MULTIAUDIO.x264.AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shadoe.federation","files":1,"time":1400942777,"description":"So this is a custom built file. My kids watched this on netflix and I wanted to see a true 1080p copy of this. Sadly, only a 720p copy is floating around on here and it's only in French (which is NOT stated in the description, but blatantly says English). I Did some digging around the net (the &quot;power&quot; of google, LOL) and found a thread here on KAT where someone posted a link to a French-torrent site that had a 1080p copy. Sadly it was also ONLY in French. Searched the internet for subtitles and also nothing. Then I found an NTSC DVD iso of the movie with DD 5.1 language tracks in Spanish, French, and ENGLISH (YAY!) that also contained English subtitles. The 1080p video source was PAL (so at 25fps) and contained DTS-HDMA 5.1 French audio. I re-tempo'ed the French audio to NTSC speed (-4.096% tempo adjustment in Audacity), then re-encoded the DTS-HDMA French Audio using the DTS-MA Suite 2.6 program. Then I checked the audio from the DVD to see how it aligns with the BluRay and it was 65ms ahead so I set a delay of -65ms for the English and Spanish audio so as NOT to re-encode them since they are lossy AC3 5.1 @ 384kbps. There are also PGS and SRT format ENGLISH subtitles that are synced to the BluRay that I got off the Closed Captioning Subtitles that were on the NTSC DVD iso. Then muxed it all together with MKVmerge and here you go folks;)\n\nIMHO, the 5.1 AC3 track sounds ok (and it's great that it's in English) but WOW that lossless 5.1 DTS-HDMA French track is AMAZING! In fact, I watched it with the English subtitles and was happy with it that way because the lossy AC3 just doesn't do all the sounds of nature any justice. I checked to see if I can make a custom English lossless track using the French DTS-HDMA track and just removing the center channel (since that's where most of the vocals usually are) but there is a ton of &quot;bleading&quot; of the French voiceover in Front and Rear channels so that was a no-go :(\n\nEither way, here's a 1080p copy of the movie, with ENGLISH 5.1 audio and ENGLISH subtitles!\n\nEnjoy and don't forget to seed;)","torrent":{"xt":"urn:btih:5be9a435ccd6812bd13dc4aeb15cd1a9027d36e9","amp;dn":"Wings.of.Life.%28aka.Pollen%29.2011.1080p.BluRay.MULTIAUDIO.x264.AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5be9a435ccd6812bd13dc4aeb15cd1a9027d36e9","infoHashBuffer":{"type":"Buffer","data":[91,233,164,53,204,214,129,43,209,61,196,174,177,92,209,169,2,125,54,233]},"announce":[],"urlList":[]}}