{"title":"Thermal-Hydraulic Analysis of Nuclear Reactors","uid":13926508,"size":18076534,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c46edcbac27d6b65ed4db10e31df1978424009f&amp;dn=Thermal-Hydraulic+Analysis+of+Nuclear+Reactors&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1458384782,"description":"ISBN 978-3-319-17433-4\r\n\r\nThis text covers the fundamentals of thermodynamics required to understand electrical power generation systems and the application of these principles to nuclear reactor power plant systems. It is not a traditional general thermodynamics text, per se, but a practical thermodynamics volume intended to explain the fundamentals and apply them to the challenges facing actual nuclear power plants systems, where thermal hydraulics comes to play. Written in a lucid, straight-forward style while retaining scientific rigor, the content is accessible to upper division undergraduate students and aimed at practicing engineers in nuclear power facilities and engineering scientists and technicians in industry, academic research groups, and national laboratories. The book is also a valuable resource for students and faculty in various engineering programs concerned with nuclear reactors.\r\n\r\nThis book also:\r\n\r\nProvides extensive coverage of thermal hydraulics with thermodynamics in nuclear reactors, beginning with fundamental definitions of units and dimensions, thermodynamic variables, and the Laws of Thermodynamics progressing to sections on specific applications of the Brayton and Rankine cycles for power generation and projected reactor systems design issues\r\nReinforces fundamentals of fluid dynamics and heat transfer; thermal and hydraulic analysis of nuclear reactors, two-phase flow and boiling, compressible flow, stress analysis, and energy conversion methods\r\nIncludes detailed appendices that cover metric and English system units and conversions, detailed steam and gas tables, heat transfer properties, and nuclear reactor system descriptions","torrent":{"xt":"urn:btih:5c46edcbac27d6b65ed4db10e31df1978424009f","amp;dn":"Thermal-Hydraulic+Analysis+of+Nuclear+Reactors","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c46edcbac27d6b65ed4db10e31df1978424009f","infoHashBuffer":{"type":"Buffer","data":[92,70,237,203,172,39,214,182,94,212,219,16,227,29,241,151,132,36,0,159]},"announce":[],"urlList":[]}}