{"title":"Engrenages   (BBC 2011 - Complete Series)","uid":6712421,"size":4406748159,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5c562e094ccd010a94e7eab46780800ad7613dd5&amp;dn=Engrenages+++%28BBC+2011+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":17,"time":1317407353,"description":"TV : Crime : HD : French\n\n\nThis torrent contains all eight episodes of the BBC transmission of Series 1 of Engrenages (Spiral).\n\nMain Cast:\n\nCaroline Proust: Police Captain Laure Berthaud\nGrÃƒÂ©gory Fitoussi: Deputy Prosecutor Pierre ClÃƒÂ©ment\nPhilippe Duclos: Judge FranÃƒÂ§ois Roban\nFred Bianconi: Police Lieutenant FrÃƒÂ©dÃƒÂ©ric &quot;Tintin&quot; Fromentin\nThierry Godard: Police Lieutenant Gilles &quot;Gilou&quot; Escoffier\nAudrey Fleurot: Lawyer JosÃƒÂ©phine Karlsson.\n\nVideo:\n\nThe dialogue is the original French and English subtitles are hardcoded onto the video. The video is 16:9 and includes the BBC dog (Digital on-screen graphic). Please note that although the video is HD resolution (832x468), it will play fine on a computer.\n\nEpisode 1\n\nA young woman is found brutally murdered and dumped in a skip. Leading the investigation is young public prosecutor Pierre Clement, who teams up with no-nonsense police captain Laure Berthaud and investigating magistrate Judge Roban. Together, they must establish the identity of the victim and get to the perpetrators while navigating a tangled web of political intrigue, prostitution and drugs - each with a different vision of justice, each with their own personal demons.\n\nDuration 47:45\n\nEpisode 2\n\nPierre must face the possibility that some of his nearest and dearest could be implicated in the murder case he is following, which is now linked to some very high-ranking names. Laure Berthaud's team investigate the apparent murder of a baby by his babysitter, while ambitious young lawyer Josephine Karlsson is recruited as the public half of a new legal partnership.\n\nDuration 50:57\n\nEpisode 3\n\nWhen the body of a well-known businessman is found charred to death in his home, police must delve into the details of his personal life. Meanwhile, prosecutor Pierre Clement's friendship with a prominent suspect linked to the brutal Andrescu murder has become impossible to hide. Gilout's drug habit gets out of control. Ghisele, the mother of the murdered baby, finds herself the target of an inquiry about negligent parenting and takes counsel from lawyer Josephine Karlsson.\n\nDuration 50:42\n\nEpisode 4\n\nThe web of names involved in the brutal murder of Elina Andrescu widens to include a prominent ministerial adviser, who has links to prosecutor Pierre Clement's close friend Benoit Faye. Lawyer Josephine Karlsson and police captain Laure Berthaud come face to face in court when Laure becomes the object of an enquiry into the fatal shooting of two police suspects.\n\nDuration 49:28\n\nEpisode 5\n\nThe inquiry into Elina Andrescu's murder takes yet another disturbing turn when the body of her missing sister Sophia is found in a freezer. Prosecutor Pierre Clement must recognise that the involvement of his friend Benoit Faye goes deeper than he'd been prepared to believe. A distraught and vulnerable Ghisele Anloux is brought to trial in connection with the murder of her baby - though judge Roban soon comes to regret his meddling in the affair.\n\nDuration 48:25\n\nEpisode 6\n\nPierre Clemente initiates divorce proceedings when estranged wife Marianne and her family business become implicated in a drug trafficking scandal. Lawyer Josephine Karlsson is called in to defend a man who is charged with brutal acts of torture. Gilou loses control of his drug addiction, testing the loyalty of boss Captain Laure Berthaud.\n\nDuration 47:50\n\nEpisode 7\n\nPierre Clemente finally resolves to have friend Benoit Faye arrested in connection with the Andrescu case, unwittingly putting Benoit's life in danger. Meanwhile, lawyer Josephine Karlsson is called in to defend a young man accused of rape, while blackmailed Gilout is compromised.\n\nDuration 49:14\n\nEpisode 8\n\nWith Benoit Faye in intensive care following an assassination attempt, the prosecution in the Andrescu case has lost its main witness. The shady events leading up to the double murder of the Andrescu sisters are reconstructed through Benoit's memories - from his relationship with beautiful Elina to the involvement of debauched ministerial advisor Arnaud Laborde.\n\nDuration 46:49\n\nVideo &amp; Audio info:\n\nCodec: H264 - MPEG-4 AVC (part 10) (avc1)\nResolution: 832x468\nFrame rate: 25\n\nCodec: MPEG AAC Audio (mp4a)\nChannels: Stereo\nSample rate: 48000 Hz\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5c562e094ccd010a94e7eab46780800ad7613dd5","amp;dn":"Engrenages+++%28BBC+2011+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c562e094ccd010a94e7eab46780800ad7613dd5","infoHashBuffer":{"type":"Buffer","data":[92,86,46,9,76,205,1,10,148,231,234,180,103,128,128,10,215,97,61,213]},"announce":[],"urlList":[]}}