{"title":"The Far Enemy: Why Jihad Went Global, 2nd ed","uid":5994085,"size":1262154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c7597f539d50307a191b86cb45706e781f0e79a&amp;dn=The+Far+Enemy%3A+Why+Jihad+Went+Global%2C+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1290981699,"description":"Cambridge University Press \nNumber Of Pages: 400 \nPublication Date: 2009-04-06  \n\nFawaz Gerges' book on al Qaeda and the jihadist movement has become a classic in the field since it was published in 2005. Here he argued that far from being an Islamist front united in armed struggle, or jihad against the Christian West, as many misguided political commentators and politicians opined, al Qaeda represented a small faction within the jihadist movement, criticized by other groups who preferred to concentrate on changing the Muslim world, rather than attacking the Far Enemy and making the fight global. In the intervening years, with the advance of the 'War on Terror' and the invasion of Iraq, much has changed and, just as Gerges showed, al Qaeda's fortunes have taken a significant downturn. Revisiting The Far Enemy in this new edition, Gerges demonstrates that not only have the jihadists split ranks, but that voices from within the ultra-religious right, those that previously supported al Qaeda, are condemning its tactics as violent, unethical, and out of accord with the true meaning of jihad. In fact, millions of Muslims worldwide have rejected al-Qaeda's ideology and strategies and blame Osama bin Laden and his cohorts for the havoc the organisation has wrecked on their communities. Al-Qaeda is now in the wilderness suffering massive erosion of authority and legitimacy in Muslim eyes and facing a fierce revolt from within. As Gerges warns, the next US administration would do well to use political and socio-economic strategies rather than military means to ensure that it stays there.\n\n\n\n\n","torrent":{"xt":"urn:btih:5c7597f539d50307a191b86cb45706e781f0e79a","amp;dn":"The+Far+Enemy%3A+Why+Jihad+Went+Global%2C+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7597f539d50307a191b86cb45706e781f0e79a","infoHashBuffer":{"type":"Buffer","data":[92,117,151,245,57,213,3,7,161,145,184,108,180,87,6,231,129,240,231,154]},"announce":[],"urlList":[]}}