{"title":"Robinson-Dungeon,Fire&amp;Sword-Knights Templar in Crusades(1991)","uid":5978724,"size":2605163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c7dfb4d26f74ae6360487abf16e6a243b70cb8e&amp;dn=Robinson-Dungeon%2CFire%26Sword-Knights+Templar+in+Crusades%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1290525745,"description":"This is John J. Robinson's mindblowing book Dungeon, Fire, &amp; Sword - The Knights Templar in the Crusades (1991) which is a gripping history of the Order of Knights Templar and the dramatics events they were involved into. With more colorful characters and startling plot twists than the most dramatic of novels, it immerses the reader in an historical era where the blood flows freely, tribal antagonisms run deep, and betrayal lurks around every corner. The time is the Crusades and the place is the Middle East, where a fearless band of monk-warriors called the Knights Templar have vowed to protect Christian pilgrims to the Holy Land. The story of their faith and courage - and the horrors of their ultimate betrayal - has resonated throughout history. This amazing book separates fact from the large amount of fiction that surrounds the Knights Templar and offers valuable insights into the people and politics of the Middle East that are strikingly relevant today. It's filled with famous figures such as Richard the Lionhearted, St. Francis of Assisi, St. Thomas Aquinas, Marco Polo, and Genghis Khan. It also explores the question of missing Templar treasure and whether a secret succession of underground grand masters exists to this day. Dungeon, Fire, &amp; Sword is a brilliant work of narrative history and a vivid account of that incredible time. 495 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:5c7dfb4d26f74ae6360487abf16e6a243b70cb8e","amp;dn":"Robinson-Dungeon%2CFire%26Sword-Knights+Templar+in+Crusades%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c7dfb4d26f74ae6360487abf16e6a243b70cb8e","infoHashBuffer":{"type":"Buffer","data":[92,125,251,77,38,247,74,230,54,4,135,171,241,110,106,36,59,112,203,142]},"announce":[],"urlList":[]}}