{"title":"jQuery UI 1.6: The User Interface Library for jQuery","uid":4734828,"size":8009097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5cea22ff4e7ea957eced67c5fb85b9dbaee5a631&amp;dn=jQuery+UI+1.6%3A+The+User+Interface+Library+for+jQuery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":-1,"time":1235229458,"description":"Modern web application user interface design requires rapid development and proven results. jQuery UI, a trusted plugin for the jQuery JavaScript library, gives you a trusted platform on which to build rich and engaging interfaces with maximum compatibility, stability, and a minimum of time and effort.\n\njQuery UI has a series of ready-made, great-looking user interface widgets and a comprehensive set of core interaction helpers designed to be implemented in a consistent and developer-friendly way. With all this, the amount of code that you need to write personally to take a project from conception to completion is drastically reduced This book has been written to maximize your experience with the library by breaking down each component and walking you through examples that progressively build upon your knowledge, taking you from beginner to advanced usage in a series of easy to follow steps.\n\nIn this book, you'll learn how each component can be initialized in a basic default implementation and then see how easy it is to customize its appearance and configure its behaviour to tailor it to the requirements of your application. You'll look at the properties and methods exposed by each component's API and see how these can be used to bring out the best in each component.\n\nEvents play a key role in any modern web applications if it is to meet the expected minimum requirements of interactivity and responsiveness, and each chapter will show you the custom events fired by each component and how these events can be intercepted and acted upon.\n\nApproach\n\nAn example-based approach leads you step-by-step through the implementation and customization of each library component and its associated resources in turn. To emphasize the way that jQuery UI takes the difficulty out of user interface design and implementation, each chapter ends with a `fun with' section that puts together what you've learned throughout the chapter to make a usable and fun page. In these sections you'll often get to experiment with the latest associated technologies like AJAX and JSON.\n\nThis book is for front-end designers and developers that need to quickly learn how to use the jQuery UI User Interface Library. To get the most out of this book you should have a good working knowledge of HTML, CSS and JavaScript, and will need to be comfortable using jQuery, the underlying foundation of jQuery UI.\n\nWhat you will learn from this book?\n\n* Organize different sections of related content as tabs and accordins and save space on your page\n* Display messages, images, and interactive content like forms using the dialog widget\n* Use sliders for volume and color control of your applications by dynamically scrolling left and right, displaying different ranges\n* Allow your site visitors to select dates from the calendar using date picker widget\n* Enrich your interface with auto complete: start typing the first few letters of a name in your address book and the application will do the rest\n* Provide a drag-and-drop mechanism to let users directly rearrange elements around the page\n* Make a range of elements of a group selectable and take collective actions on them\n* Create a page with content boxes on it that can be sorted into various positions to suit the visitors personal preference\n* Add flair to your actions with animation effects","torrent":{"xt":"urn:btih:5cea22ff4e7ea957eced67c5fb85b9dbaee5a631","amp;dn":"jQuery+UI+1.6%3A+The+User+Interface+Library+for+jQuery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cea22ff4e7ea957eced67c5fb85b9dbaee5a631","infoHashBuffer":{"type":"Buffer","data":[92,234,34,255,78,126,169,87,236,237,103,197,251,133,185,219,174,229,166,49]},"announce":[],"urlList":[]}}