{"title":"The Real History Behind The Da Vinci Code - (Malestrom)","uid":4638056,"size":16240003,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d5a3d1522997576f07220417471e2edc34bd11f&amp;dn=The+Real+History+Behind+The+Da+Vinci+Code+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1231620785,"description":" &lt;a href=&quot;http://www.image-upload.net/images/eyuzfow2brm1kjy9l43k.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/eyuzfow2brm1kjy9l43k.jpg&lt;/a&gt;\n\nDan Brown's novel The Da Vinci Code caused a huge sensation when it came out in 2003. The book, a modern twist on the Holy Grail quest, has sold over 20 million copies in 42 languages. It claimed to reveal an extraordinary alternate history of the Western world, including the existence of Jesus Christ's surviving bloodline, which was protected for 2,000 years by a secret society called the Priory of Sion. The question is: How much of the novel is true? Not a lot, according to Sharan Newman, a medieval novelist and scholar. Her book, The Real History Behind the Da Vinci Code, investigates the historical figures, places, and events behind Brown's thriller. While The Da Vinci Code is a great yarn, she writes, it makes numerous factual distortions and was largely inspired by another book, Holy Blood, Holy Grail, that is far from credible.\n\nThe real Priory of Sion, Newman writes, was founded in the 1950s by a French far-right extremist named Pierre Plantard, who tried to pass himself off as a descendant of Dagobert II and, therefore, as the rightful king of France. Newman writes that French historians have discredited Plantard's claims as a hoax. In The Da Vinci Code, the Priory is said to have been led by an illustrious line of grand masters, including Leonardo Da Vinci. Newman writes that Leonardo, while certainly a genius, was famously erratic, undependable, and easily distracted--far too flaky, she suggests, to be chosen to lead any group, let alone one supposedly as secret and important as the Priory. Newman says The Da Vinci Code also makes basic mistakes about Parisian geography, the layout of the Louvre museum, and important facts of French and biblical history. So did Jesus have children? Newman says there is no evidence for that either. Overall, her book is a salient reminder that fiction is sometimes just that. --Alex Roslin --This text refers to the Paperback edition.\n\nBook Description\nMillions have been enthralled by The Da Vinci Code's fascinating historical speculations-and the blockbuster novel's audience has also made bestsellers of several books offering to separate the facts from the fiction. This comprehensive, encyclopedic volume is written by an acclaimed medievalist-and takes an objective, history-based approach to the phenomenon and the questions it has raised.\n\nThe Real History Behind the Da Vinci Code gives easy-to-find, clear answers about the people, places, and events that play roles in Dan Brown's tantalizing thriller in a lively, encyclopedic format-shedding new light on some of the deepest mysteries of the Dark Ages.\n\nFurther, the author has visited all of the sites in France and England which are settings in The Da Vinci Code, offering unprecedented insight into these locations--for armchair travellers, or for fans who wish to go and visit these sites themselves.","torrent":{"xt":"urn:btih:5d5a3d1522997576f07220417471e2edc34bd11f","amp;dn":"The+Real+History+Behind+The+Da+Vinci+Code+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5a3d1522997576f07220417471e2edc34bd11f","infoHashBuffer":{"type":"Buffer","data":[93,90,61,21,34,153,117,118,240,114,32,65,116,113,226,237,195,75,209,31]},"announce":[],"urlList":[]}}