{"title":"The.Banquet.2006.DVDRip.XviD-ESPiSE","uid":3612774,"size":1473964655,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5d620d6a603dbe747155e77822f000e154d66ee8&amp;dn=The.Banquet.2006.DVDRip.XviD-ESPiSE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thachinky","files":7,"time":1170840058,"description":"Director Feng Xiaogang&amp;#039;s The Banquet, which premiered at the prestigious Venice film festival and screened at many other major festivals, became Hong Kong&amp;#039;s submission to the Oscars this year. This epic features multiple award-winning actor Ge You, Feng&amp;#039;s long-time collaborator, as a cunning emperor. The internationally popular Zhang Ziyi returns to Chinese cinema to portray a queen who experiences intense inner struggle. Hong Kong handsome prince Daniel Wu and best actress winner Zhou Xun from Perhaps Love also excel in delivering their roles. Inspired by the Shakespearean play Hamlet, The Banquet unfolds a story about power struggle in the royal court, which eventually climaxes at a night banquet.\n\nThe film promises a thrilling visual experience with its carefully designed details. Tan Dun and Timmy Yip, both Oscar winners for Crouching Tiger, Hidden Dragon, team up again in this project, offering wonderful art direction and captivating music respectively. Action choreographer Yuen Woo Ping designs the dazzling fighting scenes in The Banquet to enrich the film&amp;#039;s aesthetic dimension, which deserves as much applause as its fascinating story.\n\nZhang Ziyi stars as the young Empress Wan, who used to be in love with Prince Wu Luan (Daniel Wu) but is now his step-mother. The late emperor&amp;#039;s brother Li (Ge You) comes to throne and sees Wu Luan, now living away from the palace indulging himself in arts, a great threat to his power. He sends assassins to kill Wu Luan but the mission fails. The young prince returns to the palace and meets Empress Wan, who is newly married to Li, and a young girl Qing (Zhou Xun) who falls for him. Emperor Li decides to host a banquet, but everyone has a hidden agenda when they attend...","torrent":{"xt":"urn:btih:5d620d6a603dbe747155e77822f000e154d66ee8","amp;dn":"The.Banquet.2006.DVDRip.XviD-ESPiSE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d620d6a603dbe747155e77822f000e154d66ee8","infoHashBuffer":{"type":"Buffer","data":[93,98,13,106,96,61,190,116,113,85,231,120,34,240,0,225,84,214,110,232]},"announce":[],"urlList":[]}}