{"title":"Chaka Khan - Through The Fire  (2nafish)","uid":5213290,"size":148516868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5e679f77fc0ac136099b23ed4a20792b6837616e&amp;dn=Chaka+Khan+-+Through+The+Fire++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1260690694,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Through the Fire&quot; is a song from Chaka Khan's 1984 album, I Feel for You. The David Foster-produced track was the second single from the album, which set a record (which has since been broken) for spending the most consecutive weeks on the Billboard Hot 100. The song was sampled by Kanye West in &quot;Through the Wire&quot;. It reached #60 in the US and #15 on the R&amp;B Charts, and was one of the few Khan hits to cross to the Adult Contemporary chart.\n\nI Feel for You is the Platinum certified sixth solo album by American R&amp;B/funk singer Chaka Khan, released on the Warner Bros. Records label in 1984.\n\nAfter having balanced her two simultaneous careers as a member of the band Rufus and a solo performer during the years 1978 to 1983, which culminated with the release of the final Rufus &amp; Chaka Khan album Stompin' at the Savoy - Live after which the band dissolved, Khan recorded the album that was to make her a pop star with mainstream chart success; 1984's &quot;I Feel for You&quot;.\n\nThe title track, &quot;I Feel for You&quot; was a sample-heavy cover of a 1979 Prince track, featuring Grandmaster Melle Mel on the classic Ch-ch-ch-chaka-chaka-chaka Khan rap intro and Stevie Wonder on harmonica (and also a sample from one of his first hits, &quot;Fingertips Part 2&quot;) and saw Khan embracing high-tech funk, rap and hip hop and stands as one of her best known songs and her biggest commercial hit, reaching #3 on the US Pop Chart, #1 on both US R&amp;B and US Dance as well as topping the UK singles chart - and it also earned her a second consecutive Grammy Award in 1985 for Best R&amp;B Vocal Performance, Female, following &quot;Ain't Nobody&quot; with Rufus. Further hit singles from the album which reached #16 on Billboard's Pop Chart, #4 on R&amp;B and also #15 on the UK albums chart were &quot;This Is My Night&quot; (US #60, R&amp;B #11, US Dance #1, UK #14), &quot;Eye To Eye&quot; (UK #16 ) and the ballad &quot;Through The Fire,&quot; which also reached the US R&amp;B top ten, setting a then-record for most consecutive weeks on the Billboard R&amp;B chart. It also rose to #60 on the Pop chart during a 19-week run on the Hot 100, and crossed over to the adult contemporary chart (US Pop #60, US R&amp;B #15, US AC #16, UK #77). &quot;Through the Fire&quot; has since been sampled by Kanye West for his 2003 hit single &quot;Through the Wire&quot;. on his debut album The College Dropout The I Feel for You album's second ballad, &quot;Stronger Than Before&quot; co-written by Burt Bacharach, Bruce Roberts and Carole Bayer Sager, released as the fifth single in certain territories, was later covered by among others Dionne Warwick.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5e679f77fc0ac136099b23ed4a20792b6837616e","amp;dn":"Chaka+Khan+-+Through+The+Fire++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e679f77fc0ac136099b23ed4a20792b6837616e","infoHashBuffer":{"type":"Buffer","data":[94,103,159,119,252,10,193,54,9,155,35,237,74,32,121,43,104,55,97,110]},"announce":[],"urlList":[]}}