{"title":"Kuon - NTSC USA - Eng + Jap (rare PS2 game, Japanese horror)","uid":3674731,"size":854245297,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:5eb65044a3983eb022d61e0dd32ac0930ab8a47f&amp;dn=Kuon+-+NTSC+USA+-+Eng+%2B+Jap+%28rare+PS2+game%2C+Japanese+horror%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"FieroGT42","files":9,"time":1177706142,"description":"\n[===== Stuff =====]\n\nKuon - PS2 DVD, NTSC USA (English &amp; Japanese)\n\nHard to find to say the least!\n\nTorrent contains:\n\n Â· MDF + MDS DVD image in self-extracting UHArc (810 MB, decompresses to 1.96GB)\n Â· DVD case art: USA NTSC (massive res scan), German PAL, Multi-5 PAL\n Â· DVD disc art: USA NTSC\n Â· Other images courtesy agetec/From Software\n\nThis shouldn&amp;#039;t require any patching or rebuilding to work on any modded NTSC PS2 including fliptop/Slim Kit systems with Swap Magic.  If you need to patch from PAL to NTSC, Google for PAL4U.\n\nEnjoy,\ngh0st\n\n\n[===== What to Do Next =====]\n\nRun the EXE file to extract.\n\nBurn to CD at the slowest speed your burner supports, or at 4x, using GOOD quality media.\n\nPlays perfectly on properly modded PS2, including fliptop/Slim Kit with Swap Magic CD.  I&amp;#039;ve verified this on my own system.  If your PS2 has trouble reading, your PS2 or the quality of your media is the problem.\n\n\n[===== Bit Twiddling =====]\n\nPackaged as a self-extracting UHArc archive, better than ZIP and RAR all around, faster than 7zip and usually the same compression as well.\n\nBrought to you by gh0st - Member of the underground returned once again from the legion of dead and defunct.  Hacking, cracking, ripping, and fone phreaking since before most of those other jokers got their first console ;)\n\nIf you have any requests for rare, old, or hard-to-find games or applications, beam me a few electron pulses.  The best way to do so at this time is to message FieroGT42 onor gh0st on Blackcats-Games\n\nomg hax,\ngh0st\n\n\n[===== Descriptive Stuff =====]\n\nQuotes from the official website: http://kuon.agetec.com/\n\n&quot;Uncut &amp; Uncensored - More horror &amp; more lethal than the Japanese version&quot;\n\n&quot;The tune of Japanese taiko drums and the dark aria of children are heard every night. Residents wander like ghosts, and hungry demons creep in the darkness.\n\nThe Heian (794-1192) period of ancient Japan was a time of great mysticism and magic.  Set during this time period is a teenage girl who has wandered into a dark and gruesome castle, where mutated creatures and unimaginable horrors await.  Together with multiple playable characters - exorcists (&quot;Onmyoji&quot;) sent by their master to uncover the castle&amp;#039;s mysteries - the young girl must master the powers of exorcism and Heian-period weaponry to survive the nightmarish world of psychological horrors.&quot;\n\n-----\n\nGiven lukewarm praise by most critics of the massive game review companies, but acclaimed with glowing reviews by the fans who have actually played it.  Listen to those who know best!\n\nFrom the company known for games such as the Armored Core series, From Software&amp;#039;s first delve into the depths of horror games was called the &quot;Most under-rated horror game of the year&quot;, &quot;A hidden survival horror gem that no one knows about&quot;, &quot;Perfect&quot; and it is said that it &quot;Completely nailed the essence of fear&quot;.  Lets hope their next horror game will be even better!\n\nFrom the title screen that makes you look twice (did she really just blink?) to the eerie song of the foreboding demon girl twins, shocking moments, and even a few times when you&amp;#039;re sure there&amp;#039;s something creeping behind your back or think you may be losing your mind (What the..? That mangled body wasn&amp;#039;t there 5 seconds ago!), the atmosphere of Kuon is virtually unsurpassed.\n\nExpect a few vibrant splashes of color, starkly sanguine against the haunting visual and aural presentation, and some disturbingly realistic blood soaked surfaces.  Definitely best played late at night, alone, in the dark, and with a good sound system with a subwoofer and Dolby II surround.  Take the time to stop and enjoy the ambiance and subtle points, and crank your sound system so you don&amp;#039;t miss the understated audio.\n\nThere are also a few points that some would call visual or gameplay blemeshes but most are there for a reason. For example, characters mouths don&amp;#039;t move while speaking, but the authors intended it this way to avoid an English voice over from clashing with Japanese lip synching or vice versa.  Also there is little music, but how often have you woken in the middle of the night in a cold sweat and heard a dynamic soundtrack?  The occasional sudden dead silence in this game is often far more effective.\n\n-----\n\nBased on a classic Japanese horror story called Kwaiden (or Kwaidan), Kuon beckons you to a dark and gruesome mansion during the Heian period (794-1192 C.E.).  Mutated creatures and freakish horrors await as players take on one of multiple playable characters to solve challenging puzzles, conquer mini-games and stand up to the many demonic inhabitants.  Kuon&amp;#039;s unsettling storyline and haunting gameplay is presented with gory visuals and vivid imagery.  The tune of Japanese Taiko Drums and the dark hymns of children are heard throughout the night.  Residents wander like ghosts and hungry demons creep in the darkness, as players face up to a nightmarish world of unimaginable psychological horrors.\n\nYou may begin Kuon as one of two characters: the demure Utsuki, daughter of the local temple&amp;#039;s mystic priest, or Sakuya, a disciple of the temple who&amp;#039;s got a bit more of a backbone.  Both young women come to the Fujiwara manor seeking to unravel the mystery of why its inhabitants have disappeared without a trace.  Utsuki arrives with her sickly sister, Kureha, to try to find their father, while Sakuya arrives with a group of disciples dispatched by the priest to purify the mansion and its people of any ill.  Things evolve into a sordid tale of treachery and evil magic, but you&amp;#039;ll find out who the villain is pretty early on.  While the predictability saps a bit of the tingle out of the unfolding drama, there&amp;#039;s still plenty of truly disturbing imagery, a few good twists to keep things interesting, many nuances to look for, and a few genuinely frightening moments.\n\nYour foes are predominantly creatures called &quot;gaki,&quot; which are human in form and have a charming habit of seeking people out and devouring their still-warm flesh (and they have atrocious table manners).  While you can move slowly and hide from some of the enemies you&amp;#039;ll encounter, you&amp;#039;ll be taking on the bulk of them in combat.  Each character has the ability to use both magic-based attacks as well as close-quarters melee with a weapon.  The magic attacks come from spell cards that you&amp;#039;ll find scattered about the mansion and its grounds, and they consist of both projectile attacks as well as spirits you can summon to fight alongside you. You can map any card type or your melee weapon to one of two buttons that you&amp;#039;ll use to attack.","torrent":{"xt":"urn:btih:5eb65044a3983eb022d61e0dd32ac0930ab8a47f","amp;dn":"Kuon+-+NTSC+USA+-+Eng+%2B+Jap+%28rare+PS2+game%2C+Japanese+horror%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb65044a3983eb022d61e0dd32ac0930ab8a47f","infoHashBuffer":{"type":"Buffer","data":[94,182,80,68,163,152,62,176,34,214,30,13,211,42,192,147,10,184,164,127]},"announce":[],"urlList":[]}}