{"title":"The Happiness Industry - William Davies","uid":11945067,"size":636675,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f8ec9580e0c855c46eaa5bbe246f485b26a291a&amp;dn=The+Happiness+Industry+-+William+Davies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432042804,"description":"In winter 2014, a Tibetan monk lectured the world leaders gathered at Davos on the importance of Happiness. The recent DSM-5, the manual of all diagnosable mental illnesses, for the first time included shyness and grief as treatable diseases. Happiness has become the biggest idea of our age, a new religion dedicated to well-being.\n\nIn this brilliant dissection of our times, political economist William Davies shows how this philosophy, first pronounced by Jeremy Bentham in the 1780s, has dominated the political debates that have delivered neoliberalism. From a history of business strategies of how to get the best out of employees, to the increased level of surveillance measuring every aspect of our lives; from why experts prefer to measure the chemical in the brain than ask you how you are feeling, to why Freakonomics tells us less about the way people behave than expected, The Happiness Industry is an essential guide to the marketization of modern life. Davies shows that the science of happiness is less a science than an extension of hyper-capitalism","torrent":{"xt":"urn:btih:5f8ec9580e0c855c46eaa5bbe246f485b26a291a","amp;dn":"The+Happiness+Industry+-+William+Davies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f8ec9580e0c855c46eaa5bbe246f485b26a291a","infoHashBuffer":{"type":"Buffer","data":[95,142,201,88,14,12,133,92,70,234,165,187,226,70,244,133,178,106,41,26]},"announce":[],"urlList":[]}}