{"title":"XIII The Conspiracy (2008)DVDr.nl.subs.NLT-Release (DivX)","uid":4714087,"size":1745275856,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:60f9d9ca869a81b25071545cb6dfa7ee2b20794d&amp;dn=XIII+The+Conspiracy+%282008%29DVDr.nl.subs.NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":-1,"time":1234195910,"description":"\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/54695&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/54695&lt;/a&gt;\n\nFrankrijk / Canada\nActie / Drama\n240 minuten (miniserie, 2 delen)\n\ngeregisseerd door Duane Clark\nmet Stephen Dorff, Caterina Murino en Greg Bryk\n\nDe eerste vrouwelijke Amerikaanse presidente, Sally Sheridan, is doodgeschoten door een sluipschutter tijdens haar toespraak op Veterans Day. Haar moordenaar kan ternauwernood levend ontsnappen met de nationale veiligheid op zijn hielen... of zo lijkt het toch. Drie maanden later ontdekken een paar ouderen het lichaam van een gewonde aangespoelde man op het strand. De jonge man kan zich niet het minste herinneren over zijn identiteit. De enige aanwijzing is een tatoeage in zijn hals, XIII. Ondertussen is in het Witte Huis, de Government Intelligence nog steeds op zoek naar de presidentiele moordenaar. Met verkiezingen die er binnen enkele weken aankomen, zou een arrestatie zeker de stembusuitslag kunnen beinvloeden in het voordeel van de huidige regering. Uren nadat XIII geidentificeerd is door de geheime inlichtingendienst, zwermen Special Op,s-troepen uit over de woning van het koppel dat gelegen is op Cape Fear. Op de vlucht, draaiende op adrenaline en instinct, schakelt XIII de soldaten een voor een uit. XIII begint zijn herinneringen stukje voor stukje bij elkaar te rapen en tracht zo de puzzel te ontrafelen. Als hij toch gevangen genomen wordt, verneemt hij dat hij een gestolen identiteit gekregen had en undercover geplaatst was om een troep van samenzweerders op het hoogste niveau te ontmaskeren, die dreigden met het omverwerpen van de regering.\n\nVanaf 17 februari in de videotheek (overige videotheekreleases)\n\nThanks To:\nFearless\n\n\n\nVoor de nieuwste films ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\n\nEnjoy The Movie!!!!!","torrent":{"xt":"urn:btih:60f9d9ca869a81b25071545cb6dfa7ee2b20794d","amp;dn":"XIII+The+Conspiracy+%282008%29DVDr.nl.subs.NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60f9d9ca869a81b25071545cb6dfa7ee2b20794d","infoHashBuffer":{"type":"Buffer","data":[96,249,217,202,134,154,129,178,80,113,84,92,182,223,167,238,43,32,121,77]},"announce":[],"urlList":[]}}