{"title":"Democracy Now - 26 jan 2012","uid":6986853,"size":458984230,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6123e145ec8ba01be9320a79a99e733597febf37&amp;dn=Democracy+Now+-+26+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1327597501,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 26, 2012\n\n- Obama Pushes Millionaire Tax in Iowa; Romney Slams SOTU Address\n- Romney and Gingrich Seek Florida Latino Vote\n- Fed Preserves Low Interest Rate, Predicts Slow Recovery\n- Geithner: No 2nd Term as Treasury Secretary\n- U.S. Could Expand Military Presence in the Philippines\n- Record Turnout Estimated at Egyptian Revolution Rallies\n- U.N.: Interim Libyan Govt Torturing Prisoners\n- Occupy Protesters Rally at Davos World Economic Forum\n- People's Movements Converge for World Social Forum in Brazil\n- Indiana Lawmakers Pass Anti-Union Bill\n- Whistleblower: BP Sought to Alter Cleanup Data\n- Publisher Resigns After Suggesting Obama Assassination\n- NYPD Commissioner Apologizes for Role in Anti-Muslim Documentary\n\n\nSpecial reports\n\n- Iraqis Voice Outrage as U.S. Massacre in Haditha Ends in No Jail Time for Accused Marines\n\nThe last of the U.S. marines charged in the 2005 Haditha massacre of 24 Iraqi civilians, Staff Sergeant Frank Wuterich, received no jail time after he pleaded guilty to dereliction of duty and avoiding charges of involuntary manslaughter. Under his sentencing, Wuterich now faces a maximum penalty of a demotion to the rank of private. The victims, including women and children, were killed when the marines burst into their homes and shot them dead in their nightclothes. Wuterich allegedly led the Haditha massacre and was the last defendant to face charges. Six other marines have had their charges dropped or dismissed, while another soldier was acquitted. &quot;[Iraqi] outrage is perfectly understandable,&quot; says Tim McGirk, the Time magazine reporter who broke the story on the Haditha massacre. &quot;Here is a case where so many Iraqis were killed, women and children, old men, and yet what's happened? Most of the charges have been dismissed, and Wuterich was basically given a slap on the wrist.&quot;\n\n\n- Glock: As Giffords Exits, A Look at the Gun Used in Tucson Rampage and Other U.S. Mass Shootings\n\nArizona Congresswoman Gabrielle Giffords resigned her seat this week, roughly a year after she was shot through the head during a meeting with constituents outside a Tucson supermarket. The attack left six people dead and 12 others injured. As Giffords steps down, we look at the iconic semi-automatic pistol Glock pistol used in her attack and a number of the worst mass shootings in U.S. history. Gun-control advocates have had little success calling for restrictions on Glocks - or the large-capacity ammunition magazines they can accommodate. We speak with Paul Barrett, who wrote the landmark book about the infamous weapon, &quot;Glock: The Rise of America's Gun.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6123e145ec8ba01be9320a79a99e733597febf37","amp;dn":"Democracy+Now+-+26+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6123e145ec8ba01be9320a79a99e733597febf37","infoHashBuffer":{"type":"Buffer","data":[97,35,225,69,236,139,160,27,233,50,10,121,169,158,115,53,151,254,191,55]},"announce":[],"urlList":[]}}