{"title":"FantasyMassage - Penny Brooks NEW 11 June 2015","uid":12008042,"size":309848790,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6360a9f2caa09099ee4039ea857c4877534d01b2&amp;dn=FantasyMassage+-+Penny+Brooks+NEW+11+June+2015&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1434016401,"description":"Career day is coming up at school and Penny Brooks has no clue what she wants to do when she grows up. Brainstorming on her interests and likes, she comes up with the thought of becoming a makeup artist and looks online for a spa where she can interview someone in the industry. Penny finds the perfect venue and is on her way to pay them a visit.Penny arrives at the spa, but notices no one is there, so she makes her way in the back where she meets Tommy Gunn. Surprised at her unexpected visit, Tommy breaks the news that they were closed and all the makeup artists were gone. Tommy insists that he has no time to show her anything for her school report and quickly shows her the door. Feeling bad for Penny, Tommy tells her to come back in and says he can give her some insight on how he works, so he takes her in the back for a quick training...Tommy prepares himself by undressing and lying on the massage table. Penny rubs his back and legs while Tommy gives her pointers on how to improve her technique. Turning around on his back, Penny notices his huge hard on over the towel and takes this as a sign that she is doing a great job. Even though Tommy is embarrassed about his huge erection, he encourages Penny to proceed with the training but she is fixated on his penis and wants to see more of it. How will Tommy react to her advances? Will he call it quits or will this school girl report on Tommy's dick? Watch and find out!\nGenre: Big Tits, Brunette, Body Massage, Blowjob, Cum in Mouth, Hardcore, Natural Tits, Teen, Massage, Big Dick, Shaved, Uniform\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=09892152786433997067.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=09892152786433997067.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=61673968515223382587.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=61673968515223382587.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:6360a9f2caa09099ee4039ea857c4877534d01b2","amp;dn":"FantasyMassage+-+Penny+Brooks+NEW+11+June+2015","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6360a9f2caa09099ee4039ea857c4877534d01b2","infoHashBuffer":{"type":"Buffer","data":[99,96,169,242,202,160,144,153,238,64,57,234,133,124,72,119,83,77,1,178]},"announce":[],"urlList":[]}}