{"title":"Walt Disney: The Triumph of the American Imagination (Unabridged","uid":3818342,"size":720761391,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:63c162522d4d84cfffa8b2228bfd7e57c1a0c9e0&amp;dn=Walt+Disney%3A+The+Triumph+of+the+American+Imagination+%28Unabridged&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"-prolix-","files":5,"time":1190697221,"description":"Walt Disney: The Triumph of the American Imagination (Unabridged)\n\n\n\nPublisher&amp;#039;s Summary\n\nSeven years in the making and meticulously researched - Gabler is the first writer to be given complete access to the Disney archives - this is the full story of a man whose work left an ineradicable brand on our culture but whose life has largely been enshrouded in myth.\n\nGabler shows us the young Walt Disney breaking free of a heartland childhood of discipline and deprivation and making his way to Hollywood. We see the visionary, whose desire for escape honed an innate sense of what people wanted to see on the screen and, when combined with iron determination and obsessive perfectionism, led him to the reinvention of animation. It was Disney, first with Mickey Mouse and then with his feature films - most notably Snow White, Pinocchio, Fantasia, Dumbo, and Bambi - who transformed animation from a novelty based on movement to an art form that presented an illusion of life.\n\nThe author also reveals a wounded, lonely, and often disappointed man, who, despite worldwide success, was plagued with financial problems, suffered a nervous breakdown, and at times retreated into pitiable seclusion in his workshop, making model trains. Gabler explores accusations that Disney was a red-baiter, an anti-Semite, and an embittered alcoholic. Yet whatever his personal failings, Disney appealed to millions by demonstrating the power of wish fulfillment and the triumph of the American imagination.\n\n\nNarrator: Arthur Morey\nPublisher: Books on Tape, 2006\nLength: 33 hours and 24 min.\n\n\n\nI hope you enjoy this audiobook!! it&amp;#039;s pure disney magic from the source itself!","torrent":{"xt":"urn:btih:63c162522d4d84cfffa8b2228bfd7e57c1a0c9e0","amp;dn":"Walt+Disney%3A+The+Triumph+of+the+American+Imagination+%28Unabridged","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c162522d4d84cfffa8b2228bfd7e57c1a0c9e0","infoHashBuffer":{"type":"Buffer","data":[99,193,98,82,45,77,132,207,255,168,178,34,139,253,126,87,193,160,201,224]},"announce":[],"urlList":[]}}