{"title":"Overkill-Fuck You Live (EP)  MP3  128k  ak1987","uid":10686315,"size":32641867,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:63cab7e8c9fb93807ea690c404c0048a4218bda8&amp;dn=Overkill-Fuck+You+Live+%28EP%29++MP3++128k++ak1987&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":6,"time":1407081710,"description":"Overkill-Fuck You Live (EP)  MP3  128k  ak1987 What we got...1987 marked the release of Overkill's second album Taking Over, the first to be released by Megaforce in cooperation with the major label Atlantic Records. The album featured improved song writing and production and had a somewhat more epic style, showcased in such songs as the anthemic &quot;In Union We Stand&quot;. The song was chosen to be Overkill's first music video, used to promote the band through the booming new medium of music television. Another European tour followed, this time opening for Helloween.\n\nIn late 1987, the !!!Fuck You!!! EP was released, consisting of a studio recording of The Subhumans' song &quot;Fuck You&quot; as well as a handful of live tracks recorded earlier that year in Cleveland.\n\n1987 also saw the departure of drummer Rat Skates. He was replaced by Mark Achabal for a few gigs, then on a permanent basis by European drummer Bob &quot;Sid&quot; Falck previously of Paul Di'Anno's Battlezone.\n\nOverkill released the follow-up to Taking Over, the aptly titled Under the Influence, in 1988. Once again produced by Alex Perialas, Under the Influence was much more raw and thrashy, lacking most of the grand and epic atmosphere of its predecessor. Suffering from rushed writing and production, the album is often regarded as a snapshot and a step backwards for the band. The song &quot;Hello From The Gutter&quot; was released as a single, and the music video gained regular airplay on MTV's Headbangers Ball. Overkill kept up constant touring all over the world, furthering their reputation as one of the most active live metal bands.\n\nOverkill released their breakthrough album The Years of Decay in 1989. It was recorded with famed producer Terry Date (Pantera, White Zombie, Soundgarden) and featured the band's best production to date. It mixed the raw approach of &quot;Under The Influence&quot; with more complex song structures and epic elements, resulting in a more serious atmosphere and longer songs, including the eight-minute title track and the ten-minute &quot;Playing With Spiders/Skullkrusher.&quot; The uptempo thrasher &quot;Elimination&quot; was released as a single and the music video again received regular airplay on MTV's Headbangers Ball. The song became a fan favorite and would be played live at every show, even 25 years later. Live support of The Years of Decay took place, in part, on a tour called &quot;Dawn of the Decade&quot; together with label mates Testament.","torrent":{"xt":"urn:btih:63cab7e8c9fb93807ea690c404c0048a4218bda8","amp;dn":"Overkill-Fuck+You+Live+%28EP%29++MP3++128k++ak1987","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63cab7e8c9fb93807ea690c404c0048a4218bda8","infoHashBuffer":{"type":"Buffer","data":[99,202,183,232,201,251,147,128,126,166,144,196,4,192,4,138,66,24,189,168]},"announce":[],"urlList":[]}}