{"title":"Eniac Requiem - Space Eternal Void[FLAC]","uid":5828970,"size":398964582,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63ee6350e4e8edaeb62c411ad074830ef8d94bb8&amp;dn=Eniac+Requiem+-+Space+Eternal+Void%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PrincipalSkinner","files":13,"time":1284433724,"description":"ENIAC REQUIEM is made up by five highly talented American youngsters, who will make your jaw drop to your kneecaps with their debut &quot;Space Eternal Void&quot;, if you like Progressive Metal, that is. The beginning with &quot;Prelude&quot; already hints on what to expect from the coming 50 minutes. A very powerful and fat overall sound and songs that demand the full attention of the listener, but you won't object to it. The main focus with ENIAC REQUIEM lies at the guitars (surprise, I just say Shrapnel) and keyboards.\n\nFurious solos and riffs of these two instruments dominate all of the compositions, but still Derek Taylor (v/g), Scott Stine (g), David Perry (b), Brett Stine (keys) and Rob Stankiewic (dr) put a big emphasis on variety. Thundering, stomping parts, where you just have to bang, even if the last vertebra is ground to dust, are going hand in hand with emotional, partly very balladesque pieces. Apart from these passages you also get intricate classical influences and here and there some weird sound. Everything is very well thought-through and the 13 songs are just of one mould. The charismatic voice of Derek Taylor adds an unmistakable touch with his intensity and delicacy. You could roughly compare ENIAC REQUIEM with a mixture of SYMPHONY X and ARTENSION. While they don't have the extra-class of SYMPHONY X yet, they stand above ARTENSION in all standards.\n\nSongs :\n\nPrelude\nAmulet Of The Sun\nWyrm\nEndless Cosmos\nShadows Fall\nLost In The Void\nSad Clown In Europe\nThe Slow Poisoners\nNemesis\nDarkness Planet Earth\nGuenhwyvar\nEmpire Of Dolls\nFinale","torrent":{"xt":"urn:btih:63ee6350e4e8edaeb62c411ad074830ef8d94bb8","amp;dn":"Eniac+Requiem+-+Space+Eternal+Void%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63ee6350e4e8edaeb62c411ad074830ef8d94bb8","infoHashBuffer":{"type":"Buffer","data":[99,238,99,80,228,232,237,174,182,44,65,26,208,116,131,14,248,217,75,184]},"announce":[],"urlList":[]}}