{"title":"Battleheart v1.2","uid":8502122,"size":47996097,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:649454b68fb2191eaf2264bba153f0edc5e9b207&amp;dn=Battleheart+v1.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1369330803,"description":"\nOur very first hit mobile game, Zombieville USA, has now been unleashed on Android as well! Go check it out!\n\n** Note to Samsung Users - some &quot;Galaxy S&quot; devices cannot download this app due to its size exceeding 30mb. Please be aware of your device's limitations before attempting to purchase. For info on this and all other installation issues, visit our FAQ: www.mikamobile.com/droid_faq.html **\n\nBattleheart - enter a world of epic fantasy combat!\n\n&quot;Battleheart is an absolutely effortless recommendation&quot; - TouchArcade.com\n\n&quot;Incredibly addictive and fun&quot; - Attack of the Show\n\n&quot;Game of the Week&quot; - iTunes\n\nThe hit iOS game, now available on Android! Battleheart distills some of the greatest elements of roleplaying games and real-time strategy into pocket-sized form!\n\nCreate a unique party of heroes, and lead them in frantic real-time battles against monsters of ever increasing power. Lay waste to your foes with dozens of unique special powers as you gain experience, upgrade your party's equipment, and craft them into the ultimate battle force!\n\n-- Features --\n\n- Easily command your army via simple touch commands.\n- Create a unique party from numerous character classes, including stealthy rogues, powerful wizards and stoic knights!\n- Customize your heroes via dozens of unique skills - literally hundreds of class and skill combinations!\n- Make the most of your party's skills to control the battlefield - turn your opponents into frogs, stun them with poisons, or simply destroy them with meteor strikes and whirlwinds of steel!\n- Over 100 unique items to collect and equip across a 30+ level campaign, complete with epic boss battles!\n- Put your custom party to the ultimate test in survival arenas, where rare and unique rewards can be found!\n- Incredibly sharp animation and art designed specifically for cutting edge mobile devices!\n\nWhat's in this version:\n- Now compatible with Evo 3D and HTC Sensation\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.KelliNoda.Battleheart&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.KelliNoda.Battleheart&lt;/a&gt;\n","torrent":{"xt":"urn:btih:649454b68fb2191eaf2264bba153f0edc5e9b207","amp;dn":"Battleheart+v1.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649454b68fb2191eaf2264bba153f0edc5e9b207","infoHashBuffer":{"type":"Buffer","data":[100,148,84,182,143,178,25,30,175,34,100,187,161,83,240,237,197,233,178,7]},"announce":[],"urlList":[]}}