{"title":"Eric Grzymkowski - Attack of the Killer Facts! (mobi + epub)","uid":7886951,"size":3649718,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65845ae1d7daa1e9fa3fa35c31531ba9512a404d&amp;dn=Eric+Grzymkowski+-+Attack+of+the+Killer+Facts%21+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kevinkray","files":-1,"time":1354636027,"description":"Factoid Attack: Inherent sadistic streak in dentists confirmed!\nThe electric chair was invented by a dentist, Dr. Alfred Southwick. Not surprising, dentists have been perfecting torture devices for centuries.\n\nFactoid Attack: Galaxy at risk! Intelligent life in short supply!\nIn 1961, Astronomer Frank Drake estimated the number of probable intelligent civilizations inhabiting our galaxy. Using conservative numbers, that estimate came to 10,000. Unfortunately, we are not included in that total.\n\nFactoid Attack: Colorblind bulls hate all matadors equally!\nThe color of a matador's cape, or muleta, is traditionally red, which is widely believed to irritate the bull. In reality, bulls are colorblind, so it is irrelevant what color cape a matador uses to antagonize them. Shot in the dark, but maybe it's the being stabbed with swords bit that pisses them off.\n\nForget Fringe, Warehouse 13, and The X-Files. In this book, you'll find more weird and wacko truths than in all those combined. From golden poison dart frogs with enough venom to kill ten grown humans to cockroaches that can survive radiation 15 times stronger than what kills people, scary and strange just got scarier--and stranger! ","torrent":{"xt":"urn:btih:65845ae1d7daa1e9fa3fa35c31531ba9512a404d","amp;dn":"Eric+Grzymkowski+-+Attack+of+the+Killer+Facts%21+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65845ae1d7daa1e9fa3fa35c31531ba9512a404d","infoHashBuffer":{"type":"Buffer","data":[101,132,90,225,215,218,161,233,250,63,163,92,49,83,27,169,81,42,64,77]},"announce":[],"urlList":[]}}