{"title":"From the Marvel Vault (2011)","uid":7806826,"size":117910674,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:677eb5c9161fa1162669293a45e65d99fabc605a&amp;dn=From+the+Marvel+Vault+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1352420985,"description":"FROM THE MARVEL VAULT is a series of 5 one-shots published by Marvel Comics in 2011. Each issue featured an unpublished &quot;fill-in&quot; or &quot;stock&quot; story that was commissioned for a monthly Marvel super-hero series over the preceding 25 years. INCREDIBLE HULK &amp; THE HUMAN TORCH was pencilled by Steve Ditko and intended to be an issue of MARVEL TEAM-UP, DR. STRANGE was written by Roger Stern and intended for the short-lived MARVEL UNIVERSE, GAMBIT AND THE CHAMPIONS was pencilled by George Tuska and intended for the GAMBIT series, THUNDERBOLTS features Nomad and was written by Fabian Nicieza for THUNDERBOLTS, and THE DEFENDERS was pencilled by Mark Bagley and intended for that series. It was very cool to see art by Ditko (who co-created Spider-Man), Tuska (who died in 2009), and Bagley, and the stories are great, particularly Kurt Busiek who had to create a story from scratch because the original writer (and Bagley) had no idea what the original story was. This is my first torrent ever so if I upload it correctly, it will be a small miracle! Please seed. And thanks to blackcanary and ThePirateBay for inspiring me to do more than leech from now on.","torrent":{"xt":"urn:btih:677eb5c9161fa1162669293a45e65d99fabc605a","amp;dn":"From+the+Marvel+Vault+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"677eb5c9161fa1162669293a45e65d99fabc605a","infoHashBuffer":{"type":"Buffer","data":[103,126,181,201,22,31,161,22,38,105,41,58,69,230,93,153,250,188,96,90]},"announce":[],"urlList":[]}}