{"title":"The Buckinghams - Mercy, Mercy, Mercy (A Collection) (1991)","uid":8627818,"size":307519808,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:67a37487134961187cb016afb3a95842a68b52af&amp;dn=The+Buckinghams+-+Mercy%2C+Mercy%2C+Mercy+%28A+Collection%29+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":37,"time":1372556252,"description":"This is the same torrent that was uploaded to Demonoid in August 2011.\n\n\nThe Buckinghams - Mercy, Mercy, Mercy (A Collection) (1991)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/61QVGEQ8JJL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/61QVGEQ8JJL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes 12 page booklet.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nIf everyone on the northwest side of Chicago who claims to have hung out with the Buckinghams during their heyday had faithfully bought all their releases, the rock group might have sold more records than the Beatles.\n\nPopular attractions while still in high school, the quintet changed its name from the Pulsations to the Buckinghams to reflect the British Invasion craze and signed with Chicago's USA Records in 1966. Backing Dennis Tufano's buoyant lead vocals with prominent harmonies and punchy soul-styled brass, the group came across the wistful &quot;Kind of a Drag,&quot; and in short order, the Buckinghams had a million-selling pop chart-topper on their hands. They quickly graduated to recording for Columbia.\n\nAs long as songwriter Jim Holvay supplied more material of the same high quality as &quot;Kind of a Drag,&quot; the Buckinghams were sitting pretty. Holvay cowrote &quot;Don't You Care,&quot; &quot;Hey Baby (They're Playing Our Song),&quot; and the pseudo-psychedelic &quot;Susan,&quot; and they all proved to be major hits for the band. The group's R&amp;B roots surfaced on a vocal adaptation of Cannonball Adderley's jazz standard &quot;Mercy, Mercy, Mercy,&quot; their second-biggest hit.\n\nBut the Buckinghams' fortunes soon changed drastically -- one of the top-selling rock groups of 1967, they managed only one hit after early 1968, and by 1970 the group was kaput. Two original members, guitarist Carl Giammarese and bassist Nick Fortuna, have since revived the Buckinghams for oldies tours.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifoxqw5ldde~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:gifoxqw5ldde~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nAlthough they never had a hit album, the Buckinghams sold more records in 1967 than any American group other than the Monkees. This collection includes every Buckinghams song you'd want to hear, and more. The disc opens with &quot;Kind of a Drag,&quot; the number one single in the U.S. in February 1967. The band's other pop hits are here as well: &quot;Don't You Care,&quot; &quot;Hey Baby (They're Playing Our Song),&quot; &quot;Susan,&quot; and the group's vocal take on Cannonball Adderley's jazz classic &quot;Mercy, Mercy, Mercy,&quot; which reached number five in August. As 1967 ended, so did the band's string of hits. Except for the minor hit &quot;Back in Love Again&quot; from spring 1968, the band disappeared into oblivion. However, Mercy, Mercy, Mercy includes other worthwhile tracks steeped in the happy production style of the hits. &quot;Where Did You Come From&quot; and &quot;It's a Beautiful Day (For Lovin')&quot; are pleasant, optimistic-sounding pop confections, while &quot;Difference of Opinion&quot; and &quot;You&quot; show the Buckinghams attempting to move beyond their singles-band image in their final recording sessions in 1969.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3ifixqq5ldfe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:3ifixqq5ldfe&lt;/a&gt;\n\nYou can listen to track samples at: &lt;a href=&quot; http://www.amazon.com/dp/B0000027PL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B0000027PL&lt;/a&gt;\n\nTrack List:\n\n01. Kind Of A Drag\n02. Lawdy Miss Clawdy\n03. I've Been Wrong Before\n04. I'll Go Crazy\n05. I Call Your Name\n06. Makin' Up And Breakin' Up\n07. Don't You Care\n08. Mercy, Mercy, Mercy\n09. Hey Baby (They're Playing Our Song)\n10. Susan\n11. Back In Love Again\n12. You Misunderstand Me\n13. Where Did You Come From\n14. This Is How Much I Love You\n15. It's A Beautiful Day (For Lovin')\n16. Difference Of Opinion\n17. I Got A Feelin'\n18. You\n","torrent":{"xt":"urn:btih:67a37487134961187cb016afb3a95842a68b52af","amp;dn":"The+Buckinghams+-+Mercy%2C+Mercy%2C+Mercy+%28A+Collection%29+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a37487134961187cb016afb3a95842a68b52af","infoHashBuffer":{"type":"Buffer","data":[103,163,116,135,19,73,97,24,124,176,22,175,179,169,88,66,166,139,82,175]},"announce":[],"urlList":[]}}