{"title":"The Hobbit: An Unexpected Journey ext (2012) 1080p Itunes","uid":9487462,"size":8961646592,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:68f6f9ca0d1dc63e65e2aaaaeed8038c32e17691&amp;dn=The+Hobbit%3A+An+Unexpected+Journey+ext+%282012%29+1080p+Itunes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dabadguy69","files":-1,"time":1389927292,"description":"PG13,3hrs 2min\nGenres:Sci-Fi,Action\nReleased: December 14, 2012\nDirector: Peter Jackson\nDistributor:Warner Bros.\nStarring: Ian McKellen, Martin Freeman, Richard Armitage \n\nBilbo Baggins (Martin Freeman) joins Gandalf (Ian McKellen) and a band of dwarves led by the brave Thorin (Richard Armitage) on a treacherous quest to reclaim their mountain home from the fierce dragon Smaug in this epic fantasy adventure adapted from J.R.R. Tolkien's beloved novel by the creative forces behind the Lord of the Rings trilogy. Long before Frodo Baggins (Elijah Wood) made his arduous journey to Mordor, his brave uncle Bilbo embarked on an adventure for the ages. Bilbo's story gets under way when the great wizard Gandalf appears at his front gate with a most unusual offer. Displaced from their massive fortress in the Lonely Mountain by Smaug - a greedy dragon who coveted their gold - a community of noble dwarves were decimated by a surprise attack by monstrous orcs, whose dreaded leader the Pale Orc slew their king in a gruesome battle. Now, Thorin, the descendent of the king, is determined to reclaim his mountain kingdom for his people. Together with a fearless team of dwarves, Thorin and Gandalf recruit Bilbo to aid them in their quest since Hobbits have the unique ability to go undetected when they wish to. Before Bilbo, Gandalf, and the dwarves can reach The Lonely Mountain and defeat Smaug, however, they'll have to contend with trolls, goblins, stone giants, Gollum (Andy Serkis), and even the dreaded Pale Orc himself.   peter Jackson directs a screenplay he co-penned with Fran Walsh, Philippa Boyens, and Guillermo del Toro. ~ Jason Buchanan, Rovi \n\n1920x1080\n2 channel\nstereo 160kb\n5.1 Ac3 \n","torrent":{"xt":"urn:btih:68f6f9ca0d1dc63e65e2aaaaeed8038c32e17691","amp;dn":"The+Hobbit%3A+An+Unexpected+Journey+ext+%282012%29+1080p+Itunes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68f6f9ca0d1dc63e65e2aaaaeed8038c32e17691","infoHashBuffer":{"type":"Buffer","data":[104,246,249,202,13,29,198,62,101,226,170,170,238,216,3,140,50,225,118,145]},"announce":[],"urlList":[]}}