{"title":"Dreamcast 4 PC Ã‚Â» RESIDENT EVIL VERONICA X game ready by globe@","uid":5649513,"size":925523897,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:695618af6f6fb6d069be82c68ac00b505416f934&amp;dn=Dreamcast+4+PC+%C3%82%C2%BB+RESIDENT+EVIL+VERONICA+X+game+ready+by+globe%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"globeplus","files":-1,"time":1277610001,"description":"* Hello Dreamcast and PC games fans ...\n\n\n* Play this fantastic resident evil for sega dreamcast with perfect emulation ...\n\n\n* FILE INFO : Game ready to go in 2 discs with emulator included and correctly configurated to the game , just play . (instructions included)\n\n\n\n* GAMEPLAY : *\n\n* The game is set in early 1999, three months after the destruction of Racoon city, it begins with Claire Redfield raiding an Umbrella Corporation facility in Paris in search of her brother, Chris Redfield. During the infiltration she is captured and imprisoned on Rockfort Island. Soon after arriving, a man named Rodrigo Juan Raval releases her from her cell, since she is not much of a threat considering the release of the T-virus on Rockfort. Trying to escape from the contaminated island, Claire teams up with inmate Steve Burnside, at the same time being confronted with the island's commander Alfred Ashford. Meanwhile, Albert Wesker is on a mission of his own to retrieve a sample of the T-Veronica virus developed by Alfred's twin sister Alexia. His unit is also responsible for the outbreak of the T-virus on Rockfort Island.\n\nClaire and Steve eventually escape via plane, but Alfred sets it to autopilot and flies both of them to another Umbrella facility in the Antarctic, in hope of freeing his sister from her 15-years-long cryogenic sleep she took after the injection of the T-Veronica virus, to counter the flaws of the virus. After another fight with Claire and Steve which ends in the protagonists escaping the facility via a digger, Alfred limps to Alexia, heavily injured. He witnesses her awakening moments before drawing his last breath. Alexia summons giant tentacles and crashes Claire's and Steve's digger, recapturing them.\n\nChris Redfield arrives on Rockfort after having been contacted by Leon. He learns from Raval that Claire is long gone. Raval is soon killed afterwards by a giant worm. Searching Rockfort, Chris has an encounter with Wesker. Just as his old superior wants to finish him off, Alexia appears on a screen laughing. Stunned by Alexia being alive, Wesker changes his mind and returns to the Antarctic. Chris eventually finds his way there, and is reunited with Claire who sets out to find Steve. As she locates him, she discovers Alexia conducted an experiment on him, injecting Steve with the T-Veronica virus. Steve mutates into a reptilian monster and tries to kill Claire who escapes to a prison cell, where she is attacked by another of Alexia's tentacles. Still in his mutated form, Steve breaks through the bars using his immense strength and rescues Claire. The tentacle drives into his chest and retreats. Steve mutates back to his human form and dies. However, before he dies, he professes his love for Claire.\n\nAt the same time, Chris and Wesker confront Alexia. Overwhelmed by her strength, Wesker escapes and leaves Chris to fight her. His victory is only temporary, as Alexia resurrects after the battle. Meanwhile, Chris activates the facility's self-destruct system to release all locks, freeing Claire from the prison cell. Alexia confronts him a second time, this time leading to her ultimate destruction. Chris runs to the emergency elevator and catches a glimpse of Wesker, whose men also retrieved Steve's body to use for further experiments, as he is the only subject injected with a sample of the T-Veronica virus. Chris convinces Wesker to release Claire who then runs to the plane, waiting for her brother. Chris is overwhelmed by Wesker in a fight. Both are separated by an explosion. Wesker vows he will satisfy his desire for revenge the next time they meet. Chris reunites with Claire and both set off just as the whole facility blows up. Chris swears to take down Umbrella once and for all.\n\n\n\n\n\n\n                 \n                           ***** enjoy ... *****\n","torrent":{"xt":"urn:btih:695618af6f6fb6d069be82c68ac00b505416f934","amp;dn":"Dreamcast+4+PC+%C3%82%C2%BB+RESIDENT+EVIL+VERONICA+X+game+ready+by+globe%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"695618af6f6fb6d069be82c68ac00b505416f934","infoHashBuffer":{"type":"Buffer","data":[105,86,24,175,111,111,182,208,105,190,130,198,138,192,11,80,84,22,249,52]},"announce":[],"urlList":[]}}