{"title":"War on the Mississippi - Grants Vicksburg Campaign (Time-Life Th","uid":11653475,"size":38493869,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:696af089161deba2ec327be9efc27eb435e27805&amp;dn=War+on+the+Mississippi+-+Grants+Vicksburg+Campaign+%28Time-Life+Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1417901209,"description":"Pdf / English / 1985 Time-Life / 175 pages / 36.7 MB / ISBN10 0809447444\n\n&quot;This volume looks at the 1862-1863 Mississippi campaign, an operation designed to take the fortress-city of Vicksburg, the lynchpin between the bulk of the Confederacy and its far eastern states. Union General Ulysses S. Grant, who had made a name for himself over the previous year, launched several attempts to bypass Vicksburg in order to link up with General Butler's forces, which were moving upriver from New Orleans. None of these worked, but they served to keep the Federal troops engaged in operations rather than inactive in winter quarters. Grant would come up with a strategy which would allow him to outmanuever the Confederates, place Vicksburg under seige and capture it, marking the beginning of the end for the CSA. Discusses the Battles of Chickasaw Bluffs, Champion's Hill, Raymond, Port Gibson, Grand Gulf and Big Black, as well as Grierson's Raid.\n\nRichly illustrated with maps, photos of artifacts, contemporary photos and artwork. Includes sidebars on the Pearl River POW &quot;camp,&quot; a photo essay of prewar Vicksburg, a series of antebellum paintings of the Mississippi River, A Gallery of Western Cavalrymen, Port Hudson and the Union's Homespun Hero. An excellent book!&quot;\n\nAmazon","torrent":{"xt":"urn:btih:696af089161deba2ec327be9efc27eb435e27805","amp;dn":"War+on+the+Mississippi+-+Grants+Vicksburg+Campaign+%28Time-Life+Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"696af089161deba2ec327be9efc27eb435e27805","infoHashBuffer":{"type":"Buffer","data":[105,106,240,137,22,29,235,162,236,50,123,233,239,194,126,180,53,226,120,5]},"announce":[],"urlList":[]}}