{"title":"The Colourfield-Deception","uid":5246821,"size":104284024,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:697381aba959e7a5cc7d92b71de99cad6c4c28ac&amp;dn=The+Colourfield-Deception&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fanciz","files":-1,"time":1262017388,"description":"Biography by Stephen Thomas Erlewine \nBy the summer of 1983, the Fun Boy Three were peaking in popularity and Terry Hall disbanded the group. Hooking up with ex-Swinging Cats members Toby Lyons and Karl Shale, Hall moved to Manchester and formed the Colourfield, a more lush and melodic outfit than the Fun Boy Three. In January of 1984, the band released their first single, &quot;The Colourfield,&quot; which just missed the Top 40. It was followed later that summer with &quot;Take,&quot; which didn't even come close to the Top 40. The Colourfield had its first hit in January of 1985, when &quot;Thinking of You&quot; reached number 12. It was followed by &quot;Castles in the Air,&quot; another failed single that preceded the release of their debut album, Virgins and Philistines, by just a few weeks. Like the band's singles, Virgins and Philistines failed to gain a large audience for the Colourfield. The band released a second album, Deception, in the spring of 1987. During the sessions, Lyons left the band, leaving Hall to finish the album by himself; to complete the album, Hall hired Raquel Welch's band. \n \nIn my opinion, The Colourfield is one of the best New Wave bands in the category gentle new wave, with The Wild Swans, The Railway Children, The Adventures, The Bible etc The album Deception is not as good as Virgins and Philistines which has already been posted but it has two or three good songs. Enjoy!\n\nBit rate: 320kbps\n\nTracks:\n\n1. Badlands\n2. Running Away\n3. From Dawn to Distraction\n4. Confession\n5. Miss Texas 1967\n6. She\n7. Heart of America\n8. Digging It Deep\n9. Monkey in Winter\n10.Goodbye Sun Valley\n","torrent":{"xt":"urn:btih:697381aba959e7a5cc7d92b71de99cad6c4c28ac","amp;dn":"The+Colourfield-Deception","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"697381aba959e7a5cc7d92b71de99cad6c4c28ac","infoHashBuffer":{"type":"Buffer","data":[105,115,129,171,169,89,231,165,204,125,146,183,29,233,156,173,108,76,40,172]},"announce":[],"urlList":[]}}