{"title":"Pop Culture and Philosophy - a bunch more","uid":5163113,"size":64929753,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6ba6ba4a0739878b7953d6dceb62900b248a93d1&amp;dn=Pop+Culture+and+Philosophy+-+a+bunch+more&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"th-mach","files":43,"time":1258265114,"description":"Here are some more books on popular culture and philosophy.  Most are PDF format, very good quality. PLEASE SEED!!\n\nArt of the Ridiculous Sublime - On David Lynch's Lost Highway - Slavoj Zizek.pdf\nBasketball and Philosophy - Jerry L. Walls, Gregory Bassham, eds.pdf\nBattlestar Galactica and Philosophy - Jason T. Eberl, ed.pdf\nComics as Philosophy - Jeff McLaughlin, ed.pdf\nDaily Show and Philosophy - Jason Hold, ed.pdf\nDoing Philosophy at the Movies - Richard A. Gilmore.pdf\nEternal Sunshine of the Spotless Mind (Philosophers on Film) - Christopher Grau, ed.pdf\nFootball and Philosophy - Michael W. Austin, ed.pdf\nGospel of the Living Dead - George Romero's Visions of Hell on Earth - Kim Paffenroth.pdf\nMatrix and Philosophy - William Irwin, ed.pdf\nMatrix in Theory - Myriam Diocaretz, Stefan Herbrechter, eds.pdf\nMemento (Philosophers on Film) - Andrew Kania, ed.chm\nMetallica &amp; Philosophy - William Irwin, ed.pdf\nNoir Anxiety - Kelly Oliver, Benigno Trigo.pdf\nOn Film (Thinking in Action) - Stephen Mulhall.pdf\nOn Film 2e (Thinking in Action) - Stephen Mulhall.pdf\nPhilosophy &amp; The Matrix (excerpts) - Christopher Grau, ed.pdf\nPhilosophy &amp; The Matrix.pdf\nPhilosophy Goes to the Movies - An Introduction to Philosophy - Christopher Falzon.pdf\nPhilosophy of Film and Motion Pictures - An Anthology - Noel Carroll, Jinhee Choi, eds.pdf\nPhilosophy of Film Noir - Mark T. Conard, ed.pdf\nPhilosophy of Horror - Or, Paradoxes of the Heart - Noel Carroll .pdf\nPhilosophy of Martin Scorsese - Mark T. Conard, ed.pdf\nPhilosophy of Neo-Noir - Mark T. Conard, ed.pdf\nPhilosophy of Science Fiction Film - Steven M. Sanders, ed.pdf\nPhilosophy of Stanley Kubrick - Jerold J. Abrams, ed.pdf\nPhilosophy of the Coen Brothers - Mark T. Conard, ed.pdf\nPhilosophy of the X-files - Dean A. Kowalski, ed.pdf\nPhilosophy of TV Noir - Steven M. Sanders, Aeon J. Skoble, eds.pdf\nPhilosophy, Black Film, Film Noir - Dan Flory.pdf\nRoutledge Companion to Philosophy and Film - Paisley Livingstone, Carl Plantinga, eds.pdf\nSimpsons and Philosophy - William Irwin, Mark T. Conard, Aeon J. Skoble, eds.htm\nSimpsons and Philosophy - William Irwin, Mark T. Conard, Aeon J. Skoble, eds.lit\nSimpsons and Philosophy - William Irwin, Mark T. Conard, Aeon J. Skoble, eds.pdf\nSouth Park and Philosophy - Robert Arp, ed.pdf\nSteven Spielberg and Philosophy - Dean A. Kowalski, ed.pdf\nTalk to Her (Philosophers on Film) - A.W. Eaton, ed.pdf\nTerminator and Philosophy - Richard Brown, Kevin S. Decker, eds.pdf\nThin Red Line (Philosophers on Film) - David Davies, ed.pdf\nThinking on Screen - Film as Philosophy - Thomas Wartenburg.pdf\nTwilight and Philosophy - Rebecca Housel, J. Jeremy Wisnewski, eds.pdf\nWatchmen and Philosophy - Mark D. White, ed.pdf\nX-Men and Philosophy - Rebecca Housel, J. Jeremy Wisnewski, eds.pdf\n","torrent":{"xt":"urn:btih:6ba6ba4a0739878b7953d6dceb62900b248a93d1","amp;dn":"Pop+Culture+and+Philosophy+-+a+bunch+more","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ba6ba4a0739878b7953d6dceb62900b248a93d1","infoHashBuffer":{"type":"Buffer","data":[107,166,186,74,7,57,135,139,121,83,214,220,235,98,144,11,36,138,147,209]},"announce":[],"urlList":[]}}