{"title":"Sri KrishnaArjuna Yudham (1963) Telugu_Xvid 2cd_Eng Subs [DDR]","uid":8914533,"size":1529260479,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6bb05a4526baebad54f584fff8cfa107911f486f&amp;dn=Sri+KrishnaArjuna+Yudham+%281963%29+Telugu_Xvid+2cd_Eng+Subs+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1379107764,"description":"Sri KrishnaArjuna Yudham (1963) Telugu_Xvid 2cd_Eng Subs [DDR]\n\nCAST:- \nNandamuri Taraka Rama Rao\nAkkineni Nageshwara Rao\nB. Saroja Devi\nDhulipala Seetarama Sastry\nS. Varalakshmi\nMikkilineni\nTadepalli Lakshmi Kanta Rao\nM. Prabhakar Reddy\nSriranjani\nGummadi Venkateswara Rao\nChittor V. Nagaiah\nRushyendramani\nChhaya Devi\nKaikala Satyanarayana\nMukkamala Krishna Murthy\nAllu Ramalingaiah\nBalasaraswati'\n\nDirector: Kadri Venkata Reddy\nProducers: Kadri Venkata Reddy and T. Pattabhirama Reddy\nMusic by Pendyala Nageshwara Rao\nLyrics by Pingali Nagendra Rao .\nPlayback Singers: B. Gopalam, B. Vasantha, Ghantasala Venkateswara Rao, Madhavapeddi Satyam, P. Susheela, S. Varalakshmi, Swarnalatha\n\nSongs are Included in MP3s\nSri Krishna Arjuna Yuddhamu 1963 Telugu 00. Deva Deva Narayana .. Title Music and Screen Credits, Pingala Nagendra Rao\t\nSri Krishna Arjuna Yuddhamu 1963 Telugu 01. Aligithiva Sakhi Priya, Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 02. Sloka-1, Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 03. Anni Manchi Sakunamule, Ghantasala, Susheela, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 04. Vasudevasutham Devam - Sloka, Ghantasala, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 05. Swamula Sevaka Velaaye, Susheela, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 06. Chaalada Ee Pooja Devi, Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 07. Anchelanchaluleni Mokshamue, Gopalam, Swarnalatha, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 08. Neekai ... Verse Only, Susheela, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 09. Neekai Vechithinayya, Susheela, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 10. Thapamu Phalinchina Shubhavelaa, Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 11. Bhalira (Padyam), Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 12. Veiyee Shubhamulu Kalugu Neeku, S. Varalakshmi, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 13. Namapoorvaaya (Sloka) , Ghantasala, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 14. Neeku Saathi Raviteja, B. Vasantha, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 15. Padyams, Ghantasala, Madhavapeddi, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 16. Padyams-2, Ghantasala, Madhavapeddi Sathyam, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 17. Manasu Parimalinchene, Ghantasala, Susheela, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 18. Padyams-3, Ghantasala, Madhavapeddi Sathyam, Pingali Nagendra Rao\nSri Krishna Arjuna Yuddhamu 1963 Telugu 19. Upakaarampulu, Ghantasala, Madhavapeddi Sathyam, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 20. Sloka-3, Ghantasala, Madhavapeddi Sathyam, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 21. Sloka-4, Ghantasala, Madhavapeddi Sathyam, Pingali Nagendra Rao \nSri Krishna Arjuna Yuddhamu 1963 Telugu 22. END SONG, Ghantasala, Pingali Nagendra Rao \n\nThe story is a combination of Parijatapaharanam, Subhadra Parinayam and Gayopakhyanam sequences in Hindu epic Mahabharata.\nParijat flower bought from Heaven by Narada is gifted to Sri Krishna, who in turn gives it to Rukmini. Satyabhama, learning this, gets angry upon Krishna and hits him with her foot. He begs her pardon for seeking affection.\nSubhadra is Sri Krishna's sister. Arjuna, in guise of a Munishwar, goes to Dwaraka and with Krishna's help comes close to Subhadra and finally marries her.\nGayopakhyanam was a popular play written by Chilakamarthi Lakshmi Narasimham. Krishna and Arjuna fight for the life of Gaya, a Gandharva king, accidentally spitting into Sri Krishna's palms. Finally Lord Shiva averts war and resulting mass destruction.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Bitrate: 1295 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: Telugu\nRunTime: 2:39:05\nSubtitles: English\nRipped by: Trinidad [DDR]   \nDuration: 2:39:05","torrent":{"xt":"urn:btih:6bb05a4526baebad54f584fff8cfa107911f486f","amp;dn":"Sri+KrishnaArjuna+Yudham+%281963%29+Telugu_Xvid+2cd_Eng+Subs+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6bb05a4526baebad54f584fff8cfa107911f486f","infoHashBuffer":{"type":"Buffer","data":[107,176,90,69,38,186,235,173,84,245,132,255,248,207,161,7,145,31,72,111]},"announce":[],"urlList":[]}}