{"title":"King Tiger vs IS-2: Operation Solstice 1945","uid":6636140,"size":3843465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c1ccc902093943ea29bb13a894af194d1d5e3d5&amp;dn=King+Tiger+vs+IS-2%3A+Operation+Solstice+1945&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1314564525,"description":"\nAs a prelude to the post-war concept of a single &quot;main battle tank&quot; design, vehicles during World War II tended to be categorized as light, medium, and heavy, depending on their use. In this last category, tanks had grown in size, weight, and firepower to counter ever-improving anti-tank weapon systems. This resulted in changes in tactics and doctrine to better integrate heavy armor into a combined arms system. This was especially true on the Eastern Front, where the open terrain promoted armor action and a rapid cycle of improvements. The Soviets were quick to develop vehicles that were able to fight the Tiger I on an equal footing by late 1943, such as the up-gunned T-34/85 and the self-propelled ISU-152s. Because the American T-26/M-26 Pershing arrived late in the war, and the British Centurion not at all, only the Soviet IS-2 serves as an example of a heavy design that was fielded in large battlefield numbers. The Soviet drive to cut off enemy forces in East Prussia during Operation Solstice (February 1945) is a prime example of this conflict. The Germans, had limited resources, and were strategically on the defensive, but enjoyed ever-shorter logistic distances as they retreated, and fought in an environment and terrain that played to the strengths of the technically-superior King Tiger. The IS-2 was lighter, more maneuverable, and far more numerous, and used these assets to its advantage. This battle, fought in the closing months of the war, depicts the classic late-war contrast between the military doctrines of Germany and the Soviet Union. \n\nAugust 2011\nPublisher: Osprey Publishing, Limited\nFormat: Paperback , 80pp\n","torrent":{"xt":"urn:btih:6c1ccc902093943ea29bb13a894af194d1d5e3d5","amp;dn":"King+Tiger+vs+IS-2%3A+Operation+Solstice+1945","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c1ccc902093943ea29bb13a894af194d1d5e3d5","infoHashBuffer":{"type":"Buffer","data":[108,28,204,144,32,147,148,62,162,155,177,58,137,74,241,148,209,213,227,213]},"announce":[],"urlList":[]}}