{"title":"FREE  TIBET","uid":3667818,"size":20558872,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:6cc9ffe094d7d216caf7688c44b94e7ae00a38db&amp;dn=FREE++TIBET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"unixdebest","files":119,"time":1176977682,"description":"Graphic, maps, photo, wallpapers.\n\nThe oldest on Earth, after Aboriginal culture, is the 20 000 years old culture of Tibet. Through its religious practice, this fierce and bold people became a society of a highly developed conscience.\nIn their attitude towards matter and soul, Bon, Dzogchen and Buddhism represented a common basis. This effected in a humble, but sufficient in the existing conditions, financial success. The unoppressed growth of this exceptional enclave, situated in the heart of the Himalai Mountains, was brutally terminated by Chinese occupation and extermination of Tibetan monks. From our point of view, i.e. the world&amp;#039;s point of view, this means the beginning of a war of conscience.\nWe intend to overcome the paranoia of borders and any kind of violence.\n\n&quot;Protect man, protect human beings&quot;\nThe Tibetan people, their culture and the teachings of Buddha can survive for the benefit of all feeling beings only with the help of Western people.\nIt would be good if the society could help the noble idea of the FREE TIBET action. Therefore, we plead all persons and institutions, that could help this action in a direct and way, for support.\nAfter all, we can all feel, and therefore should care about the safety, hapiness and love of other people.","torrent":{"xt":"urn:btih:6cc9ffe094d7d216caf7688c44b94e7ae00a38db","amp;dn":"FREE++TIBET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cc9ffe094d7d216caf7688c44b94e7ae00a38db","infoHashBuffer":{"type":"Buffer","data":[108,201,255,224,148,215,210,22,202,247,104,140,68,185,78,122,224,10,56,219]},"announce":[],"urlList":[]}}