{"title":"Mr Unavailable and the FallBack Girl.epub","uid":7550311,"size":397297,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6dd7dc43f4b83467fc9040959f913151b015522e&amp;dn=Mr+Unavailable+and+the+FallBack+Girl.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"toxicas","files":1,"time":1345423917,"description":"I uploaded this one yesterday but in the wrong format! Here it is in epub.\n\n\nIf you've ever found yourself in a relationship that feels and seemingly looks like one but you're struggling with commitment or you've been in the ambiguous territory of a 'casual relationship', you've likely tried to change them, wondered what you 'did' to cause this, what you can do to win their love and commitment, or even whether you're going crazy. Mr Unavailable and the Fallback Girl is the definitive guide to understanding the relationship between emotionally unavailable men and the women that love them. From explaining how and why they blow hot and cold, to where that future they promised went to, how you've ended up being a booty call, why you've been together for a gazillion years but aren't going anywhere, and more importantly how and why you're involved with them in the first place, all of the answers are here. You know you're dealing with unavailability when you ask stuff like\nWhat happened to that 'great guy' from the beginning?\nWhy won't he break up or stay away if he doesn't want to commit?\nWhat the hell did I do to make him disappear?\nIs he going to leave 'her' for me?\nIt's because he's shy/busy/scared of his feelings isn't it?\nInspired by the real life adventures in unavailability of Natalie Lue and the readers of her site BaggageReclaim.com, Mr Unavailable and the Fallback Girl is an empowering, entertaining and inspiring read that will wise you up to pitfalls such as men who aren't over their exes, Future Fakers, guys that have more baggage than a Heathrow terminal and reappearing childhood 'sweethearts'. If you want to understand your own availability, and why commitment in a healthy relationship is eluding you, Mr Unavailable and the Fallback Girl is your guide to being available and attracted to healthy, available partners.\t","torrent":{"xt":"urn:btih:6dd7dc43f4b83467fc9040959f913151b015522e","amp;dn":"Mr+Unavailable+and+the+FallBack+Girl.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dd7dc43f4b83467fc9040959f913151b015522e","infoHashBuffer":{"type":"Buffer","data":[109,215,220,67,244,184,52,103,252,144,64,149,159,145,49,81,176,21,82,46]},"announce":[],"urlList":[]}}