{"title":"MAGIA NELLA NOTTE - GIOTTO[TNTVILLAGE]","uid":5153644,"size":595716814,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6f1b0cd7a914cb5aab1e15d1c220a9ea2c8acb8e&amp;dn=MAGIA+NELLA+NOTTE+-+GIOTTO%5BTNTVILLAGE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":4,"time":1257713782,"description":"-[color=BLUE][b][u] MAGIA NELLA NOTTE[/u][/b][/COLOR][color=RED]\n[b]\nGIOTTO[/b] [/color]\n\n[img]http://img98.imageshack.us/img98/3366/magiagiotto.png[/img]\n\n[b][color=RED]CONTENUTI[/b]\n\nQuesta pubblicazione fa parte della Collana &quot;L'Artista e la vita&quot; edita da Giovanni &amp; Iris Editors.\n\nComprende:[b][color=fuchsia][u]\n\n1) Magia nella notte - Giotto - Durata 37'38&quot; \n\n2) BackStage - Durata 9'33&quot;\n\n3) Galleria Virtuale 3D - Durata 11'39&quot;\n[/u][/b][/color][/color]\n\n[img]http://img256.imageshack.us/img256/2166/menuco.jpg[/img]\n\n\n[color=red][i][b][u]SU GIOTTO [/u][/b][/i][/color] \n\n\n[b][color=RED] ITALIAN[/color][/b]\n\nGiotto ÃƒÂ¨ diventato il simbolo di un rinnovamento profondo nella storia della civiltÃƒÂ  figurativa occidentale, anzi del primo rinnovamento radicale dopo \n\nl'antichitÃƒÂ .\n&quot;RimuttÃƒÂ² l'arte del dipingere di greco in latino, e ridusse al moderno&quot;: cosi sintetizzava Cennino Cennini circa cinquant'anni dopo la morte del maestro, \n\nevidenziando il carattere rivoluzionario della nuova pittura.\nNato nel 1267, egli dovette essere giÃƒÂ  attivo prima del'ultimo decennio del Duecento.\nGiotto lavora per i Bardi e i Peruzzi, cioÃƒÂ¨ le famiglie fiorentine titolari delle piÃƒÂ¹ importanti banche europee di allora. Lavora per la basilica di San \n\nFrancesco ad Assisi, cioÃƒÂ¨ per quella che era allora la chiesa piÃƒÂ¹ in vista della cristanitÃƒÂ ; lavora per il papa, per il piÃƒÂ¹ ricco e influente cittadino di \n\nPadova (Scrovegni), per la cappella e per l'altare maggiore della basilica di San Pietro a Roma, per il re di Napoli e per Azzone Visconti, signore di \n\nMilano. In un'epoca in cui l'eccezionale espansione economica italiana fa di ogni centro cittadino una civiltÃƒÂ  con caratteri propri e una potenziale &quot;scuola&quot; \n\nartistica, Giotto si colloca in una posizione super-regionale, che rappresenta un punto di riferimento per tutti.\nSe guardiamo ai contenuti della sua rivoluzione artistica, dobbiamo convenire che le prime manifestazioni coerenti sono da vedere nella decorazione della \n\nbasilica superiore di Assisi. Questi affreschi fanno capo alla mente e, in parte, alla mano di chi piÃƒÂ¹ tardo realizÃƒÂ² gli affreschi della cappella degli \n\nScrovegni a Padova.\nÃƒË† molto probabile che Giotto lavorasse ad Assisi piÃƒÂ¹ di una decina d'anni prima che a Padova, e cioÃƒÂ¨ al 1290 o poco dopo.\nLa concezione dello spazio che viene formulata per la prima volta ad Assisi, giÃƒÂ  presente per gli antichi, era andata perduta nel Medioevo. Ma non si tratta \n\nsolo di un nuovo modo modo di fare pittura. L'idea di ricostruire illusionisticamente su una superficie a due dimensioni un spazio tridimensionale significa \n\nrendere alla realtÃƒÂ  che si controlla con i propri sensi il valore che aveva perduto.\nLa decorazione della cappella degli Scrovegni di Padova (tra il 1303 e il 1305) ÃƒÂ¨ indicata da tempo come l'opera piÃƒÂ¹ significativa e paradigmatica lasciataci \n\nda Giotto e come uno dei fatti capitali della storia della pintura europea.\nLa decorazione della basilica inferiore di Assisi (prima del 1309?), della cappella Peruzzi, dell capella Bardi (dopo il 1317) sono altre opere della \n\nmaturitÃƒÂ  del maestro.\nIl grande artista, diviso tra gli impegni di capomaestro dell'Opera del Duomo di Firenze (l'ideazione del Campanile appartiene a Giotto) e le piÃƒÂ¹ prestigiose \n\ncommissioni (tra il 1329 e il 1333 lavora a Napoli per il re Roberto di AngiÃƒÂ² verso il 1335 lavora a Milano per Azzone Visconti), dirige ancora con sicurezza \n\nla sua efficiente bottega, della quale escono opere di grande impegno figurativo e di stupefacente sontuositÃƒÂ  e fulgore cromatico, come i grandi polittici di \n\nBologna e della cappella Barroncelli in Santa Croce (Firenze), ambedue recanti la firma di Giotto.\n\n[b][color=RED]ENGLISH[/color][/b]\n\nGiotto has become the symbol of a profound renewal in the history of Western figurative arts, and of the first radical renewal since ancient Greece.\n&quot;He converted the art of painting from Greek to Latin and brought in the modern era&quot; - this is Cennino Cennini's synthesis fifty years after Giotto's death, \n\nunderscoring the revolutionary character of Giotto's painting.\nBorn in 1267, he must have been active before the last decade of thirteenth century.\nGiotto worked for the Bardi's and the Peruzzi's, the Florentine families who owned the most important European banks of the thirteenth century. He worked for \n\nthe Basilica of San Francesco in Assisi, which was the most important church of Christianity at the time; he worked for the Pope, for the richest and most \n\ninfluential citizen of Padova (Scrovegni), for the chapel and main altar of the Basilica of San Pietro in Rome, for the king of Napoli and for Azzone \n\nVisconti, the master of Milano. At a time when the exceptional Italian economic expansion turned every Italian city in a cultural center with specific \n\ncharacteristics and a potential artistic &quot;school&quot;, Giotto placed himself in a super-regional position, becoming a universal reference point.\nIf we look at the contents of his artistic revolution, we have to agree that the first manifestations are present in the decoration of the Assisi Upper \n\nBasilica. These frescos reveal the mind and, in part, the hand of the genius who created the frescos of Scrovegni Chapel in Padua.\nIt is very probable that Giotto has worked in Assisi about ten years earlier than in Padua, that is to say, around 1290 or a little later.\nThe concept of space formulated for the first time in Assisi was already known to the ancient Greeks and Romans, but had been lost in Medieval times. This is \n\nnot just a new way of painting. The idea of an illusionary reconstruction of a three-dimensional space on a two-dimensional surface also implies that the \n\nreality perceived through one's senses acquires a new artistic meaning.\nThe decoration of the Scrovegni Chapel in Padua (between 1303-1305) has been universally recognized as the most significant and most paradigmatic creation of \n\nGiotto and one of the capital events in the history of the European painting.\nThe decoration of the Assisi Lower Basilica (before 1309?), the Peruzzi Chapel, the Bardi Chapel (after 1317) also illustrate Giotto's radical innovations.\nDividing his time between his job as chief architect of the Duomo of Florence (the design of the belltower belongs to Giotto) and the many prestigious \n\ncommissions (between 1329-1333 he works in Naples for the king Robert of Anjou; in 1335 he works in Milano for Azzone Visconti), the great artist was also in \n\nfirm control of his &quot;school&quot;, which produced a number of works of great artistic value and unique chromatic splendor, such as the large polyptichs of Bologna \n\nand the Barroncelli Chapel in Basilica Santa Croce (Florence), both signed by Giotto.\n\n\n\n[color=red][i][b]SCREENSHOTS[/b][/i][/color]\n\n[img]http://img406.imageshack.us/img406/8960/giottoscreen.jpg[/img]\n\n[color=red][i][b][size=6]SCHEDA TECNICA[/size][/b][/i][/color]\n\n[b]AVInaptic Report!\n[/b]========================================\n\n\n[ Info sul file ]\n\nNome: Giotto.avi\nData: 2/11/2009 18:10:22\nDimensione: 156,538,880 bytes (149.287 MB)\n\n[ Info generiche ]\n\nDurata: 00:11:39 (699.12 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nJUNK: VirtualDubMod build 2540/release\n\n[ Giudizi sulla qualitÃƒÂ  ]\n\nRisoluzione: MOLTO ALTA (640 x 464)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 16 (BENE)\nQualitÃƒÂ  DRF medio: MEDIA (4.053095)\nQualitÃƒÂ  deviazione standard: MEDIA (1.064321)\nMedia pesata dev. std.: ALTA (0.646086)\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 640 x 464\nDisplay aspect ratio: 40:29 = 1.379310\nFramerate: 25 fps\nFrames totali: 17478\nBitrate: 1333.476576 kbps\nQf: 0.179616\nMax key int: 300\n\n[ Traccia audio ]\n\nAudio tag: 0x2000 (AC3)\nBitrate: 448 kbps CBR\nCanali: 6\nFrequenza: 48000 Hz\nStream size: 39,150,720 bytes\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: DivX503b1393p\nUser data: XviD0050\nPacked bitstream: SÃƒÂ¬ (*)\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: H.263\nFrames totali: 17478\nFrames corrotti: 0\n\n[ Analisi DRF ]\n\nDRF medio: 4.053095\nDeviazione standard: 1.064321\nDRF max: 7\n\n\nRapporto generato da AVInaptic (26-05-2007) in data  2 nov 2009, h 20:14:53\n\n\n[color=red][i][b]NOTE CONCLUSIVE[/b][/i][/color]\n[color=green]\nAudio = Italiano Ac3\nSottotitoli = Assenti\n[/color]\n\nTNTVILLAGE.SCAMBIOETICO.ORG","torrent":{"xt":"urn:btih:6f1b0cd7a914cb5aab1e15d1c220a9ea2c8acb8e","amp;dn":"MAGIA+NELLA+NOTTE+-+GIOTTO%5BTNTVILLAGE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f1b0cd7a914cb5aab1e15d1c220a9ea2c8acb8e","infoHashBuffer":{"type":"Buffer","data":[111,27,12,215,169,20,203,90,171,30,21,209,194,32,169,234,44,138,203,142]},"announce":[],"urlList":[]}}