{"title":"Gerry Mulligan - 2003 - The Complete Verve Gerry Mulligan Concer","uid":9466469,"size":1577596999,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7024ad089301114dee1595ba444aa1bc2bc6b31c&amp;dn=Gerry+Mulligan+-+2003+-+The+Complete+Verve+Gerry+Mulligan+Concer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1389465043,"description":"Gerry Mulligan - 2003 - The Complete Verve Gerry Mulligan Concert Band Sessions\n\nThis four disc-set contains all of the existing Concert Band Sessions from May 1960 to December 1962, and makes available for the first time five previously unreleased performances. Some seven others, whose original tapes are either missing or lost, are notated here for the sake of discography. This was, arguably -- after and aside from Mulligan's piano-less quartet with Chet Baker -- the most visionary music he ever made. It eclipses his nonet recordings of the 1950s because of the sophisticated charts written by trombonist Bob Brookmeyer, and the writing Mulligan was doing formed the strength of this band -- though this is not immediately apparent at the outset of Disc One. The set commences with a version of the band that included six brass, four reeds, Mulligan on baritone (and piano occasionally), bass, and drums. This band included Dave Bailey on drums, and Bill Takas on bass. Eight selections are issued here, one, a two-part 45, plus three previously unissued tracks. Some real nuggets were recorded here, including new Brookmeyer charts for &quot;My Funny Valentine,&quot; and &quot;Out Of This World.&quot; On the band's second outing, Mel Lewis replaced Bailey on drums, Buddy Clark replaced Takas on bass, and Nick Travis and Conte Candoli entered on trumpets, replacing Danny Stiles and Phil Sunkel on trumpets. The band's first album in this incarnation is one of most momentous, with stunning remakes of &quot;Django's Castle,&quot; &quot;Bweebida Bobbida,&quot; and &quot;Sweet And Slow.&quot; Zoot Sims entered the band late in the year, and those cuts include stellar and memorable readings of &quot;Come Rain Or Come Shine,&quot; &quot;Young Blood,&quot; and the preciously unreleased &quot;As Catch Can.&quot; Lewis remained with the band all the way until 1962, when he was replaced by Gus Johnson. More importantly, after the concert recordings of October 1960, Clark was replaced by the unsung Bill Crow on bass, and the big band really began its finest period, as evidenced by the Village Vanguard tapings from December 1960. Here, &quot;Body And Soul,&quot; &quot;Come Rain Or Come Shine,&quot; and &quot;Walkin' Shoes&quot; sound like brand new compositions because of the elegant counterpoint scripted by Brookmeyer and Mulligan. The reliance on these independently played lines in the backdrop of a solo was a trademark for this band, allowing for the most individual improvisations inside a tightly structured group. And given these sides, it's so easy to hear this as a band, and not just a collection of star soloists. The final disc is made up of Webster Hall performances form July 1961, which were the final sets played by the Lewis edition of the band. Mulligan's big band was fleshed out in 1962 with the addition of Jim Hall's textural richness on guitar at the end of 1962. From these two concerts &quot;Israel,&quot; &quot;Chuggin,'&quot; &quot;All About Rosie, Pt. 3,&quot; &quot;Big City Blues,&quot; &quot;My Kinda Love,&quot; and &quot;Bridgehampton Strut,&quot; are the most memorable, and offer the view of Brookmeyer as having already emerged and eclipsed the confines of the band. In all, this is an essential document and certainly comes in handy now that the Mosaic sets of Mulligan's quartet and nonet recordings are out of print . While Mulligan never really exhausted his creativity, these particular sessions, coming after the revolutionary big bands of Kenton in the 1950s, and before the Thad Jones/Mel Lewis Orchestra recordings of the mid-'60s, offer a stunning view of progressive big band music during the era. (AllMusic)\n\nTrack list:\nCD 1\n01 - Sweet And Slow\n02 - Bweebida Bobbida\n03 - Manoir De Mes Reves (Django's Castle)\n04 - You Took Advantage Of Me\n05 - Out Of This World\n06 - My Funny Valentine\n07 - Broadway\n08 - I'm Gonna Go Fishin'\n09 - I Know, Don't Know How\n10 - Barbara's Theme\n11 - Sweet And Slow [first version]\n12 - Out Of This World [first version]\nCD 2\n01 - Go Home\n02 - Barbara's Theme\n03 - Theme From 'I Want To Live'\n04 - The Red Door\n05 - Come Rain Or Come Shine\n06 - Apple Core\n07 - Go Home (short version)\n08 - As Catch Can\n09 - Young Blood\n10 - Blueport\nCD 3\n01 - Blueport\n02 - Body And Soul\n03 - Black Nightgown\n04 - Come Rain Or Come Shine\n05 - Lady Chatterly's Mother\n06 - Let My People Be\n07 - All About Rosie\n08 - Weep\n09 - I Know, I Don't Know How\n10 - Chuggin'\n11 - Summer's Over\n12 - Israel\nCD 4\n01 - Little Rock Getaway\n02 - Ballad\n03 - Big City Life\n04 - Big City Blues\n05 - My Kinda Love\n06 - Pretty Little Gypsy\n07 - Bridgehampton South\n08 - Bridgehampton Strut\n09 - Chant\n10 - Ballad (alt tk)\n11 - Bridgehampton South (alt tk)\n12 - Bridgehampton Strut (alt tk)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:7024ad089301114dee1595ba444aa1bc2bc6b31c","amp;dn":"Gerry+Mulligan+-+2003+-+The+Complete+Verve+Gerry+Mulligan+Concer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7024ad089301114dee1595ba444aa1bc2bc6b31c","infoHashBuffer":{"type":"Buffer","data":[112,36,173,8,147,1,17,77,238,21,149,186,68,74,161,188,43,198,179,28]},"announce":[],"urlList":[]}}