{"title":"Single Crystal Growth of Semiconductors from Metallic Solutions","uid":14557288,"size":37961991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7065e8f2c09138a5a453828eac23d775d14debfd&amp;dn=Single+Crystal+Growth+of+Semiconductors+from+Metallic+Solutions&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462698865,"description":"Single Crystal Growth of Semiconductors from Metallic Solutions - Sadik Dost, Brian Lent (Elsevier, 2007).pdf\r\n\r\nISBN 978-0-444-52232-0\r\n\r\nSingle Crystal Growth of Semiconductors from Metallic Solutions covers the four principal growth techniques currently in use for the growth of semiconductor single crystals from metallic solutions. Providing an in-depth review of the state-of-the-art of each, both experimentally and by numerical simulations. The importance of a close interaction between the numerical and experimental aspects of the processes is also emphasized.\r\nAdvances in the fields of electronics and opto-electronics are hampered by the limited number of substrate materials which can be readily produced by melt-growth techniques such as the Czochralski and Bridgman methods. This can be alleviated by the use of alternative growth techniques, and in particular, growth from metallic solutions. The principal techniques currently in use are: Liquid Phase Epitaxy; Liquid Phase Electroepitaxy; the Travelling Heater Method, and; Liquid Phase Diffusion.\r\nSingle Crystal Growth of Semiconductors from Metallic Solutions will serve as a valuable reference tool for researchers, and graduate and senior undergraduate students in the field of crystal growth. It covers most of the models developed in recent years. The detailed development of basic and constitutive equations and the associated interface and boundary conditions given for each technique will be very valuable to researchers for the development of their new models.\r\n\r\n* Describes the fundamentals of crystal growth modelling\r\n* Providing a state-of-the art description of the mathematical and experimental growth processes\r\n* Allows reader to gain clear insight into the practical and mathematical aspects of the topic","torrent":{"xt":"urn:btih:7065e8f2c09138a5a453828eac23d775d14debfd","amp;dn":"Single+Crystal+Growth+of+Semiconductors+from+Metallic+Solutions","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7065e8f2c09138a5a453828eac23d775d14debfd","infoHashBuffer":{"type":"Buffer","data":[112,101,232,242,192,145,56,165,164,83,130,142,172,35,215,117,209,77,235,253]},"announce":[],"urlList":[]}}