{"title":"Living Luminaries - On the serious business of Happiness","uid":4086887,"size":1135536194,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:70715f4d20f4258f811efa1c2034b870a4043d68&amp;dn=Living+Luminaries+-+On+the+serious+business+of+Happiness&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hspinc","files":1,"time":1205862518,"description":"\n\n\n\nLiving Luminaries (on The Serious Business of Happiness) -- a powerful new motion picture featuring the insights of the &quot;consciously evolved A-list&quot; of stars in the Cultural Creative movement. Some of the 18 Living Luminaries-\n\nMichael Bernard Beckwith\nEckhart Tolle\nMarianne Williamson\nDon Miguel Ruiz\n\nThe NY Times best sellers; Marianne Williamson (A Return to Love, Illuminata), Eckhart Tolle (The Power of Now), Don Miguel Ruiz (The Four Agreements), Gary Renard ( The Disappearance of the Universe), and Matthew Kelly (Seven Levels of Intimacy.)\n\nReligious and spiritual leaders: Nachum Shiffren (&quot;The Surfing Rabbi&quot;), Rev. Robert A. Schuller (of the Crystal Cathedral), the Venerable Tibetan Lama Chodak Gyatso Nupka, Michael Bernard Beckwith, Don Jose Ruiz, Rev. Mary Manin Morrissey, and Dr. Harry Morgan Moses.\n\nOutspoken advocates of civil rights: Geronimo Ji Jaga (Black Panther - aka. Geronimo Pratt) and Marc Emery (Canadian marijuana activist.)\n\nContemporary thinkers and enlightened teachers: Obadiah S. Harris, Ph.D. (of the University of Philosophical Research), Professor Steven Droullard, Dr. Robert Frager, Rabbi Yitchok Adlerstein (of Loyola University) and Rev. Dr. William S. Epps.\n\nOur young seeker&amp;#039;s quest takes him to some of the foremost, most inspirational individuals of our day. Change your life, Now, and join him on the journey... ","torrent":{"xt":"urn:btih:70715f4d20f4258f811efa1c2034b870a4043d68","amp;dn":"Living+Luminaries+-+On+the+serious+business+of+Happiness","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70715f4d20f4258f811efa1c2034b870a4043d68","infoHashBuffer":{"type":"Buffer","data":[112,113,95,77,32,244,37,143,129,30,250,28,32,52,184,112,164,4,61,104]},"announce":[],"urlList":[]}}