{"title":"Second World War Infantry Tactics: The European Theatre","uid":9040483,"size":10729947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70bcc9950e7bd6b7434a3b58f3babb12d41738b7&amp;dn=Second+World+War+Infantry+Tactics%3A+The+European+Theatre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1381609979,"description":"Second World War Infantry Tactics: The European Theatre\nby Stephen Bull\n\nDESCRIPTION:\n\nThe 'poor bloody infantry' do the dirty front-line work of war. It bears the brunt of the fighting and often suffers disproportionately in combat in comparison with the other arms of service. Yet the history of infantry tactics is too rarely studied and often misunderstood.Stephen Bull, in this in-depth account, concentrates on the fighting methods of the infantry of the Second World War. He focuses on the infantry theory and the combat experience of the British, German and American armies. His close analysis of the rules of engagement, the tactical manuals, the training and equipment is balanced by vivid descriptions of the tactics as they were tested in action. These operational examples show how infantry tactics on all sides developed as the war progressed, and they give a telling insight into the realities of infantry warfare.His study sets Second World War infantry tactics in the long historical context. It records how the artillery and automatic weapons of the First World War swept away the lines and columns of the nineteenth century. It goes on to describe the tactics of the main protagonists in 1939-45, looking in particular at the infantry's role in blitzkrieg and at the growing significance of sections and squads. And it emphasizes the increasing importance of combat in urban areas - in buildings, sewers and rooftops - which evolved through the experience gained in bitter protracted urban battles like Stalingrad.Stephen Bull's accessible and wide-ranging survey is a fascinating introduction to the fighting methods of the opposing ground forces as they confronted each other on the European battlefields of 70 years ago.\n\nAmazon.co.uk title link: &lt;a href=&quot;\nhttp://www.amazon.co.uk/Second-World-War-Infantry-Tactics/dp/1848840705&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Second-World-War-Infantry-Tactics/dp/1848840705&lt;/a&gt;","torrent":{"xt":"urn:btih:70bcc9950e7bd6b7434a3b58f3babb12d41738b7","amp;dn":"Second+World+War+Infantry+Tactics%3A+The+European+Theatre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70bcc9950e7bd6b7434a3b58f3babb12d41738b7","infoHashBuffer":{"type":"Buffer","data":[112,188,201,149,14,123,214,183,67,74,59,88,243,186,187,18,212,23,56,183]},"announce":[],"urlList":[]}}