{"title":"Ableton Live 8.1.4","uid":5747306,"size":2103259136,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:724aa06d2bf424e2f076cad7ac7807b8050ddcea&amp;dn=Ableton+Live+8.1.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pars18","files":1,"time":1281267949,"description":"\n\nAbleton Suite is a complete software studio. Suite 8 gives you all of the features in Live 8 plus SOUND, with a radically new Library packed with beautiful new sounds and a wealth of useful resources. Suite 8 contains 10 Ableton instruments including synths, a sampler, electric and acoustic drums, mallets, numerous sampled instruments and the new, reworked Operator. Two completely new instruments, Collision and Latin Percussion, round off the set. Ableton Suite 8 is a complete package: the tools AND the sounds.\n\n\n\n\nKey features:\n\nMultitrack recording up to 32-bit/192 kHz\nNondestructive editing with unlimited undo\nPowerful MIDI sequencing of software and hardware instruments\nAdvanced warping and real-time time-stretching\nLibrary with over 1600 expressive sounds, each with versatile control options\nA comprehensive selection of built-in audio and MIDI effects\nA wide range of software instruments\nInstrument Racks for simple management of complex instrument setups\nDrum Racks for intuitive and responsive beat-making\nEffect Racks for professional-grade mastering, mixing and creative sound processing\nNew groove engine; apply and extract grooves in real time\nConstruction kits containing loops and phrases in a number of styles\nSound Objects Lite, from SonArte: a toolkit of real world object recordings\n440 MB of abstract, experimental loops from renowned music software pioneers Cycling '74 *\nOver 400 loops and samples from Zero-G *\n1000s of single-device presets: simple components for making new sounds and exploring synthesis\nSong templates with pre-configured tracks and routing\nSupports AIFF, WAV, MP3, Ogg Vorbis and FLAC files\nVST and AU support; automatic plug-in delay compensation\nREX file support plus built-in audio to MIDI slicing\nVideo import and export for scoring, video warping\nSimple MIDI mapping plus instant mapping for selected hardware\nFull ReWire support; runs as Slave or Master\nMulticore and multiprocessor support\n\n\n\n\nAbleton.Suite.v8.1.4.MAC.OSX.INTEL-ArCADE\n\n\n1)   Unpack, mount or burn\n\n\n&gt;&gt;&gt;  You can choose between &quot;program only&quot; or &quot;program with content&quot;\n\n\n2)   Copy Live 8.1.4 OS X to applications folder and drag Authorize814.auz on live.app (Program will start and selfauthorize) \n\n\n&gt;&gt;&gt;  Our new Authorization Key (.auz file) enables usage of all currently available partner program payware instruments\n  \n&gt;&gt;&gt;  Note: You still need the paid instrument addon installers to use it and they will work without registration\n\n&gt;&gt;&gt;  As extra we added the retail flatpack instruments packages ... just drag'n'drop them on ableton gui\n\n\n3)   Enjoy  !!!","torrent":{"xt":"urn:btih:724aa06d2bf424e2f076cad7ac7807b8050ddcea","amp;dn":"Ableton+Live+8.1.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"724aa06d2bf424e2f076cad7ac7807b8050ddcea","infoHashBuffer":{"type":"Buffer","data":[114,74,160,109,43,244,36,226,240,118,202,215,172,120,7,184,5,13,220,234]},"announce":[],"urlList":[]}}