{"title":"Sons of Anarchy S05E05 720p HDTV MPEG2 SM10 (Optimised for PS3)","uid":7712871,"size":1738958909,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7288cb01bb71e9360e2587ea379710f14d6c437e&amp;dn=Sons+of+Anarchy+S05E05+720p+HDTV+MPEG2+SM10+%28Optimised+for+PS3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flying_Milkan","files":2,"time":1349850531,"description":"8.7/10 (37,905 votes)\n\nRuntime: 45 min\n\nLanguage: English\n\nDirector: Gwyneth Horder-Payton, Paris Barclay, Guy Ferland, Bill Gierhart, Stephen Kay, Kurt Sutter, Adam Arkin, Peter Weller, Terrence O'Hara, Paul Maibaum, Phil Abraham.\n\nCast: Charlie Hunnam, Mark Boone Junior, Kim Coates, Tommy Flanagan, Maggie Siff, Katey Sagal, Ron Perlman, Theo Rossi, Ryan Hurst, Dayton Callie.\n\nLink: http://www.imdb.com/title/tt1124373/\n\n\n\n\n\n\nSons of Anarchy is an American television drama series created by Kurt Sutter about the lives of a close-knit outlaw motorcycle club operating in Charming, a fictional town in the Central Valley of Northern California. The show centers on protagonist Jackson &quot;Jax&quot; Teller (Charlie Hunnam), the then-Vice President of the club who begins questioning the club and himself.\n\nSons of Anarchy premiered on September 3, 2008, on cable network FX. The third season of the series attracted an average of 4.9 million viewers per week, making it FX's highest rated series ever, surpassing FX's other hits The Shield, Nip/Tuck, and Rescue Me. On February 3, 2012, Sons of Anarchy was renewed for two additional seasons, a fifth and a sixth. Those involved in the production of the series infer that a seventh and final season is the creator, Kurt Sutter,'s plan.\n\nThanks to EVOLVE for the original source file, however MKV's do not work natively on PS3 so this has been given the SM10 touch. Converted to MPEG2 and re-synced to accommodate that change as configured a few filters to maximise colour on those bigger screens.\nThis is a regular upload of mine so feel free to revisit, subsequent weeks.","torrent":{"xt":"urn:btih:7288cb01bb71e9360e2587ea379710f14d6c437e","amp;dn":"Sons+of+Anarchy+S05E05+720p+HDTV+MPEG2+SM10+%28Optimised+for+PS3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7288cb01bb71e9360e2587ea379710f14d6c437e","infoHashBuffer":{"type":"Buffer","data":[114,136,203,1,187,113,233,54,14,37,135,234,55,151,16,241,77,108,67,126]},"announce":[],"urlList":[]}}