{"title":"Iron Maiden Live After Death","uid":4905832,"size":15042295855,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:733a479084eb990e38fb6344583bd3fc6df4eaa1&amp;dn=Iron+Maiden+Live+After+Death&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dante.Xaiver","files":-1,"time":1242889833,"description":"Live After Death is the video compendium to the legendary double-live Iron Maiden album of the same name. Released in VHS/Beta/LaserDisc/VHD/Hi-8 and DVD. Prior to the official DVD release in 2008, bootleg DVDs from Brazil had been illegally sold over the past few years. These DVDs were obviously produced using the laserdisc release of the video as the master.\n\nThe video captures Iron Maiden in concert, recorded over a sold-out four-night stand at Long Beach Arena in March, 1985 during their World Slavery Tour. The video contains footage from a completely different night than the album. This video was originally aired as a special on MTV.\n\nIron Maiden released it on DVD on 4 February 2008, which coincided with the start of the band's Somewhere Back In Time World Tour.[1] On March 11, 2008 it was certified Gold by the RIAA having sold 50,000 units.[2] The new release had two mixes of the audio: Martin Birch's version which serves as the original concert audio, and a brand new 5.1 Stereo mix by Kevin Shirley. In addition to the nearly complete concert, the DVD followed up the documentary of the band on 2004's The Early Years with a focus on the Powerslave era of the band, as well as featuring a documentary on the band's tour of Poland and Germany, highlights of their set at Rock in Rio 1985 and other assorted footage.\n\nLive After Death is distributed in the U.S. by Universal Music Group/Sony BMG Music Entertainment and in the rest of the world by EMI. It has been labeled with the Parental Advisory sticker due to profanity in the concert and the History of Iron Maiden documentary.\n\n\nDisc 1\n\n   1. &quot;Intro: Churchill's Speech&quot;/&quot;Aces High&quot;\n   2. &quot;2 Minutes to Midnight&quot;\n   3. &quot;The Trooper&quot;\n   4. &quot;Revelations&quot;\n   5. &quot;Flight of Icarus&quot;\n   6. &quot;Rime of the Ancient Mariner&quot;\n   7. &quot;Powerslave&quot;\n   8. &quot;The Number of the Beast&quot;\n   9. &quot;Hallowed Be Thy Name&quot;\n  10. &quot;Iron Maiden&quot;\n  11. &quot;Run to the Hills&quot;\n  12. &quot;Running Free&quot;\n  13. &quot;Sanctuary&quot;\n\nDVD Disc 2\n\n   1. The History of Iron Maiden - Part 2 (60 mins)\n          * Continuation of the History of Iron Maiden self-documentary from The Early Days. Band members, crew, friends and associates talk about the period in the band's career which saw the writing, recording and release of the Powerslave album, and later Live After Death, and the subsequent massive touring.\n   2. Behind the Iron Curtain (57 mins approx)\n          * Shot during Maiden's historic tour of Poland and other parts to the Eastern Bloc in 1984 featuring interviews, live and offstage footage capturing the atmosphere of this remarkable journey behind the Wall at the height of the Cold War.\n   3. Live Footage - Rock in Rio '85 (50 mins approx)\n          * Highlights from the Maiden set supporting Queen on the first day of the first Rock in Rio in front of 350,000.\n   4. 'Ello Texas (15 minutes)\n          * Interview and live performance. Caught by a film crew in 1983 at the Alamo and sound checking their show in San Antonio.\n   5. Artwork Gallery, Tour Programme, Tour dates and photo gallery\n   6. Promotional clips for &quot;Aces High&quot; and &quot;2 Minutes to Midnight.&quot;\n","torrent":{"xt":"urn:btih:733a479084eb990e38fb6344583bd3fc6df4eaa1","amp;dn":"Iron+Maiden+Live+After+Death","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"733a479084eb990e38fb6344583bd3fc6df4eaa1","infoHashBuffer":{"type":"Buffer","data":[115,58,71,144,132,235,153,14,56,251,99,68,88,59,211,252,109,244,234,161]},"announce":[],"urlList":[]}}