{"title":"autechre.3.albums.plus.more 5.meo.dmt","uid":3235692,"size":341980689,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74a8e1fe8055fd31b2b40edfeaf5d6137eae4793&amp;dn=autechre.3.albums.plus.more+5.meo.dmt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dmt_rules","files":53,"time":1093995805,"description":"&amp;gt;------......---.--....--.....------(   (    ( ----&amp;lt;\n\n.\t[\t.\t5-MEO-DMT\t.\t]\t.\t.\t-  ^  ^\n\n\n5-MEO-DMT presents: Autechre (AE), the stunning crazy smart mindblowing duo from England. \n\n\n\n\n\n\n\nThe package contains 3 Albums:           \n                                         \n\nÂ¤Â¤Â¤Â¤Â¤)   Draft 7.30    Released 2003-04-07  \n\nÂ¤Â¤Â¤Â¤Â¤)   Confield      Released 2001-04-30    \n\nÂ¤Â¤Â¤Â¤Â¤)   EP7           Released 1999-06-07      \n\n\nThe albums arenÂ´t that new as you can see, but they are some of the best IDM Electronica-records ever released. Respect.\n\n \n\n\n+ some extra goodies included in this release!!:\n\n\nÂ¤Â¤Â¤Â¤Â¤ Some unreleased tracks from the Draft 7.30 Promo. &amp;lt;------- \n\nÂ¤Â¤Â¤Â¤Â¤ A bunch of good tracks from the older AE-albums!  &amp;lt;-------\n\nÂ¤Â¤Â¤Â¤Â¤ Some kick-ass tracks from other artists in the scene (Which artists? We havenÂ´t decided yet, but probably something with Emma Bunton, Darren Hayes, Elton John, Kriss Kross etc..)    \n\n\n\n\n...Just kidding :) What we really did was to add some Excellent tracks, both new and old ones, by the artists we think do the Best music, for example: Squarepusher, Bogdan Raczynski, Venetian Snares and Aphex Twin. Maybe more if youÂ´re lucky...\n\n\nBy the way, we are 2 cool guys.\n\n\n Autechre control the scene in our opinion. The pioneers of electronic music. Always evolving from album to album, experimenting with very complex rythms combined with well placed strange beautiful noises and sounds. Some songs works fine as dancefloor-killers, but we think they are best listened to in your favourite chair. Maybe (read: of course) under the influence of your favourite drug. (if that drug is alcohol - remember that there are way much better drugs you can use to increase the enjoyment of your listening.)\n\n\nSometimes, Autechre is even better than sex, especially while tripping on LSD, DMT, Mushrooms or even Weed. Be careful. Take drugs at your own risk, and when you are in a good mood. A good &amp;quot;Set &amp;amp; Setting&amp;quot; is the key to a happy experience. i.e donÂ´t take your first LSD-trip on a 9 hour bus-trip on a bus full with angry football-hooligans. Instead, sit back relaxed (AE in your walkman) in some nice park where you can hide from cops and all other idiots. Or sit at home with some friends you feel comfortable with, and fill the room with IDM (Intelligent Dance Music, like Autechre) in your stereo.\n\n\n\nÂ¤ Here is a part of a review which shows what Richard Hurley at robotfist.com had to say about the &amp;quot;Draft 7.30&amp;quot; album:\n\n&amp;quot;The sensuous yet clinical electro of P.:NTIL(track 8) and V-Proc's(track 9) tactile robofunk squiggles further enhance Draft 7.30's credentials. Autechre have again created an album without anything even resembling a standard tune, but have done so in an inviting way. Draft 7.30 contains tracks that resemble the type of random music that exists in people's minds before any notions of structure or song enter into the equation. As a result, Autechre have given us a set that is still difficult to hear, but immensely worth listening to again and again. They're still the band most likely to be played in clubs where you can only order drinks in binary, but (in this case) that is not a bad place to be.&amp;quot; \n\n\n\nÂ¤ Benjamin Bunny (whoÂ´s that?) at metacritic.com gave the &amp;quot;Confield&amp;quot; album a perfect 10!:\n\n&amp;quot;Confield&amp;quot;'s massive accompishment takes time to reveal itself, but once it does it makes most other electronic music sound childish--including Autechre's earlier albums. A most challenging, ecstatic, terrifying, thrilling, inditimidating, mind-altering experience...the best electronic record of this new century.&amp;quot;\n\n\n\n&amp;gt;\n&amp;gt;&amp;gt;\n&amp;gt;&amp;gt;&amp;gt;\nQuestion: Why arenÂ´t Autechre releasing any new album soon? It has been over 16 months since the last album (zzz), and if it takes much longer, people will both get hurt, mad and sad and will maybe even forget about Autechre totally. \n\n\n\nCome on now Autechre!!  We know about the 1000Â´s of songs in your computer... RELEASE!!  PLEASE!!\n\n\n\n ******************************************************************\n *   o  ***      o        ***      o         ***        o        **\n\n ******************************************************************\n * Thanks to Autechre for all your brilliant work.                *\n * WeÂ´ve had the best moments of our lives enjoying your music.   *\n ******************************************************************\n\n\n\nTo Autechre and Warprecords: We are sorry to release this compilation without your permission. But what can we do? We love your music and want everyone else to hear it. Ok, maybe youÂ´ll lose some money because people can download your music for free, but we believe that these persons would never had heard of your music if it wasnÂ´t for the Internet and people like us. We want to hear this kind of music on the radio! The first step is to spread the electronic beautifulness to the unaware people in the world.\n\n\nGreetings to all of you crazy music lovers, especially everyone from Sweden!! We should have more parties here, dont you think?\n\n\nMail us whatever you want(!) at: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;1a7e776e45686f767f695a72756e777b737634797577&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\n////  The nice guys on 5-MEO-DMT .                     [try it - or youÂ´ll never feel it]              \n\n","torrent":{"xt":"urn:btih:74a8e1fe8055fd31b2b40edfeaf5d6137eae4793","amp;dn":"autechre.3.albums.plus.more+5.meo.dmt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74a8e1fe8055fd31b2b40edfeaf5d6137eae4793","infoHashBuffer":{"type":"Buffer","data":[116,168,225,254,128,85,253,49,178,180,14,223,234,245,214,19,126,174,71,147]},"announce":[],"urlList":[]}}