{"title":"EnigmaT Set Rips { Cuts } - October 9th, 2013","uid":9023592,"size":1386236652,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74c9de9f14d05f0f84a33549192fae19432c1b72&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+9th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":154,"time":1381278304,"description":"1Touch - Be Strong (Club Mix) (Cut From Anderson Set)-enTc.mp3\nActive Limbic System - Ice Age (Set Rip)-enTc.mp3\nAeden - Time to say Goodbye (Original Mix) (Cut From Sty Set)-enTc.mp3\nAlex Daf - Te Quiero (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nAlex Di Stefano - Metamorphosis (Cut From J00F Set)-enTc.mp3\nAllNight feat. Laura Brehm - Mile High (James Egbert Remix) (Cut From Myon Set)-enTc.mp3\nAnalogue Sound Department - Rhodestep (Cut From Ferry Set)-enTc.mp3\nAndre Visior feat. Cathy Burton - Daylight (Eden Remix) (Cut From Anderson Set)-enTc.mp3\nAndrew Bayer - Perth (ABGT 048 Rip)-enTc.mp3\nAndrew Stets - The Prayer (Dima Krasnik Remix) (Cut From Anna Lee Set)-enTc.mp3\nAndromedha - Soul Prison (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nAndy Duguid feat. Jaren - 7even (Temple One Remix) (Cut From Del Mar Set)-enTc.mp3\nAndy Elliass &amp; ARCZI - Look At The Beautiful World (Original Mix) (Cut From Elliass Set)-enTc.mp3\nArmin van Buuren feat. Aruna - Won't Let You Go (Tritonal Remix) (Cut From Tritonal Set)-enTc.mp3\nArston - ID 001 + Calvin Harris feat. Kelis - Bounce (Acapella) (Set Rip)-enTc.mp3\nArston - ID 002 (Set Rip)-enTc.mp3\nArston - ID 003 (Set Rip)-enTc.mp3\nArston - Star Wars (Set Rip)-enTc.mp3\nAruna - Reason To Believe (Paris Blohm Remix) (Set Rip)-enTc.mp3\nAstral Projection - Mahadeva (Lyctum Remix) (Cut From J00F Set)-enTc.mp3\nAutocinema - Tractomula (Casey Rasch Remix) (Cut From Standerwick Set)-enTc.mp3\nBauer &amp; Lanford - Leave Me Behind (Kryder Remix) (Cut From Laruso Set)-enTc.mp3\nBeamrider - Missing (Original Mix) (Cut From Sty Set)-enTc.mp3\nBogdan Vix - Carpe Diem (Cut From Pit Set)-enTc.mp3\nBrian Laruso - Flowjob (Original Mix) (Cut From Anderson Set)-enTc.mp3\nBrooklyn Haley - Close To Where You Are (Joeysuki Vocal Club Mix) (Cut From Laruso Set)-enTc.mp3\nCapricorn - Harakiri (Silinder Remix) (Cut From Blighty Set)-enTc.mp3\nCarol Lee and Adrian &amp; Raz - I Belong To (Tom8 Remix) (Cut From Feel Set)-enTc.mp3\nChachi - My Way (Original Mix) (Cut From Anderson Set)-enTc.mp3\nChristopher Lawrence - Libra (Cut From CL Set)-enTc.mp3\nChristopher Vassilakis &amp; Simon Tarr - Galea (Original Mix) (Cut From Styller Set)-enTc.mp3\nChronosapien - Jupiter (Original Mix) (Cut From Romel Set)-enTc.mp3\nCiro Visone - Altered Beast (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nCooldozer feat Eli - Can You Feel (Original Mix) (Cut From Feel Set)-enTc.mp3\nCosmic Gate feat. Emma Hewitt - Not Enough Time (2013 Remix) (Cut From Ferry Set)-enTc.mp3\nCryostate - Believe (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nD-MAD - Taffy (Cut From Eteson Set)-enTc.mp3\nD05 - Saw To Square (Original Mix) (Cut From Anderson Set)-enTc.mp3\nDamian Wasse - My Heart (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nDanny Legatto Feat. Matt Bodkin - Lost For Words (Original Mix) (Cut From Abuzz Set)-enTc.mp3\nDave Winnel &amp; Archie - Satellites (Original Mix) (-Short- Cut From Laruso Set)-enTc.mp3\nDavid Mayne - Providers (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nDeadmau5 - Pets (Cut From Tucandeo Set)-enTc.mp3\nDJ Madwave - Synergy Anthem 2013 (Cut From KvA Set)-enTc.mp3\nDreamy - Scar (Astra &amp; Holland Remix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nEDX - Szeplo (Arston Remix) (Set Rip)-enTc.mp3\nEmre Yildiz - ID (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nEric Strong &amp; Malyar - U (Cut From Knowles Set)-enTc.mp3\nErick Strong &amp; Anatoly Kontsevich - Lady #1 (Dub Mix) (Cut From Anna Lee Set)-enTc.mp3\nEtasonic - Unrealised Dream (Cut From Lazarus Set)-enTc.mp3\nEtasonic - Unrealized Dream (tranzLift Remix) (Cut From Romel Set)-enTc.mp3\nEvave - Awakening (Original Mix) (Cut From Anderson Set)-enTc.mp3\nEvave - Night In White (Original Mix) (Cut From Anderson Set)-enTc.mp3\nEwan Rill - Fastic (Danny Cullen Remix) (Cut From Tucandeo Set)-enTc.mp3\nExarious - Gyrohopes Like (Cut From Abuzz Set)-enTc.mp3\nExtasy Project - Diamond (Original Mix) (Cut From Anna Lee Set)-enTc.mp3\nFatboy Slim &amp; Riva Star - Eat Sleep Rave Repeat (Calvin Harris Remix) (Cut From Marco V Set)-enTc.mp3\nFederation - New Religion (Indecent Noise Remix) (Cut From Ind Noise Set)-enTc.mp3\nFiras Tarhini - Tranquility (Original Mix) (Cut From Blighty Set)-enTc.mp3\nFire Flowerz - Vision (Cut From Arston Set)-enTc.mp3\nFon.Leman - Biomess (Original Mix) (Cut From Anderson Set)-enTc.mp3\nFrank Dattilo - 753 B.D. (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nHardwell &amp; MAKJ - Countdown (Cut From W&amp;W Set)-enTc.mp3\nHassan Jewel - Pretention (G8 Remix) (Cut From Distant Signs Set)-enTc.mp3\nHesham Watany - Crixalis (Original Mix) (Cut From Sty Set)-enTc.mp3\nHoyaa - La Passion (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nHypaethrame - Recollection (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nIan Buff - Reflected (Original Mix) (Cut From Allen&amp;Envy Set)-enTc.mp3\nIgor Dyachkov &amp; U-Jeen feat. Eskova - Aren't You Afraid To Lose (Mark Nails Remix) (Cut From Shah Set)-enTc.mp3\nIllitheas pres. Aren - Peeking Sun (Original Mix) (Cut From Shah Set)-enTc.mp3\nIndecent Noise - Warsaw (Lostly Remix) (Cut From Ind Noise Set)-enTc.mp3\nJase Thirlwall - Thunderflash (Allan Morrow Remix) (Cut From Ind Noise Set)-enTc.mp3\nJetfire - African Dreams (Cut From W&amp;W Set)-enTc.mp3\nJohn Newall - Now &amp; Then (Cut From Eteson Set)-enTc.mp3\nJohn Newman - Love Me Again (Montano &amp; Pizzitola Bootleg) (Cut From Schossow Set)-enTc.mp3\nJoshua Ollerton - Benihime (Original Mix) (Cut From Anderson Set)-enTc.mp3\nJQA featuring Senadee - Attention (Inphinity &amp; Kalendr Remix) (Cut From Pit Set)-enTc.mp3\nJustin Schumacher - Resist (Sutter Cane Remix) (Cut From J00F Set)-enTc.mp3\nKevin Wild feat. Kelly Sweet - Fire &amp; Ice (Club Mix) (Cut From Myon Set)-enTc.mp3\nKryder - Prmd (Cut From W&amp;W Set)-enTc.mp3\nLence &amp; Pluton - Save My Soul (Cut From Knowles Set)-enTc.mp3\nLiam Wilson - Restrictor (Thomas Datt Remix) (Cut From Above Clouds Set)-enTc.mp3\nMa5haria - Eudaimonia (Original Mix) (Cut From Feel Set)-enTc.mp3\nMa5haria - Eudaimonia (Willem De Roo Remix) (-Short- Cut From W&amp;W Set)-enTc.mp3\nMad Reavers - Go! (Original Mix) (Cut From Feel Set)-enTc.mp3\nMantrastic - Kongor (Cut From Schossow Set)-enTc.mp3\nMarco V - Sunset Boulevard (Cut From Marco V Set)-enTc.mp3\nMark Bester &amp; Adam Lorx - Typhoon (Original Mix) (Cut From Tasev Set)-enTc.mp3\nMark Nails feat. Molly Bancroft - Open Your Eyes (Dub Mix) (Cut From Knowles Set)-enTc.mp3\nMatt Bowdidge - My Reflection (Cut From Ind Noise Set)-enTc.mp3\nMatt Darey Pres. Tekara feat. Xan - Wanna Be An Angel (Omauha Bootleg) (Cut From Tucandeo Set)-enTc.mp3\nMatt Eray - Fire Exit (Original Mix) (Cut From A&amp;F Set)-enTc.mp3\nMatt Fax - Morevenin (Remode Mix) (Cut From Anderson Set)-enTc.mp3\nMaxima feat. DJ Rylath - Farthest (Andy Elliass Remix) (Cut From Sty Set)-enTc.mp3\nMaywave - Journey (Manuel Rocca Remix) (Cut From Palagano Set)-enTc.mp3\nMeital - Give Us Back Love (Sidney Samson Club Mix) (Cut From Oakenfold Set)-enTc.mp3\nMercer - Turn It Up (Cut From W&amp;W Set)-enTc.mp3\nMichele Cecchi - Starseed (Jupiter Mix) (Cut From A&amp;F Set)-enTc.mp3\nMimax - Insomnia (Azima Remix) (Cut From Romel Set)-enTc.mp3\nMixail - Taren (Original Mix) (Cut From Saint-Jules Set)-enTc.mp3\nMohamed Bahi - Leaving Forever (Emotional Mix) (Cut From GO Set)-enTc.mp3\nMoshic - False Emotion (Airwave Remix) (Cut From J00F Set)-enTc.mp3\nMPT Project - Uppercut (Cut From Pit Set)-enTc.mp3\nNaden - Cunae (Original Mix) (Cut From Tucandeo Set)-enTc.mp3\nNaden - Tokamak - Cunae (ABGT 048 Rip)-enTc.mp3\nNico Otten feat. Crystal Blakk - Sweetest Silence (Rene Ablaze &amp; Global Influence Remix) (Cut From Del Mar Set)-enTc.mp3\nNight Sky - Endorphine (Cut From Tero A Set)-enTc.mp3","torrent":{"xt":"urn:btih:74c9de9f14d05f0f84a33549192fae19432c1b72","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+9th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74c9de9f14d05f0f84a33549192fae19432c1b72","infoHashBuffer":{"type":"Buffer","data":[116,201,222,159,20,208,95,15,132,163,53,73,25,47,174,25,67,44,27,114]},"announce":[],"urlList":[]}}