{"title":"Core Temp 0.99.5.20 BETA (x64)","uid":4773224,"size":184108,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:751509f7a2d330d6dbe219fabbdd2e44a2426d1a&amp;dn=Core+Temp+0.99.5.20+BETA+%28x64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"olofolleola4","files":-1,"time":1237122069,"description":"Copied from Core Temp Homepage:\n\n\nCore Temp is a compact, no fuss, small footprint program to monitor CPU temperature.\nNow Windows Vista and Windows 7 ready! (x86 and x64)\n\nThe uniqueness of it is that it shows the temperature of each individual core in each processor in your system! You can see in real time how the CPU temperature varies when you load your CPU. It's also completely motherboard independent.\n \n\nIntel and AMD recently published detailed, public information about the &quot;DTS&quot; (Digital Thermal Sensor), which provides much higher accuracy and more relevant temperature reading than the standard thermal diode sensors do.\n\nThe temperature readings are very accurate as the data is collected from a Digital Thermal Sensor (or DTS) which is located in each individual processing core, near the hottest part. This sensor is digital, which means it doesn't rely on an external circuit located on the motherboard to report temperature, its value is stored in a special register in the processor so any software can access and read it. This eliminates any inaccuracy that can be caused by external motherboard circuits and sensors and then different types of programs trying to read those sensors.\n\n\nThis feature is supported on:\n\n\nAMD:\n\nAll Phenom / Phenom II series.\n\nAll Athlon64 series.\n\nAll Athlon64 X2 series.\n\nAll Athlon64 FX series.\n\nAll Turion64 series.\n\nAll Turion64 X2 series.\n\nAll Sempron series. (K8 based)\n\nSingle Core Opterons starting with SH-C0 revision and up. (K8 based)\n\nAll Dual Core Opteron series. (K8 based)\n\nAll Quad Core Opteron series. (K10 based)\n\n\nIntel:\n\nCore i7 series.\n\nInitial Core i5 support.\n\nAtom.\n\nAll Core Solo series.\n\nAll Core Duo series.\n\nAll Core 2 Duo series.\n\nAll Core 2 Quad series.\n\nAll Core 2 Extreme series.\n\nAll Celeron-M 400 and 500 series.\n\nAll Celeron E1000 series.\n\nAll Pentium E2000, E2100, E2200 and E5000 series.\n\nAll Dual Core Low Voltage Xeons series (Yonah based. Untested).\n\nAll Xeon 3000, 3200, 3300, 5100, 5300, 5400, 5500 series.\n\n\nNote: AMD Phenom is supported, but it does not report absolute temperature.\n\nCore Temp also has a logging feature, allowing a user to easily record the temperature of his processor(s) over any period of time, then the data can be easily transferred into an excel datasheet for easy graphing.\n\nCore Temp works on Windows 2000, XP, 2003, Vista and 7\n(both 32bit and 64bit versions).\nThanks to CoolIT Systems for providing a digitally signed Core Temp driver which now works on all Vista versions.","torrent":{"xt":"urn:btih:751509f7a2d330d6dbe219fabbdd2e44a2426d1a","amp;dn":"Core+Temp+0.99.5.20+BETA+%28x64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"751509f7a2d330d6dbe219fabbdd2e44a2426d1a","infoHashBuffer":{"type":"Buffer","data":[117,21,9,247,162,211,48,214,219,226,25,250,187,221,46,68,162,66,109,26]},"announce":[],"urlList":[]}}