{"title":"Lee Smith - The Strong Horse (mobi, epub)","uid":6941545,"size":684193,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:759e126d5d413b1f01bb94912249becb2386c967&amp;dn=Lee+Smith+-+The+Strong+Horse+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1326057191,"description":"The Strong Horse: Power, Politics, and the Clash of Arab Civilizations\n\nSoon after the World Trade Center towers fell, leaving ashes floating over journalist Lee Smith's Brooklyn neighborhood, he left for Cairo to find out &quot;why the Arabs hate us.&quot; He spent eight years reporting from Cairo, Beirut, and Jerusalem and discovered that the anger and disorder in the Middle East are not caused by a clash of civilizations between East and West, as is so often contended. Instead, he found a clash among Arab civilizations that led him to reassess America's efforts to bring a &quot;freedom agenda&quot; to the Arab world. In The Strong Horse, Lee Smith offers paradigm-shifting insight into how the Arab world works and what America's role should be in that world today.\n\nThe Strong Horse combines evocative reporting with brilliant analysis that gracefully overturns many of the myths held about the region. Perhaps the most important myth that hobbles policy in the Middle East is the idea that the turmoil there is the legacy of Western interference. In fact, Smith shows, violence has been the only currency of power in the region for centuries. Another myth is that dictators are the main cause of widespread oppression in countries like Egypt, Saudi Arabia, and Syria. Yet Smith finds that much of the repression that stagnates Arab society happens at the level of the family where rigorous redlines of social and religious behavior are enforced. What's more, in a region seething with minorities, with no liberal tradition, no reverence for individual rights, and no tolerance for difference, authoritarian regimes exist because the alternative, as has been seen most recently in Lebanon and Iraq, is endless sectarian violence.\n\nIn The Strong Horse, Smith reveals the Arab world to be defined by a tribal culture where support goes to &quot;the strong horse.&quot; Technology and democracy will not transform the Arab world, Smith convincingly demonstrates. Rather, Arab peoples and governments naturally align themselves with the strongest power, even when that power is the United States or Israel. Smith's groundbreaking book redefines America's role in the Middle East as &quot;benevolent strong horse&quot; and offers an important corrective to our understanding of the Arab world.\n\nAuthor: Lee Smith\nPublisher: Anchor\nPublication Date: January 12, 2010\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:759e126d5d413b1f01bb94912249becb2386c967","amp;dn":"Lee+Smith+-+The+Strong+Horse+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"759e126d5d413b1f01bb94912249becb2386c967","infoHashBuffer":{"type":"Buffer","data":[117,158,18,109,93,65,59,31,1,187,148,145,34,73,190,203,35,134,201,103]},"announce":[],"urlList":[]}}