{"title":"Columbia Journalism Review - January - February 2014","uid":9703528,"size":8560585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76bd22f47071a7ed6d00e903798d51bbae8d9d0d&amp;dn=Columbia+Journalism+Review+-+January+-+February+2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1394037782,"description":"Columbia Journalism Review - January - February 2014\n English | 68 pages | True PDF | 8.00 Mb\n\n\nThe Columbia Journalism Review (CJR) is an American magazine for professional journalists published bimonthly by the Columbia University Graduate School of Journalism since 1961.\n\nIts contents include news and media industry trends, analysis, professional ethics and stories behind news.\n\nThe chairman of the magazine is Victor Navasky, a professor at the Columbia University Graduate School of Journalism and former editor and publisher of the politically progressive The Nation. According to Executive Editor Michael Hoyt, Navasky's role is &quot;99% financial&quot; and &quot;he doesn't push anything editorially,&quot; adding that Navasky has &quot;learned how to get a small magazine of ideas into the black, and he's trying to come up with some strategies for us.&quot;[2]\n\nIn August 2007, Mike Hoyt, the CJR's executive editor since 2003, said the CJR's income in 2007 would exceed expenses by about $50,000, with estimates of a $40,000 surplus in 2008. Hoyt attributed the surpluses to a mix of some staff cuts, such as not replacing three editors who left, and fundraising increases. Donations to the CJR in the past three years have included about $1.25 million from a group of news veterans headed by former Philadelphia Inquirer executive editor Eugene Roberts.[3]\n\nAs of mid-2007, the CJR had an eight-person staff, an annual budget of $2.3 million, and circulation of about 19,000, including 6,000 student subscriptions\n\n\nLOL...reflections from the past(personal)","torrent":{"xt":"urn:btih:76bd22f47071a7ed6d00e903798d51bbae8d9d0d","amp;dn":"Columbia+Journalism+Review+-+January+-+February+2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76bd22f47071a7ed6d00e903798d51bbae8d9d0d","infoHashBuffer":{"type":"Buffer","data":[118,189,34,244,112,113,167,237,109,0,233,3,121,141,81,187,174,141,157,13]},"announce":[],"urlList":[]}}