{"title":"Science Foundations- Artificial Intelligence [PDF] [StormRG]","uid":10201704,"size":171220088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:772707bb5a1cd9a5d62ecd5f334f5aa83f25626d&amp;dn=Science+Foundations-+Artificial+Intelligence+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"0xmovva","files":3,"time":1400781075,"description":"Author:P. Andrew Karam \nSeries: Science Foundations\nLibrary Binding: 109 pages\nPublisher: Chelsea House Publications (March 1, 2012)\nLanguage: English\nISBN-10: 1617530271\nISBN-13: 978-1617530272\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple \nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nAndrew Karam is a scientist, author, and an expert in radiation safety, nuclear energy, and radiological security. Born in Akron Ohio, he attended Ohio State University for two years, earning only mediocre grades. Realizing that he needed more direction and self-discipline, he left school to join the Navy, enlisting in the Nuclear Power Program. In the next 2 years, Karam learned to be a nuclear-grade mechanic, mastering the theory behind nuclear propulsion as well as learning how to operate these complex machines. Finishing in the top few percent of his class, he was asked to stay on as an instructor, teaching for another two years and developing a love of teaching that has never left him. This was followed by additional training and then a tour on the aging fast attack sub, the USS Plunger - his book Rig Ship for Ultra Quiet takes you into the Plunger on her last &quot;special operation&quot; at the tail end of the Cold War.","torrent":{"xt":"urn:btih:772707bb5a1cd9a5d62ecd5f334f5aa83f25626d","amp;dn":"Science+Foundations-+Artificial+Intelligence+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"772707bb5a1cd9a5d62ecd5f334f5aa83f25626d","infoHashBuffer":{"type":"Buffer","data":[119,39,7,187,90,28,217,165,214,46,205,95,51,79,90,168,63,37,98,109]},"announce":[],"urlList":[]}}