{"title":"Oasis Dig Out Your Soul 2008(split tracks + covers)","uid":4783466,"size":66979975,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:77e563a32a62ca5af2a4f06f0978d2cda9f335e1&amp;dn=Oasis+Dig+Out+Your+Soul+2008%28split+tracks+%2B+covers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michelinman","files":15,"time":1237422850,"description":"\n\n# Swaggering, pounding and often embracing, Dig Out Your Soul is the seventh studio album from Oasis. The early success of groundbreaking albums Definitely Maybe and (What's The Story) Morning Glory found the Manchester quartet enjoying major success on both sides of the Atlantic, gaining legendary status which has remained undiminished since their mid-90s chart dominance. Dig Out Your Soul continues the fine work displayed in 2005's spectacular Don't Believe The Truth, with a welcome return to the brash, full-frontal vibe of their early work.\n# The musical equivalent of a thunderstorm, opening number `Bag It Up' is a clear sign of intent - a direct, stomping rock-out master-class. Coming from a band famed for creating rousing, festival favourites, `The Turning' is a majestic anthem complete with a 50-piece choir singing the joyous chorus of 'So come on,' whilst equally the electric `I'm Out Of Time' is likely to become a long-term live favourite. Unlike previous releases, there are worthy song writing contributions from lesser-known members of the band, with bassist Andy Bell contributing `The Nature Of Reality', a crunchy, blues- influenced number which although differs enormously from the fast pace of a majority of the album still retains the 1960s influences which have become a staple of Oasis' sound. Guitarist Gem Archer is behind the psychedelic, latter day Beatles-esque `To Be Where There's Life' but once again it's Noel Gallagher who steals the show with the emphatic single `Falling Down' - a gloriously produced slice of the confident indie-rock he has always been capable of.\n# Although rougher around the edges, Oasis have once again produced an album of honest rock `n' roll, continually exciting the listener with exquisite riff-based song writing and the larger-than-life confidence we've come to expect from one of the finest bands of our generation. As a result, Dig Out Your Soul is arguably their finest work since their debut.\n\nTrack List\t\n\n \n\n   1. Bag It Up\n   2. The Turning\n   3. Waiting For The Rapture\n   4. The Shock Of The Lightning\n   5. I'm Outta Time\n   6. (Get Off Your) High Horse Lady\n   7. Falling Down\n   8. To Be Where There's Life\n   9. Ain't Got Nothin'\n  10. The Nature Of Reality\n  11. Soldier On\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/watching3vemq8.gif[/IMG]\n\n[IMG]http://i78.photobucket.com/albums/j81/wrcfoucs/dontseed.gif[/IMG]\n\n[img]http://i447.photobucket.com/albums/qq195/mariokazg/20qdrhe.gif[/img]\n\n[img]http://i121.photobucket.com/albums/o219/uuffoo/vghlr7.png[/img]","torrent":{"xt":"urn:btih:77e563a32a62ca5af2a4f06f0978d2cda9f335e1","amp;dn":"Oasis+Dig+Out+Your+Soul+2008%28split+tracks+%2B+covers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77e563a32a62ca5af2a4f06f0978d2cda9f335e1","infoHashBuffer":{"type":"Buffer","data":[119,229,99,163,42,98,202,90,242,164,240,111,9,120,210,205,169,243,53,225]},"announce":[],"urlList":[]}}