{"title":"Antispam Marisuite for The Bat! 1.5.0","uid":4815466,"size":4445466,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:77f91fe2c2cb26b95582fa090aba42702925a708&amp;dn=Antispam+Marisuite+for+The+Bat%21+1.5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mashavorob","files":-1,"time":1238526296,"description":" Antispam Marisuite for The Bat is an intelligent, fast and efficient spam filter based on modern antispam techniques. Marisuite contains initial knowledge base and will filter spam effective right after installation. The following is an overview of features Antispam Marisuite:\n\n    * Spam filter does not require any configuration The Bat!\n      Setup program takes care of configuring The Bat and you do not need do anything else. Antispam filter begins work immediately after installation.\n    * Antispam will treat as spam anything you consider spam, even if it does not conform to the traditional definitions of spam.\n      Antispam Marisuite is based on trainable adaptive algorithm. It is very flexible and accurate. Unlike other spam filters Antispam Marisuite takes into consideration much more statistical parameters of messages such as idiomatical constructions, message's route and sender's IP address, presence of phishing links, parameters of attached pictures and so on. Classification quality improves with each received message.\n    * Using of social network theory allows significantly reducing probability of false positives.\n      Anti-spam filter automatically maintains list of friendly addresses, so-called white list. Marisuite keeps there addresses that never are spam sources.\n    * Spam filter keeps log\n      Log is useful for training spam filter and finding falsely classified messages. Also log allows restoring mistakenly deleted messages.\n","torrent":{"xt":"urn:btih:77f91fe2c2cb26b95582fa090aba42702925a708","amp;dn":"Antispam+Marisuite+for+The+Bat%21+1.5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77f91fe2c2cb26b95582fa090aba42702925a708","infoHashBuffer":{"type":"Buffer","data":[119,249,31,226,194,203,38,185,85,130,250,9,10,186,66,112,41,37,167,8]},"announce":[],"urlList":[]}}