{"title":"The Great Locomotive Chase (1956) DVD5 - Western [DDR]","uid":9288044,"size":4006027264,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7821ef675a4ff67bd8106b0a796b41ff8ad439f2&amp;dn=The+Great+Locomotive+Chase+%281956%29+DVD5+-+Western+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"SaM","files":-1,"time":1386046035,"description":"The Great Locomotive Chase (1956) DVD5 - Western [DDR]\n\nThe Great Locomotive Chase is a 1956 Walt Disney Productions CinemaScope adventure film based on the real Great Locomotive Chase that occurred in 1862 during the American Civil War. The film stars Fess Parker as James J. Andrews, the leader of a group of Union soldiers from various Ohio regiments who volunteered to go behind Confederate lines in civilian clothes, steal a Confederate train north of Atlanta, and drive it back to Union lines in Tennessee, tearing up railroad tracks and destroying bridges and telegraph lines along the way.\n\nCAST:-\nFess Parker as James J. Andrews, Union spy and leader of the volunteers\nJeffrey Hunter as William A. Fuller, conductor of the Confederate train\nJohn Lupton as Cpl. William Pittenger, Union soldier\nKenneth Tobey as Anthony Murphy, Confederate engineer\nDon Megowan as Marion A. Ross, Union soldier\nClaude Jarman, Jr. as Jacob Parrott, Union soldier, first Medal of Honor recipient\nHarry Carey, Jr. as William Bensinger, Union soldier\nChuck Roberson as Confederate Prison Captain (uncredited)\nDick Sargent as Unnamed Union soldier (uncredited)\n\nDirected by Francis D. Lyon\nProduced by Lawrence Edward Watkin\nWritten by Lawrence Edward Watkin\n\nMOVIE REVIEW:- The Great Locomotive Chase (1956)\nIt is no secret that Walt Disney loved trains and after having huge success with Davy Crockett and the star it created, Fess Parker, Walt decided to combine his love of trains and America's obsession with Westerns to make a period film based on the 1862 Civil War military raid of the Southern railroad. The Great Locomotive Chase was the third Disney film shot in the new CinemaScope widescreen process. Many exterior shots were done in Georgia, where the film takes place, but interiors were done at the Walt Disney Studios in Burbank, CA. Walt was busy with his theme park, Disneyland, during filming, so he didn't have a very active role in it. But director Francis Lyon said that he was active in the story process and visited the set in Georgia for a weekend.\n\nThe film is narrated by William Pittinger in flashback form. James Andrews is a member of the secret service who is planning on leaving and joining the war when he is given a mission to lead a group of men as spies to destroy the Southern railroad system. They encounter many exciting and perilous obstacles in their quest, eventually leading to a chase by the train's conductor, William Fuller. Fuller succeeds in stopping the mission as a hunt goes on to find the men who stole the train. Many are rounded up, including Pittinger and Andrews. A prison escape it foiled and only some of the men get away, but Andrews valiantly tries to fight the guards off. It is learned through flashback that he and the others were executed. The film ends with the surviving men receiving medals of honor.\n\nThe Great Locomotive Chase premiered on June 8th, 1956. Critics loved it because it was exactly the kind of big budget live action movie they expected from Disney. Audiences loved it too and it was a big success during its theatrical release. Surprisingly, it was never given a theatrical re-release and over time, it has become forgotten by most.\n\nAs a film, it is mostly enjoyable. While the acting isn't as great as it could have been, the cinematography provides a visually pleasing experience thanks to the natural environments and Peter Ellenshaw's masterful matte paintings. The film is full of lots of brisk action sequences that will keep you entertained. Its only real downfall is that after the chase is over, none of the action is able to top it. As an audience, we are spoiled by big action sequences coming towards the end of films, but here they happen a good 15 minutes before the end, causing the ending to feel a bit weak. In addition, the fact that they didn't succeed and the film's main character dies makes it feel a little bit pointless, but overall its a good movie.\n\nSYNOPSIS:- The Great Locomotive Chase (1956)\nThis is based on a true story. During the Civil War, a Union spy, Andrews, is asked to lead a band of Union soldiers into the South so that they could destroy the railway system. \nHowever, things don't go as planned when the conductor of the train that they stole is on to them and is doing everything he can to stop them.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate:6507 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English\nRunTime: 1:27:40\nSubtitles:None\nRipped by: Trinidad [DDR]\nDuration: 1:27:40","torrent":{"xt":"urn:btih:7821ef675a4ff67bd8106b0a796b41ff8ad439f2","amp;dn":"The+Great+Locomotive+Chase+%281956%29+DVD5+-+Western+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7821ef675a4ff67bd8106b0a796b41ff8ad439f2","infoHashBuffer":{"type":"Buffer","data":[120,33,239,103,90,79,246,123,216,16,107,10,121,107,65,255,138,212,57,242]},"announce":[],"urlList":[]}}