{"title":"Aerosmith - Amazing  (2nafish)","uid":5422441,"size":237434884,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7949c8e473e993aac9ce63abb994b3a47020c551&amp;dn=Aerosmith+-+Amazing++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1268132198,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Amazing&quot; is a song performed by American hard rock band Aerosmith. It was written by lead singer Steven Tyler and longtime band friend and collaborator Richie Supa. It peaked at #24 on the Billboard Hot 100 on New Year's Day, 1994. It peaked at #3 on the Mainstream Rock Tracks chart and #57 in the UK.\n\nThe video for the song, directed by Marty Callner, is well-known for its depiction of digital technology and featured the second appearance of Alicia Silverstone in the band's videos. Paired with her was Jason London, star of Dazed and Confused, a film which was released in the same year as Get a Grip and which memorably made numerous references to Aerosmith. The characters are featured in the music video as two cyberspace kids who escape to a world of virtual reality together, both not realizing the other is also doing virtual reality.\n\nIn the virtual dream world, the two embark on a motorcycle journey and sky-dive, as well as engage in a steamy makeout session.\n\nOne part of the video features the characters boarding and taking flight in a biplane, which combined with the digital technology creates what is often regarded as a fascinating dichotomy between antiquated and modern technology, in some ways presenting a parallel for the characters.\n\nMeanwhile, members of the band perform in various parts throughout the song, including in a tunnel, as well as solo shots of Steven Tyler in a room by himself and Joe Perry playing a guitar solo with a cityscape in the background. Joe Perry also suffered a slight head injury during the making of the video.\n\nAt the end of the video, it is discovered that it was Silverstone who was engaging in the virtual fantasy. Many critics now hail the video as a powerful warning about the potential dangers of cyberspace.\n\nThe video version of the song was extended by 52 seconds at the end, where two loops were inserted.\n\nThe song features a constant piano playing throughout the song, driving guitar riffs, and a guitar solo, featuring leads by both Joe Perry and Brad Whitford and an emotional delivery of lyrics by Steven Tyler including his characteristic scream towards the end of the song. There is also a special guest appearance by Don Henley who sings background vocals.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:7949c8e473e993aac9ce63abb994b3a47020c551","amp;dn":"Aerosmith+-+Amazing++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7949c8e473e993aac9ce63abb994b3a47020c551","infoHashBuffer":{"type":"Buffer","data":[121,73,200,228,115,233,147,170,201,206,99,171,185,148,179,164,112,32,197,81]},"announce":[],"urlList":[]}}