{"title":"FSX - Aerosoft African Airstrip Adventures","uid":4967779,"size":325959176,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:794d3a920d70a6a379c5f45f664c5280ce1e88db&amp;dn=FSX+-+Aerosoft+African+Airstrip+Adventures&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tam408","files":-1,"time":1245619453,"description":"----------------------------------------------------------------------------------\n\nAfrican Airstrip Adventures (AAA) is a cross over product that merges an advanced mission mode with high definition scenery. This addon will bring you closer to the fascination, the wildlife and the beauty of Kenya/Africa. The African Airstrip Adventures take FSX to the adventure level.\n\nWith this addon you can finally experience all the wildlife you expect to find in Africa. Although this is a Flight Simulator X addon, it is not meant to reproduce Kenya as it is. Lots of names and places are fictional, even if based on real places and objects. We wanted to fill the gap between the simulation and the gaming aspect of FSX. So while the flying is highly realistic your environment is created to suit the mission career mode and not in the first place to be realistic. It will never be unrealistic however!\n\nWhen Microsoft announced that FSX would include a realistic living world, we were all eager to go for safaris in Africa or follow birds on their way across the planet. Soon enough we found that - apart from eagles soaring in thermals - there are no animals to be found outside certain missions. With the African Airstrip Adventures we correct this absence. This addon covers an area of approximately 40,000 square kilometers around Mt Kenya, the country's highest peak. More than 20 airstrips, custom scenery and landclass, landmarks, lodges, vehicles and of course thousands of birds and mammals are bringing FSX to life - more than everything you've experienced before.\n\nBut that is not enough. For the very first time in FSX, you can now start a career as a pilot in a fictional charter airline, the small 'African Safari Charter'. Take on several different jobs, organize your schedule, choose the best aircraft for your assignment, maintain your aircraft, transport passengers and cargo, go on safaris - and of course master the challenging airstrips, which will afford all of your flying skills. The career mode is not simply a mission, it's an unlimited adventure, with job offers popping up randomly. You can combine jobs, having to keep track of the aircraft's load limitations and your time schedule. If you manage all of that you can climb the reputation ladder, collect rewards and have hours and hours of fun as an 'African Safari Charter' pilot. \n\nFeatures:\n\n    * 40,000 square kilometers coverage surrounding Mount Kenya\n    * More than 20 airstrips, many other landmarks like bush lodges\n    * Thousands of animals (several animated)\n    * Innovative Mission Career mode\n    * Automatic dispatcher (you are an African Safari Charter pilot!) that assigns flights\n    * Earn money and awards and increase your reputation standard!\n    * If you own the Aerosoft Twin Otter or Bush Hawk XP there will be new liveries installed!\n\nPlease note that this is a product that is hard on framerates because of the thousands of individually placed objects. Due to the way FSX handles these objects there is just no way to optimize the scenery more than has been done. Running this scenery on the highest scenery levels could only impossible on the fastest systems. The scenery however makes full use of the density settings so when your system is not top notch you can scale down complexity and still see amazing scenery. The System requirements should be taken very serious. \n\n----------------------------------------------------------------------------------\n\nContents:\n\n - Installer\n\n - crack\n\n - Instructions\n\n----------------------------------------------------------------------------------\n\nFULLY SEEDED !\n\n----------------------------------------------------------------------------------\nBY TAM408\n----------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:794d3a920d70a6a379c5f45f664c5280ce1e88db","amp;dn":"FSX+-+Aerosoft+African+Airstrip+Adventures","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"794d3a920d70a6a379c5f45f664c5280ce1e88db","infoHashBuffer":{"type":"Buffer","data":[121,77,58,146,13,112,166,163,121,197,244,95,102,76,82,128,206,30,136,219]},"announce":[],"urlList":[]}}