{"title":"La Noche Es Nuestra [DVDRip] [Spanish] [DAT]","uid":4505443,"size":1467602974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7996e313f74d3ead61f0b89f2b30596a2c5197d0&amp;dn=La+Noche+Es+Nuestra+%5BDVDRip%5D+%5BSpanish%5D+%5BDAT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":4,"time":1226535476,"description":"Nueva York, 1988. Un nuevo tipo de droga ha invadido la enorme ciudad, seguida por la mÃƒÂ¡s feroz y aterradora oleada criminal que se recuerda. Superada en nÃƒÂºmero de efectivos y en armas por los nuevos gÃƒÂ¡nsteres, la policÃƒÂ­a pierde de promedio a dos de los suyos cada mes. Es una guerra declarada que amenaza con llevarse por delante a culpables e inocentes.\nBobby Green se ve atrapado en el fuego cruzado. Es el encargado de una discoteca situada en Brighton Beach frecuentada por gÃƒÂ¡nsteres como Vadim Nezhinski. Bobby intenta mantenerse apartado y no involucrarse. A pesar de un estilo de vida amoral y hedonista, quiere a su novia Amanda y sueÃƒÂ±a con abrir una discoteca en Brooklyn.\nPero Bobby tiene un secreto muy bien guardado. Su hermano es el teniente de policÃƒÂ­a Joseph Grusinsky, que ha seguido los pasos de su padre, el legendario jefe de policÃƒÂ­a Burt Grusinsky. Bobby no se lleva bien con ellos y la relaciÃƒÂ³n empeora cuando su padre le advierte que es la guerra y que deberÃƒÂ¡ decidir de quÃƒÂ© lado estÃƒÂ¡.\nNo puede permanecer neutral cuando hieren gravemente a su hermano y descubre que su padre podrÃƒÂ­a ser el siguiente. Comprende que solo estarÃƒÂ¡n seguros cuando la organizaciÃƒÂ³n de Nezhinski sea destruida y se une a su hermano para un asalto en toda regla. Juntos intentarÃƒÂ¡n hacer suyo el lema que la policÃƒÂ­a de Nueva York tuvo en los ochenta: &quot;La noche es nuestra&quot;.","torrent":{"xt":"urn:btih:7996e313f74d3ead61f0b89f2b30596a2c5197d0","amp;dn":"La+Noche+Es+Nuestra+%5BDVDRip%5D+%5BSpanish%5D+%5BDAT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7996e313f74d3ead61f0b89f2b30596a2c5197d0","infoHashBuffer":{"type":"Buffer","data":[121,150,227,19,247,77,62,173,97,240,184,159,43,48,89,106,44,81,151,208]},"announce":[],"urlList":[]}}