{"title":"Rugby's Greatest Hits - South African Edition - South Africa","uid":5390957,"size":867822858,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7ba6617793541ec7a808b08e56cb5c208e3f8efb&amp;dn=Rugby%5C%27s+Greatest+Hits+-+South+African+Edition+-+South+Africa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shemyaza","files":-1,"time":1267058743,"description":"Rugby's Greatest Hits - South African Edition\n\n&quot;Rugby is a good occasion for keeping 30 bullies far away from the city centre.&quot; - Oscar Wilde.\n\n&quot;RUGBY'S GREATEST HITS - The South African Edition&quot;, is presented by James 'Bullet' Dalton, the most capped Springbok hooker to grace the game. Rugby has always been a contact sport, but in this classical collectors item, James takes you through the Best of the Best from the last thirty years of South African rugby. From knockout punches to massive brawls, from the individual moments of horror to all out war - they're all included in this compilation of rugby mayhem. From individual incidents such as Kobus Wiese dropping Welsh lock, Derwyn Jones, to the full-scale 30-man brawl of the likes of the infamous 'Battle of Tucuman', James and our rugbyguests Craig Jamieson, Christian Stewart and Keith Andres will talk you through them all.\n\n&quot;We are definitely not bringing the game into disrepute, nor are we gloryfying violence in rugby. We are merely showing you historical footage from actual incidents where things have boiled over in the game we love to love. Please don't take it too seriously, it is just to have a bit of fun!&quot; - James Dalton.\n\nFor those who think today's rugby game is over sanitised, this is the definitive DVD you have all been waiting for!!","torrent":{"xt":"urn:btih:7ba6617793541ec7a808b08e56cb5c208e3f8efb","amp;dn":"Rugby%5C%27s+Greatest+Hits+-+South+African+Edition+-+South+Africa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ba6617793541ec7a808b08e56cb5c208e3f8efb","infoHashBuffer":{"type":"Buffer","data":[123,166,97,119,147,84,30,199,168,8,176,142,86,203,92,32,142,63,142,251]},"announce":[],"urlList":[]}}