{"title":"Herbie Mann - Caminho De Casa (1990) [Jazz][mp3 320][h33t][schon","uid":4853869,"size":129103181,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c8f36619a0ab2e5bab505841021a04157894198&amp;dn=Herbie+Mann+-+Caminho+De+Casa+%281990%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":14,"time":1239981191,"description":"Herbie Mann - Caminho De Casa\nOriginal Release Date: July 11, 1990 \nAudio CD: August 13, 1990 \nLabel: Chesky Records\nBitrate: 320 kbps\n\nI like jazz samba, but if you're as tired as I am of lame drummers doing the standard toc, toc, toc-toc, toc, toc, toc-toc on a wood block, so you'll know for sure that is JAZZ SAMBA MUSIC, you should give a listen to Herbie Mann's &quot;Caminho De Casa.&quot;\nHaving spent all of two days in Brazil, about thirty years ago, I'm not qualified to say whether this 'real' samba, or 'authentic' samba music...which isn't all that important in any case.  What matters is that is sounds wonderful.\n\nWhat I love about this CD, is the fact that the 'musical' instruments - especially Eduardo Simon and Mark Soskin, splitting piano duty, and Romero Lubambo on guitar - carry the samba rhythm, and the drum and percussion players are given more subtle and more interesting things to do.  In fact, Ricky Sebastian is so subtle that I had to check the liner notes to be sure there was actually someone credited as sitting at a drum kit.  I mean this in a most complimentary way.\n\nAnother thing I love about this CD is the infectious cheerfulness of the music.  Play this music, and your step gets a bit lighter, an overcast day seems a bit brighter, and you find yourself smiling more.  The title tune sets this mood, six and a half minutes of wonderful soloing and ensemble work on a melody by Nelson Ayres that you'll find playing in your head whenever there's a quiet moment.  And if you can stay in your chair all the way through &quot;Pao E Poesia,&quot; it's time to get your doctor to schedule a thorough physical.\n\nAnother satisfaction, for me personally, is this is part of my rediscovery of Herbie Mann.  I lost track of him back in his Caribbean [ Why won't they reissue &quot;St. Thomas&quot;?!? ] and &quot;Muscle Shoals Nitty Gritty&quot; period.  As part of a divorce settlement, the Herbie Mann records went with my departing spouse.  In the intervening 15 years, I never got around to buying my own copies. \n\nWell, recently I decided to look for some.  And while &quot;The Evolution of Mann&quot; is a great retrospective, and &quot;Peace Pieces&quot; is an interesting and lovely CD, the disk I keep coming back to is &quot;Caminho De Casa.&quot;  In fact, it's been occupying the same spot on my carousel since it arrived [ three weeks ago ], and I just change the other four disks around it.\n\nMann has been accused of being a less than inspired improviser, and - worse yet - has chosen the flute as his instrument.  Hard to get respect in the jazz world if you play a flute.  Well, ok, this is not Josh Redman at the walls of Jericho...why should it be.  If that's what you want, go there.  I do too, when the mood suits. \n\nThis is a Mann with about forty years of music making behind him.  He knows what he can do, and I sense that it pretty much coincides what he wants to do.  He makes the most of what he's got, and he's got more than enough.  The other soloists all hold their own, when the spotlight is on them, and the ensemble work is impeccable.  I don't know how long this specific group have been playing together, but it's long enough to give them a cohesive and coherent sound.\n\nA final note about the label, Cheskey Records.  Producer David Cheskey is using what he calls minimalist miking techniques, and no overdubbing or artificial enhancement.  The result is clean crisp sound, in which all the elements remain in proper balance and every voice is heard.  It's a more 'polished' sound than a live album, but the feeling that comes across - whether it was done that way or not - is that these guys were all sitting together in the same room when they made this music, not tucked away in individual cubby holes.  ~ Amazon.Com - A Customer\n \nHerbie Mann - Caminho De Casa Tracks:\n01  Caminho De Casa (Pathway Home) (6:35)\n02  Gabriela's Song (3:34)\n03  Aparecida (A Proper Name) (7:48 )\n04  Your Body (Seu Corpo) (4:57)\n05  Pao E Poesia (Bread And Poetry) (4:22)\n06  Yesterday's Kisses (5:42)\n07  Anima (Soul) (8:48 )\n08  Choro Das Aguas (Cry Of The Waters) (5:58 )\n09  Doa A Queen Doer (No Matter Who It Hurts) (5:57)\n\n","torrent":{"xt":"urn:btih:7c8f36619a0ab2e5bab505841021a04157894198","amp;dn":"Herbie+Mann+-+Caminho+De+Casa+%281990%29+%5BJazz%5D%5Bmp3+320%5D%5Bh33t%5D%5Bschon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8f36619a0ab2e5bab505841021a04157894198","infoHashBuffer":{"type":"Buffer","data":[124,143,54,97,154,10,178,229,186,181,5,132,16,33,160,65,87,137,65,152]},"announce":[],"urlList":[]}}