{"title":"Abrosoft FaceMixer 3.0.1","uid":6978151,"size":8775585,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7dd7ef49c7497e5fab0c1af1a4a680f4850b148f&amp;dn=Abrosoft+FaceMixer+3.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manhide","files":5,"time":1327313111,"description":"Abrosoft FaceMixer is designed to create fantastic face composites with multiple images. With our intelligent face detection and facial feature extraction technique, you can easily mix up multiple faces into a magic &quot;average face&quot; or generate thousands of synthetic copyright free photo-realistic face by age, gender and ethnicity.\n\nFaceMixer takes advantage of hardware acceleration, the high speed of the rendering engine makes it possible to compute multiple faces at one time and see the final composite in real time. If you have a webcam or any video device, you can quickly capture some headshots as source images. You can store edited faces in a classified Face Library and then simply pick up some faces from there for a new composite. The skinnable user interface is cool in looks, streamlined in function, and a joy to work with.\n\nWith Abrosoft FaceMixer, creating a fantastic face composite with multiple images has never been easier and faster! With this intelligent, powerful and novel tool, you can mix up multiple individual faces into a magic &quot;average face&quot; or generate thousands of synthetic copyright free photo-realistic faces by age, gender and ethnicity. Using our intelligent face detection and facial feature extraction technique, FaceMixer can detect one or even multiple face portions from an image, and extract facial features (eyes, nose, mouth, etc.) from a face and place key dots on appropriate positions, all automatically! Easy-to-use editing tools are also provided, with which you can accurately adjust the dots and freely control the mixing process.\n\nCreating a fantastic face composite from multiple images has never been easier and faster! Abrosoft FaceMixer is based on a simple concept: a powerful and professional composing software, yes, but simple enough to be used by even non professionals. When tools allow for expression of creativity based on ideas and inspiration and not on technical expertise, everyone benefits.\n\nPowerful features:\nGreat looking interface with skin\nAlmost all features are accessible in main interface\nThe program works as a wizard\nNavigation pane and buttons\nUnlimited Undo/Redo\nSupports full Drag &amp; Drop\nSupports mouse wheel scrolling\nVisual open project\nMore, More, More...\nThe fastest rendering engine, real-time mixing, real-time preview\nAutomatically detect face portions\nAutomatically extract facial features and place key dots on appropriate positions\nGenerate average or random composites, or manually set feature/shape percentage for each face\nSupports all common image formats: BMP, JPEG, TIFF, PNG, TGA, PCX, GIF, WMF, EMF, AVI\nImports/Exports 32-bit image with alpha formats: BMP, TIFF, PNG, TGA\nBuilt-in editing tool, which can rotate source images and adjust brightness, contrast, color balance\nCreates amazing effects with Background, Mask, Foreground and Light\nStore faces to Face Library and you can easily reuse them in new projects\n\nSystem Requirements:\nPentium 3/4 or AMD Athlon - 500 Mhz or more\nTrue Color Video Card with OpenGL acceleration - 1024x768, 32-bit\n512 MB RAM\nWindows XP or later\n\nProgram is full version 100% working and tested.\nVirus Scanned\nInstallation Instructions Included.","torrent":{"xt":"urn:btih:7dd7ef49c7497e5fab0c1af1a4a680f4850b148f","amp;dn":"Abrosoft+FaceMixer+3.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd7ef49c7497e5fab0c1af1a4a680f4850b148f","infoHashBuffer":{"type":"Buffer","data":[125,215,239,73,199,73,126,95,171,12,26,241,164,166,128,244,133,11,20,143]},"announce":[],"urlList":[]}}