{"title":"Gary Numan &amp; Tubeway Army - Are Friends Electric [Szene, 197","uid":7614827,"size":230647808,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:7e6ba1d5f61ff686e9ad9337d76764ba6e7f0a72&amp;dn=Gary+Numan+%26amp%3B+Tubeway+Army+-+Are+Friends+Electric+%5BSzene%2C+197&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1347168197,"description":"Gary Numan &amp; Tubeway Army - Are Friends Electric [Szene, 1979].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Are 'Friends' Electric?&quot; is a song by English new wave band Tubeway Army from their 1979 album Replicas. It was released as a single in May 1979 and reached No. 1 in the UK Singles Chart, staying there for four weeks. It was written by Gary Numan.\n\nDespite being over five minutes long and possessing, in the words of its composer, &quot;no recognisable hook-line whatsoever&quot;, the single topped the UK charts. Whilst the track's distinctive sound stood out at the time, sales also benefited from the record company's use of a picture disc and Numan's striking, &quot;robotic&quot; performance on the TV shows The Old Grey Whistle Test and Top of the Pops. &quot;Are 'Friends' Electric?&quot; has been a mainstay of Numan's concerts since its release and appears on all ten of his official live recordings to date. A semi-acoustic version appeared on the 2006 Jagged tour setlist.\n\nGary Numan (born Gary Anthony James Webb on 8 March 1958) is an English singer, composer, and musician, most widely known for his chart-topping 1979 hits &quot;Are 'Friends' Electric?&quot; (as Tubeway Army) and &quot;Cars&quot;. His signature sound consisted of heavy synthesiser hooks fed through guitar effects pedals.\n\nNuman is considered a pioneer of commercial electronic music. His use of themes from science fiction, and his combination of aggressive punk energy with electronics, have been widely imitated.\n\nScene was a youth magazine on First German Television, which by 1972 produced and presented each year with the corresponding date (such as ' scene ' 73').\n\nThomas Gottschalk hosted the scene, which was on Friday afternoon, from 1976 to 1979. Under him, the program developed into a pure music show with Studio performances from bands and supplemented by interviews, as on 16 July 1976 with Kiss and the first video clips, like &quot;I Do not Like Mondays&quot; by The Boomtown Rats. Sidekick Anthony Powell, was at his side in 1977 with slapstick comedy. The last episode ran on 16 November 1979. In 1980, the show returned as Pop-Stop and continued until 1983.\n(video has a semi-transparent white &quot;BR&quot; logo at the top left)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Are_'Friends'_Electric%3F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Are_'Friends'_Electric%3F&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/AacKoAAEa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/AacKoAAEa&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8241kbps\n   Audio: PCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:05:08\n\n\n\n\n*Install the &quot;Media Player Classic Home Cinema&quot; player if you can't play this \n file, or for better visual and audio quality playback of all your videos. \n It's 100% free to download and use. Latest stable build is v1.6.3\n\n\n*Media Player Classic Home Cinema*   &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:7e6ba1d5f61ff686e9ad9337d76764ba6e7f0a72","amp;dn":"Gary+Numan+%26amp%3B+Tubeway+Army+-+Are+Friends+Electric+%5BSzene%2C+197","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6ba1d5f61ff686e9ad9337d76764ba6e7f0a72","infoHashBuffer":{"type":"Buffer","data":[126,107,161,213,246,31,246,134,233,173,147,55,215,103,100,186,110,127,10,114]},"announce":[],"urlList":[]}}