{"title":"Cross the Water Blues: African American Music in Europe(pdf)[rog","uid":6773608,"size":5239958,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7f9cfd6c2bb500bfed6b33d9142367834ced3f78&amp;dn=Cross+the+Water+Blues%3A+African+American+Music+in+Europe%28pdf%29%5Brog&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":1,"time":1319655270,"description":"Cross the Water Blues: African American Music in Europe\nAuthor/Editor: Neil a Wynn\nPublished by: University Press of Mississippi \nPublished  7 July 2007\nISBN: 1578069602, 1604735465 \nPages:  289 \nFormat:pdf\n\nThis unique collection of essays examines the flow of African American music and musicians across the Atlantic to Europe from the time of slavery to the twentieth century. In a sweeping examination of different musical forms--spirituals, blues, jazz, skiffle, and orchestral music--the contributors consider the reception and influence of black music on a number of different European audiences, particularly in Britain, but also France, Germany, and the Netherlands. \nThe essayists approach the subject through diverse historical, musicological, and philosophical perspectives. A number of essays document little-known performances and recordings of African American musicians in Europe. Several pieces, including one by Paul Oliver, focus on the appeal of the blues to British listeners. At the same time, these considerations often reveal the ambiguous nature of European responses to black music and in so doing add to our knowledge of transatlantic race relations. \n\nContributions from Christopher G. Bakriges, Sean Creighton, Jeffrey Green, Leighton Grist, Bob Groom, Rainer E. Lotz, Paul Oliver, Catherine Parsonage, Iris Schmeisser, Roberta Freund Schwartz, Robert Springer, Rupert Till, Guido van Rijn, David Webster, Jen Wilson, and Neil A. Wynn \n\nNeil A. Wynn is professor of twentieth-century American history at the University of Gloucestershire. He is the author of Historical Dictionary from Great War to Great Depression, From Progressivism to Prosperity: American Society and the First World War, and The Afro-American and the Second World War. [/color]\n","torrent":{"xt":"urn:btih:7f9cfd6c2bb500bfed6b33d9142367834ced3f78","amp;dn":"Cross+the+Water+Blues%3A+African+American+Music+in+Europe%28pdf%29%5Brog","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9cfd6c2bb500bfed6b33d9142367834ced3f78","infoHashBuffer":{"type":"Buffer","data":[127,156,253,108,43,181,0,191,237,107,51,217,20,35,103,131,76,237,63,120]},"announce":[],"urlList":[]}}