{"title":"Richard.III.The.Unseen.Story - POTP (History)","uid":8273002,"size":592601209,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7fe612afcba025dbcc5270a2197c3db33457e11d&amp;dn=Richard.III.The.Unseen.Story+-+POTP+%28History%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PowerOfThePoor1992","files":1,"time":1363647020,"description":"Description\n--------------\n\nA special follow-up to the programme that broadcast exclusive access to the research into the remains of Richard III found underneath a Leicester car park.\n\nThe research confirmed that the remains were his, and helped build a picture of what he looked like.\n\nUsing unseen footage of the dig and tests, and fresh interviews with the lead scientists, this programme reveals multiple new dimensions to the hunt for England's long-lost king.\n\nThe project involved dozens of specialists, in the fields of archaeology, osteology, history, forensic pathology, genealogy and DNA analysis.\n\nThe programme pieces together the critical steps in the archaeological excavation, explaining how the Greyfriars Church was uncovered and detailing the painstaking exhumation of Richard's grave from the first indications of human remains to the exposure of the body's twisted spine.\n\nIn the university's labs, the programme follows the scientists as they examine the skeleton to unlock the lost king's story, revealing its clues to his diet and social status, and to the diseases he endured.\n\nThe film reveals how the DNA match with Richard III was made.\n\nPerhaps the most harrowing stage of the project was the minute forensic examination of the cause of death. Piecing together CT scans and microscopic analysis, the team identified the major injuries that Richard suffered in the last moments of his life and shortly afterwards.\n\n-------------\n\nWell enjoy and please SEED!!!!\n\nGreetings\nPowerOfThePeople -POTP\t\n\nThe first torrent i uploaded had some problem this the working one.","torrent":{"xt":"urn:btih:7fe612afcba025dbcc5270a2197c3db33457e11d","amp;dn":"Richard.III.The.Unseen.Story+-+POTP+%28History%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe612afcba025dbcc5270a2197c3db33457e11d","infoHashBuffer":{"type":"Buffer","data":[127,230,18,175,203,160,37,219,204,82,112,162,25,124,61,179,52,87,225,29]},"announce":[],"urlList":[]}}