{"title":"Designing Functional Foods","uid":15155562,"size":8229464,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:803452f709b7b7791d484938606bb5dc731850cd&amp;dn=Designing+Functional+Foods&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467297306,"description":"Designing Functional Foods - D. Julian McClements, Eric A. Decker (WP, 2009).pdf\r\n\r\nISBN 978-1-84569-432-6\r\n\r\nThe breakdown of food structures in the gastrointestinal tract has a major impact on the sensory properties and nutritional quality of foods. Advances in understanding the relationship between food structure and the breakdown, digestion and transport of food components within the GI tract facilitate the successful design of health-promoting foods. This important collection reviews key issues in these areas.\r\n\r\nOpening chapters in Part one examine oral physiology and gut microbial ecology. Subsequent chapters focus on the digestion, absorption and physiological effects of significant food components, such as lipids, proteins and vitamins. Part two then reviews advances in methods to study food sensory perception, digestion and absorption, including in vitro simulation of the stomach and intestines and the use of stable isotopes to determine mineral bioavailability. The implications for the design of functional foods are considered in Part three. Controlling lipid bioavailability using emulsion-based delivery systems, designing foods to induce satiation and self-assembling structures in the GI tract are among the topics covered.\r\n\r\nWith contributions from leading figures in industry and academia, Designing functional foods provides those developing health-promoting products with a broad overview of the wealth of current knowledge in this area and its present and future applications.\r\n\r\nReviews digestion and absorption of food components including oral physiology and gut microbial ecology\r\nEvaluates advances in methods to study food sensory perception assessing criteria such as simulation of flavour released from foods\r\nInvestigates the implications for the design of functional foods including optimising the flavour of low-fat foods and controlling the release of glucose","torrent":{"xt":"urn:btih:803452f709b7b7791d484938606bb5dc731850cd","amp;dn":"Designing+Functional+Foods","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803452f709b7b7791d484938606bb5dc731850cd","infoHashBuffer":{"type":"Buffer","data":[128,52,82,247,9,183,183,121,29,72,73,56,96,107,181,220,115,24,80,205]},"announce":[],"urlList":[]}}