{"title":"Magicians - Ben Salinas - Modern Coin Magic vol.1 DVDrip Xvid","uid":7550313,"size":733130281,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:803fcc328a553e6f15a0639067777bb51cf32405&amp;dn=Magicians+-+Ben+Salinas+-+Modern+Coin+Magic+vol.1+DVDrip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345424084,"description":"\nBen Salinas - Modern Coin Magic vol.1 DVDrip Xvid.avi\n &lt;a href=&quot;\nhttp://www.penguinmagic.com/p/1396&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.penguinmagic.com/p/1396&lt;/a&gt;\n\nThe Classic Course in Coin Magic Is Here!\n\nWatch, in wonder and amazement, the most incredible sleights and tricks with coins! Then, learn, step by step from the performer's view, how you too can do these amazing coin moves! This 4 DVD Set is OVERLOADED with more than 170+ sleights and trick using coins!\n\nDISC ONE...\n\nCoin Concealments, The Classic Palm, The Edge Palm, The Thumb Palm, The Downs Palm, The Finger Palm, The Front Finger Hold, The Back Palm, The Back, Finger Clip, The Back Thumb, The Bobo Switch, Utility Switch, One-Hand Switch, Shaw-Judah Coin Switch, The Click Pass Paul Morris Click Pass, The Coin Flip, Change-Over Pass, The Bottom Steal, Producing a Coin from a Spectator's Clothing, Taking Advantage of a Fumble 1 &amp; 2, Standard Vanish, Simple Vanish, Over the Top, The Tunnel Vanish, Thumb Palm Vanish, The Drop Vanish, The Bobo Coin Vanish, The Slide Vanish, The Illusive Coin Pass, A Coin Vanish, The Pinch Vanish, Gone The New Era Coin, Go, The Flyaway Coin, Behind the Back, The French Drop (Le Tourniquet), The Reverse French Drop, The Wrist Watch Vanish, The Pulse Trick, The Cranium Vanish, Vanish with the Aid of a Handkerchief, The Head and Tails Vanish, A Vanish for Several Coins, A Trio of Vanishes, Spellbound (Vernon), Edge Grip, Curl Palm, Muscle Pass, French Drop Switch, Jimmy Wilson Vanish, Ramsey Subtlety, Kaps Subtlety Spider Vanish, Tenkai Pinch, Kaps Palm to Palm Switch, Strike Vanish.\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy","torrent":{"xt":"urn:btih:803fcc328a553e6f15a0639067777bb51cf32405","amp;dn":"Magicians+-+Ben+Salinas+-+Modern+Coin+Magic+vol.1+DVDrip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803fcc328a553e6f15a0639067777bb51cf32405","infoHashBuffer":{"type":"Buffer","data":[128,63,204,50,138,85,62,111,21,160,99,144,103,119,123,181,28,243,36,5]},"announce":[],"urlList":[]}}