{"title":"Helen Luke - The Way of Woman (pdf)","uid":8622181,"size":2409756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81257a8aa992436e5761de1dbabb76dc9bf137ef&amp;dn=Helen+Luke+-+The+Way+of+Woman+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372404917,"description":"Helen M. Luke - The Way of Woman: Awakening the Perennial Feminine (Anchor, 1995). 224 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\ndescription:\n\nHelen M. Luke speaks with the power of a true sage on the issues of community, relationships, the women's movement, marriage and divorce, and mothering. Profound, graceful, and transforming, The Way of Woman is a true celebration of feminine worth.\n\n&quot;In this book, Helen Luke has rendered her lifetimes' worth of understandings about the unique nature of the feminine psyche. The spirit of the work is to be treasured especially because it is informed by her ninety years of inimitable life.&quot;\n--Clarissa Pinkola Estes, Ph.D., author of Women Who Run with the Wolves and The Gift of Story\n\n&quot;For many years I've learned from the experiments and reflections of Helen Luke, one of the few authors inspired by Jung who leaves a strong individual contribution to a spiritually rich psychology. She was able to find a unique way through the polarities that get us all stuck: theory and personal insight, gender and a point beyond gender, psychology and spirituality, tradition and immediate perception, knowledge and wisdom. Better tos pend a day meditating on a single page of her writing than to read a stack of books for enlightenment.&quot; \n--Thomas Moore, author of Care of the Soul, Soul Mates, and Meditations\n\n&quot;In the Book of Proverbs it is written: 'Say to wisdom, you are my sister, and call insight your intimate friend.' Helen M. Luke was such a sister and such a friend. In The Way of Woman one is honored to be in the presence of a true Wise Woman.&quot;\n--Jonathan Cott, author of Isis and Osiris, The Search for Omm Sety, and Pipers at the Gates of Dawn\n\n&quot;Helen Luke can strike one note with one finger with such sensitivity that is resonates forever in our soul... On behalf of countless women and men, I say, 'Thank you, Helen. Thank you for guiding me to the courage of my own feminine depths. Thank you for strengthening me in finding my feminine voice. Thank you for steadfastly living the feminine values in a society that, consciously and unconsciously, despises them. Thank you for encouraging me to go where I might never have dared go alone. And thank you for shining the light into corridors where I have yet to go.&quot;\n--Marion Woodman, author of Leaving My Father's House, from her foreword","torrent":{"xt":"urn:btih:81257a8aa992436e5761de1dbabb76dc9bf137ef","amp;dn":"Helen+Luke+-+The+Way+of+Woman+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81257a8aa992436e5761de1dbabb76dc9bf137ef","infoHashBuffer":{"type":"Buffer","data":[129,37,122,138,169,146,67,110,87,97,222,29,186,187,118,220,155,241,55,239]},"announce":[],"urlList":[]}}