{"title":"Prince And The Revolution - When Doves Cry","uid":4729452,"size":201371652,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:81af0d211b6c6a7991ae9e2d54fe12ff86f897ff&amp;dn=Prince+And+The+Revolution+-+When+Doves+Cry&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1234929262,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;When Doves Cry&quot; is a song by the American musician Prince, and the lead single from his 1984 album Purple Rain. It was a worldwide hit, and his first American number one single, topping charts for five weeks. According to Billboard magazine, it was the top-selling single of the year.\n\nThe song follows the general spiritual theme of Christianity throughout Purple Rain. Many have interpreted the 'dove' as being a symbol of the Holy Spirit. The song has also been understood as Prince's cry to God: &quot;how could you just leave me standing alone in a world that's so cold?&quot; One can also interpret Prince's denial of both parents as a criticism of the 5th (or 4th, depending on faith) commandment of honoring thy father and mother, further solidifying his call for God to intervene.\n\nOn 10/13/2008, the song was voted #2 on Australian VH1's Top 10 Number One Pop Songs countdown.\n\nThe music video (directed by Prince himself) was released on MTV in June, 1984. It opens with white doves emerging from double doors to reveal Prince in a bathtub. It also includes scenes from the Purple Rain film interspersed with shots of the Revolution performing and dancing in a white room. The final portion of the video incorporates a mirrored frame of the left half of the picture, creating a doubling effect. The video was nominated for Best Choreography in 1985's MTV Video Music Awards.The video sparked controversy among network executives who thought that the sexual nature of the video was too explicit for television.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:81af0d211b6c6a7991ae9e2d54fe12ff86f897ff","amp;dn":"Prince+And+The+Revolution+-+When+Doves+Cry","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81af0d211b6c6a7991ae9e2d54fe12ff86f897ff","infoHashBuffer":{"type":"Buffer","data":[129,175,13,33,27,108,106,121,145,174,158,45,84,254,18,255,134,248,151,255]},"announce":[],"urlList":[]}}