{"title":"Sean.Price.Kimbo.Price","uid":5147757,"size":62211655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:81f336591151e3cd6f81bde3a3aa68c7ac7d75e1&amp;dn=Sean.Price.Kimbo.Price&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cerealwriter","files":24,"time":1257364210,"description":"Hailing from Brownsville, New York. Standing at 6'1&quot; and weighing in at 242 pounds. Formerly known as Scragbite, then RUCK, then Deceptacon Sean, and now going by MEGASEAN, Sean P!!! is back in the ring and he's going to make sure you talk about him. In fact, borrowing words from the great Mike Tyson, Sean Price claims that &quot;your grandkids and kids after that are going to know about me. I'm going to make sure of that. They are never going to forget about me. Your great grandkids are going to say WOW, wasn't that a bizarre individual.&quot;\n\nBizarre or not, Sean Price has an ironclad fist on this rap game. His combination of witty word play, humor and hardcore lyrics leave fans wondering what the MC is going to say next. We have seen that Sean Price is a multifaceted individual. With the start up of his newly formed label, RUCK DOWN RECORDS, Sean Price still finds the necessary time to record and promote his own albums. KIMBO PRICE, the prelude to his next national album, MIC TYSON (2010), is a 23 track mix cd that brings the listeners into the world of Sean Price that we love so much. If you know Sean Price in some capacity, you probably got dissed on this album. The rapper goes so far as to say he doesn't even like himself!\n\nFans have been treated to leak records off the mix cd such as RUCK DOWN, where Sean Price announces the closing of Duck Down Records and declares himself the newly formed President and CEO of his own label, properly named RUCK DOWN. Other songs out include &quot;BOOST&quot; featuring PF Cuttin where Sean Price rhymes the entire song through the churp, along with &quot;MegaSean,&quot; &quot;P's UP&quot; and &quot;Duck Down&quot; featuring label mates Torae &amp; Skyzoo.\n\nSean Price is joined by a select few artists on the remainder of KIMBO PRICE. Artists such as Buckshot, Rock of Heltah Skeltah, Ruste Juxx, Royce Da 5'9&quot; L.E.G.A.C.Y., Poisen Pen, Illanoyz, Agallah and others help round out a very balanced collection music.\n\nBe on the look out for new Sean Price videos off KIMBO PRICE tracks and stay tuned for exclusive music from Sean Price's new super group, RANDOM AXE comprised of Sean Price, Guilty Simpson and Black Milk.","torrent":{"xt":"urn:btih:81f336591151e3cd6f81bde3a3aa68c7ac7d75e1","amp;dn":"Sean.Price.Kimbo.Price","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81f336591151e3cd6f81bde3a3aa68c7ac7d75e1","infoHashBuffer":{"type":"Buffer","data":[129,243,54,89,17,81,227,205,111,129,189,227,163,170,104,199,172,125,117,225]},"announce":[],"urlList":[]}}