{"title":"La Gran InundaciÃƒÂ³n De Paris.(Docu).(Spanish).","uid":5271403,"size":733180774,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:82bcc617f619fede1e10d23032f92d824d611770&amp;dn=La+Gran+Inundaci%C3%83%C2%B3n+De+Paris.%28Docu%29.%28Spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cholo24","files":1,"time":1263243262,"description":"La gran inundaciÃƒÂ³n de ParÃƒÂ­s\n\nEl documental narra las historias de seis personajes que deben desenvolverse, en el ParÃƒÂ­s de 2010, en ese escenario apocalÃƒÂ­ptico. Todos ellos se han visto afectados por el desastre de una u otra manera, ya sea por su profesiÃƒÂ³n o por cuestiones personales. No se conocen, pero su camino se cruzarÃƒÂ¡ en algÃƒÂºn momento y deberÃƒÂ¡n demostrar que, en tiempos de crisis, la solidaridad y la cooperaciÃƒÂ³n adquieren otro sentido. \nParÃƒÂ­s se encuentra en pleno invierno, con el agua potable, la electricidad, el gas, el telÃƒÂ©fono y todos los servicios de la ciudad al borde del colapso. No para de llover. La Plaza de la Concordia y el Louvre estÃƒÂ¡n cubiertos por la oscuridad y el agua. Todas las infraestructuras han sido destruidas: no hay seÃƒÂ±ales de trÃƒÂ¡fico, no hay metro, no hay trenes. Las tiendas estÃƒÂ¡n cerradas y las calles, desiertas del bullicio habitual de la capital francesa, aparecen llenas de residuos domÃƒÂ©sticos. De las alcantarillas emergen ratas que provocan epidemias mortales.\nLa abundancia de archivos sobre otras grandes inundaciones de ParÃƒÂ­s, la precisiÃƒÂ³n de los estudios recientes y las imÃƒÂ¡genes generadas o tratadas por ordenador han hecho posible crear espectaculares escenarios donde desarrollar este realista documental sobre lo que ocurrirÃƒÂ¡ en la Ciudad de la Luz cuando el rÃƒÂ­o Sena suba, esta vez mÃƒÂ¡s, su nivel.\nParece un escenario increÃƒÂ­ble, pero unos hechos parecidos ya ocurrieron en 1910, cuando otra gran inundaciÃƒÂ³n asolÃƒÂ³ ParÃƒÂ­s, anegando 500 hectÃƒÂ¡reas del centro de la capital francesa y afectando a 150.000 personas. El agua paralizÃƒÂ³ la ciudad, la mayor parte de las grandes fÃƒÂ¡bricas tuvo que cerrar y el metro y los enlaces ferroviarios se cortaron. Ahora, cien aÃƒÂ±os despuÃƒÂ©s, nuestra dependencia tecnolÃƒÂ³gica nos ha conducido hacia un equilibrio mÃƒÂ¡s frÃƒÂ¡gil y las aguas pueden ocasionar un desastre aÃƒÂºn mayor.\n","torrent":{"xt":"urn:btih:82bcc617f619fede1e10d23032f92d824d611770","amp;dn":"La+Gran+Inundaci%C3%83%C2%B3n+De+Paris.%28Docu%29.%28Spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82bcc617f619fede1e10d23032f92d824d611770","infoHashBuffer":{"type":"Buffer","data":[130,188,198,23,246,25,254,222,30,16,210,48,50,249,45,130,77,97,23,112]},"announce":[],"urlList":[]}}