{"title":"David Bowie and Bing Crosby - Little Drummer Boy","uid":4547181,"size":159023108,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:839eb1424497c1698d8e04de14836f641be776b1&amp;dn=David+Bowie+and+Bing+Crosby+-+Little+Drummer+Boy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1228171445,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Peace on Earth/Little Drummer Boy&quot; is a Christmas song with an added counterpoint performed by David Bowie and Bing Crosby. &quot;Little Drummer Boy&quot; is a traditional Christmas song written in 1957, while the &quot;Peace on Earth&quot; tune and lyrics were added to the song especially for Bowie and Crosby&amp;#039;s recording.\n\nThe track was originally recorded on 11 September 1977 for Crosby&amp;#039;s 1977 television special, Bing Crosby&amp;#039;s Merrie Olde Christmas. The pair exchanged dialogue about what they do for Christmas before singing the traditional song, &quot;Little Drummer Boy&quot;, with a new counterpoint with original lyrics written for the special, &quot;Peace on Earth&quot;. Bowie&amp;#039;s appearance has been described as a &quot;surreal&quot; event, undertaken at a time that he was &quot;actively trying to normalise his career&quot;. He has since recalled that he only appeared on the show because &quot;I just knew my mother liked him.&quot; Crosby would die just over a month after recording the special, which aired on 30 November 1977.\n\nThe song was available for some years as a bootleg single backed with &quot;Heroes&quot;, which Bowie had also performed on the TV special. In 1982, RCA issued the recording as an official single, complete with the dialogue, arbitrarily placing &quot;Fantastic Voyage&quot; from the Lodger album on the B-side. Bowie was unhappy with this move, which further soured his strained relationship with RCA, and he left the label soon after. The single would climb to #3 on the UK charts, boosted by a 12&quot; picture disc release, and has since become a perennial on British Christmas compilation albums, with the TV sequence also a regular on UK nostalgia shows.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:839eb1424497c1698d8e04de14836f641be776b1","amp;dn":"David+Bowie+and+Bing+Crosby+-+Little+Drummer+Boy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"839eb1424497c1698d8e04de14836f641be776b1","infoHashBuffer":{"type":"Buffer","data":[131,158,177,66,68,151,193,105,141,142,4,222,20,131,111,100,27,231,118,177]},"announce":[],"urlList":[]}}