{"title":"The Anthony Cumia Show 2015-02-18 MP4 MP3 combo","uid":11711592,"size":303488186,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:84bdc885dc6eaa83446b0942120ef81dcad0083b&amp;dn=The+Anthony+Cumia+Show+2015-02-18+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1424367236,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest(s): Dr. Alex Schiller\n\nEpisode 113: Hump day kicks off with Ant explaining his wardrobe, pumping up today's guest Alex Schiller, professing his love for vagina walls, and talking about &quot;crutches&quot; he's had in broadcasting. He then gets into his H1Z1 play from last night, Colin Quinn's new web series &quot;Cop Show&quot; on LStudio.com, Afroman punching a chick while on stage, we look at some pictures of Chelsea Handler's tits and hear about the internet feedback, and talk about how ballsy social media has made people. Ant reads a story about a 72-year-old man facing ten years for an unloaded 300 year-old-gun, we watch a video of a senior &quot;driving&quot;, talk about how the driving testing has changed over the years, and then goes off about the different types of testing that should be done in 2015. Fangirl Dr. Alex Schiller joins TACS to talk about her book &quot;Never Sleep Alone&quot;, properly turning on women, how monogamy rarely works, the ease of changing into someone &quot;fuckable&quot;, lying versus embellishing, orgasmic and life fulfillment, and dating outside of your comfort zone. They also discuss sexual prowess, online dating, hear from a gal who has taken Dr. Schiller's advice, the importance of practicing your sexual skills, safe sex, international travel, and pubes making a comeback.\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:84bdc885dc6eaa83446b0942120ef81dcad0083b","amp;dn":"The+Anthony+Cumia+Show+2015-02-18+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84bdc885dc6eaa83446b0942120ef81dcad0083b","infoHashBuffer":{"type":"Buffer","data":[132,189,200,133,220,110,170,131,68,107,9,66,18,14,248,29,202,208,8,59]},"announce":[],"urlList":[]}}