{"title":"dale brown-strike force","uid":4119914,"size":777581084,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:85bc24bc623be374be51b94f03017fd2c51e2834&amp;dn=dale+brown-strike+force&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hater-hater","files":15,"time":1207499332,"description":"also the behind the book mp3\n\nStrike Force (June 2007)\n\nTHE BATTLE FOR CONTROL OF IRAN . . . BEGINS IN SPACE.\n\nWhen a disgraced former Iranian military chief of staff engineers an insurgency that threatens to destroy the theocratic regime in Iran, a new era appears to be dawning in the Middle East . . . but one must be wary of old enemies.\n\nOn the run from the theocrat&amp;#039;s terror army, the Pasdaran, and unable to count on support from his friends in the regular army, rebel leader General Hesarak al-Kan Buzhazi desperately turns to his old nemesis, U.S. Air Force Lieutenant-General Patrick McLanahan, for help. Unwilling to commit American forces in an Iranian civil war, and with time running out, the President authorizes McLanahan to utilize a new and top-secret fleet of globe-crossing spaceplanes, the XR-A9 Black Stallions, led by test pilot and astronaut Captain Hunter Noble. Within hours, McLanahan&amp;#039;s Air Battle Force turns the tide, possibly changing the course of history in the Middle East for generations.\n\nThe advent of almost instantaneous global reach, along with the reactivation of America&amp;#039;s first military space station, Silver Tower, has rekindled fears of a space arms race, and the growing insurgency in Iran is threatening to erupt into a worldwide jihad. But McLanahan finds himself embroiled in even more bitter battles at the White House, between those who support his space-based military initiative-and those who are working secretly to undermine it. When McLanahan is forced to fight his political and personal battles back at home, it&amp;#039;s left to Hunter Noble and his team of young American space engineers to keep the fires of freedom in the Middle East from exploding completely out of control.\n\nFilled with the latest cutting-edge weaponry, geopolitical intrigue, high-flying suspense, and a colorful cast of characters, Strike Force is New York Times bestselling master Dale Brown at his best. ","torrent":{"xt":"urn:btih:85bc24bc623be374be51b94f03017fd2c51e2834","amp;dn":"dale+brown-strike+force","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85bc24bc623be374be51b94f03017fd2c51e2834","infoHashBuffer":{"type":"Buffer","data":[133,188,36,188,98,59,227,116,190,81,185,79,3,1,127,210,197,30,40,52]},"announce":[],"urlList":[]}}