{"title":"Fabrizio De AndrÃƒÂ© - Vol.1, [LOSSY mp3 320kbps] [Tntvillage]","uid":5633895,"size":80304278,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:878e77a60207a546f76126d616a34538e0f2964c&amp;dn=Fabrizio+De+Andr%C3%83%C2%A9+-+Vol.1%2C+%5BLOSSY+mp3+320kbps%5D+%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"year2012","files":25,"time":1276803145,"description":"Fabrizio De AndrÃƒÂ© - Vol.1, [LOSSY mp3 320kbps] [Tntvillage]\n\n\nFabrizio De AndrÃƒÂ© - Vol.1\n\nby Mr.Do\n\n\ncover\n\n Visit this link: http://img17.Imageshack.us/img17/4138/frontiem.th.jpg  Visit this link: http://img391.Imageshack.us/img391/2029/backq.th.jpg\n\nDe AndrÃƒÂ© non ÃƒÂ¨ stato mai di moda. E infatti la moda, effimera per definizione, passa. Le canzoni di Fabrizio restano.\nNicola Piovani\n\n Visit this link: http://img6.Imageshack.us/img6/584/faber1.jpg\n\nGli estimatori di Fabrizio De AndrÃƒÂ© ammirano il coraggio morale e la coerenza artistica con cui egli, nella societÃƒÂ  italiana del dopoguerra, scelse di sottolineare i tratti nobili ed universali degli emarginati, affrancandoli dal &quot;ghetto&quot; degli indesiderabili e mettendo a confronto la loro dolorosa realtÃƒÂ  umana con la cattiva coscienza dei loro accusatori. Il cammino di Fabrizio De AndrÃƒÂ© ebbe inizio sulla pavimentazione sconnessa ed umida del carruggio di Via del Campo, prolungamento della famosa Via PrÃƒÂ©, strada proibita di giorno quanto frequentata la notte. ÃƒË† in quel ghetto di umanitÃƒÂ  platealmente respinta e segretamente bramata che avrebbero preso corpo le sue ispirazioni; di ghetto in ghetto, dalle prostitute alle minoranze etniche, passando per diseredati, disertori, bombaroli ed un'infinitÃƒÂ  d'altre figure. Nella sua antologia di vinti, dove l'essenza delle persone conta piÃƒÂ¹ delle azioni e del loro passato, De AndrÃƒÂ© raggiunse risultati poetici che oggi gli vengono ampiamente riconosciuti.\n\n Visit this link: http://img27.Imageshack.us/img27/47/faber2.jpg\n\nLa discografia di De AndrÃƒÂ© ÃƒÂ¨ ampia, ma non vasta come quella di altri autori del suo tempo; pur tuttavia risulta memorabile per varietÃƒÂ  ed intensitÃƒÂ . Viene ora riassunta in postume ricostruzioni filologiche, curate dalla moglie e da esperti tecnici del suono che si sono riproposti l'obiettivo di mantenere, nei nuovi supporti, le sonoritÃƒÂ  dei vecchi LP in vinile. Sino ad ora sono state realizzate due raccolte, entrambe in triplo CD, titolate In direzione ostinata e contraria e In direzione ostinata e contraria 2.\nAlcuni fra i maggiori cantanti e cantautori italiani, nel marzo del 2000, hanno ricordato Fabrizio De AndrÃƒÂ© con un concerto celebrativo, al teatro Carlo Felice di Genova, interpretando i suoi maggiori successi. Di quel concerto ÃƒÂ¨ stato realizzato un doppio cd, dal titolo Faber, pubblicato nel 2003, i cui proventi sono stati devoluti in beneficenza.\n\n Visit this link: http://img25.Imageshack.us/img25/7031/faber3.jpg\n\nLa Premiata Forneria Marconi ha eseguito, e tutt'ora esegue concerti nei quali reinterpreta le canzoni di De AndrÃƒÂ©, in cui si ricorda la proficua collaborazione tra il gruppo e il cantautore.\nA Genova, in Via del Campo, dove l'intrico di viuzze si fa congestionato come in una Qasba mediorientale, nel negozio di dischi di Gianni Tassio, ora acquisito dal comune di Genova, ÃƒÂ¨ esposta la chitarra con la quale, probabilmente, De AndrÃƒÂ© ha studiato i testi delle canzoni di &quot;CrÃƒÂªuza de mÃƒÂ¤&quot;. Lo strumento, la &quot;Francisco Esteve&quot; n. 097, venne messo all'asta in favore di Emergency dalla famiglia, poco tempo dopo la sua morte, ed acquistato dai negozianti del capoluogo ligure, dopo una serrata lotta al rialzo con alcuni facoltosi collezionisti. Nonostante la loro proverbiale &quot;tirchieria&quot;, i commercianti Genovesi arrivarono a sborsare 168.500.000 lire, per aggiudicarsi la chitarra di Faber.\n\n Visit this link: http://img19.Imageshack.us/img19/243/faber4.jpg\n\nOra il negozio di via del Campo, nei luoghi dove il cantautore avrebbe voluto trascorrere i suoi ultimi anni, si ÃƒÂ¨ trasformato in una sorta di museo, e chi vi passa davanti puÃƒÂ² ascoltare sommessamente le note delle sue canzoni; inoltre, vi si trovano esposte in vetrina le copertine originali di tutti i suoi dischi.\nSu iniziativa della moglie Dori Ghezzi e di Fernanda Pivano ÃƒÂ¨ nata la Fondazione Fabrizio De AndrÃƒÂ© Onlus che si occupa di mantenere viva la memoria del cantautore. Molte sono le iniziative promosse, moltissimi i gesti di stima e di amore che tutta Italia porge ogni anno alla \nOltre agli artisti celebri, anche una lunga serie di cantanti meno conosciuti e, soprattutto, di gruppi giovanili, hanno registrato album composti principalmente o esclusivamente da canzoni di Faber, spesso con risultati apprezzabili. Nelle piazze e nei teatri di cittÃƒÂ  e di provincia sono centinaia le rappresentazioni che, ogni anno, vengono dedicate a De AndrÃƒÂ©. Tra i piÃƒÂ¹ conosciuti interpreti e tribute band, ricordiamo: Accordi in Settima, Affa Affa, Alberto Cantone, Amedeo Giuliani &amp; Band, Andhira, Anime Salve, Antonello Persico e gli Arbor, Apocrifi, Artenovecento, Beans Bacon &amp; Gravy, Born to Drink, Carlo Ghirardato, Cantando De AndrÃƒÂ©, Caro De AndrÃƒÂ©, Coro Aurora, Corrente di Ali, D.O.C. Sound, Disamistade, Endegu, FAB-Ensemble, Faber Band, FaberNoster, FDA Cover B, Four Steps Choir, Fuori dal coro, Giorgio Cordini, Gente d'altri paraggi, Giuseppe Cirigliano, Golesecche, Gruppo di ContinuitÃƒÂ , Gruppo musicale, Disamistade, Il suonatore Jones, Il Testamento di Faber, L'amore che strappa i capelli, La Cattiva Strada band, Le voci di Sally, Luciano Monceri, Kampina, KhorakhanÃƒÂ¨, KhorakhanÃƒÂ¨ 2, Kinnara, MadamadorÃƒÂ¨, Malecorde, Malindamai, Mercanti di Liquore, Mercantinfiera, Mille Papaveri, Nottefonda, Omaggio a FDA, Orchestrina del Suonatore Jones, Ostinati e Contrari, Ottocento, Passaggi, PCE Eianda, Piccola Bottega Baltazar, Piccola Orchestra Apocrifa, Quartetto KhorakhanÃƒÂ¨, Quattrochitarre, Sand Creek Band, Servidisobbedienti, SHILOQ, SloTrio, Spoon River, Trailalo, Trioprincesa, Volta la carta.\n\n Visit this link: http://img9.Imageshack.us/img9/7014/faber5.jpg\n\nFabrizio De AndrÃƒÂ©, chitarra folk e voce\nN.D.: cercato sul sito ufficiale, su wikipedia e millemila ettari cubici di altri siti senza trovare una beata fava\nP.S.: se qualcuno sa chi ha suonato in questo album per cortesia me lo faccia sapere\n\n Visit this link: http://img19.Imageshack.us/img19/8596/faber6.jpg\n\nrecensione\n\nDefinire un cantante ÃƒÂ¨ sempre qualcosa di molto difficile ma lo diventa ancora di piÃƒÂ¹ quando questo cantante ÃƒÂ¨ Fabrizio De AndrÃƒÂ¨, un personaggio schivo, al quale male si addicono gli echi mondani, i clamori della prima pagina. Introverso, anche, proprio come ogni ligure che si rispetti, forse diffidente del primo contatto umano e tutto dedito sempre al suo &quot;particulare&quot; (che ÃƒÂ¨, poi, scriversi delle canzoni e cantarle, non importa se in una sala di incisione, o fra le mura di casa sua, per un grande pubblico o per quattro amici). \nQuello che interessa ÃƒÂ¨ cantare, per esprimersi, per conoscere, per trasmettere delle proprie impressioni. Tutto qui. Ogni altra definizione sarebbe aleatoria e arbitraria. ÃƒË† vero che Fabrizio ÃƒÂ¨ stato classificato, e con qualche giustificazione reale, come &quot;cantante intellettuale&quot;, come &quot;il cantante che fa rivivere il menestrello medioevale, il troubador provenzale&quot;. Ed ÃƒÂ¨ sicuramente altrettanto vero che dietro a Fabrizio esistono una solida cultura, delle buone letture, un dialogo coi poeti del passato. \nTanto per divertirci in un gioco di elencazioni potremmo fare alcuni nomi: un Villion, certi &quot;poeti di piazza&quot; della Francia prima di Montaigne, oppure i piÃƒÂ¹ vicini e piÃƒÂ¹ nostri Boudelaire, Verlaine, Rimbaud. Ma tutto ciÃƒÂ² ÃƒÂ¨ marginale, anche se gioca il suo ruolo nella formazione del mondo creativo di Fabrizio De AndrÃƒÂ¨. Si prenda, per spiegarci meglio, la canzone &quot;Preghiera in Gennaio&quot; (forse l'esempio limite della gamma di toni di questo cantautore): basterebbe l'inizio, &quot;Lascia che sia fiorito / Signore il suo sentiero&quot;, oppure certe immagini come &quot;fate che giunga a Voi con le sue ossa stanche&quot;, per capire subito un clima, un entroterra culturale. Per capire che anche il De AndrÃƒÂ¨, e sia detto senza voler far comparazioni impossibili, si ÃƒÂ¨ lasciato tentare dalla &quot;rima fiore / amore / la piÃƒÂ¹ antica, difficile del mondo&quot;. \nMa poi c'ÃƒÂ¨ la musica, cosÃƒÂ¬ popolare, cosi melodicamente cantabile, cosÃƒÂ¬ da romanza. E questa musica di colto, di intellettuale, di &quot;commercio coi poeti&quot; non ha proprio nulla. E allora si evidenzia l'altro aspetto del De AndrÃƒÂ¨, un aspetto fatto di attaccamento alle piÃƒÂ¹ pure ragioni popolari, veramente, autenticamente popolari della canzone italiana. Di modo che questo ligure introverso, chiuso, schivo, riesce ad aprirsi ad un lirismo immediato, mediterraneo, che puÃƒÂ² anche essere imparentato (e l'accostamento non sorprenda) da un lato con la canzone francese d'oggi e dall'altro con quella napoletana dell'Ottocento. \nMa l'ascolto attento delle canzoni contenute in questo dico, cosÃƒÂ¬ diverse fra loro e pure cosÃƒÂ¬ simili, potrÃƒÂ  indicarci altre inclinazioni di gusto e di atteggiamento proprie di De AndrÃƒÂ¨. Inclinazioni decadenti, senza dubbio, ma anche di deformazione e di satira, di umori boccacceschi e picareschi (&quot;Via del Campo&quot;, &quot;Carlo Martello&quot;, &quot;Bocca di rosa&quot;) che balenano qua e lÃƒÂ  improvvisi e nei versi e nelle inflessioni della voce. Voce che si muta e si plasma ad ogni diversa situazione che via via va cantando e raccontando. Voce che diventa uno strumento, un mezzo non per giustificare il &quot;bel canto&quot;, ma per dare colori e toni alla storia, alla favola che in quel momento si racconta. \nPerchÃƒÂ©, se ÃƒÂ¨ vero che Fabrizio De AndrÃƒÂ¨ nelle sue canzoni si ispira sempre alla realtÃƒÂ , a fatti veri o che potrebbero essere veri, ÃƒÂ¨ altrettanto vero che questo non ÃƒÂ¨ che il punto di partenza. Quello di arrivo ÃƒÂ¨ la favola, il fatto che diventa simbolo. Certo, la cosa ha i suoi rischi, i suoi limiti, che sono poi quelli del bozzetto. Ma quando l'operazione riesce, allora si ottengono bellissime canzoni, come la celeberrima &quot;Carlo Martello&quot;, o la recentissima &quot;Bocca di Rosa&quot; che &quot;metteva l'amore sopra ogni cosa&quot;, canzone che ha il sapore di una ballata popolare con quel suo andamento, allegro e gioioso, a saltarello. \nDi quando in quando l'inchiostro del De AndrÃƒÂ¨ diventa triste e amaro, quasi cattivo. ÃƒË† il caso di &quot;Marcia Nuziale&quot;, una canzone che ha il sapore di una disperata malinconia, come di una rivincita andata a vuoto, di una sfida persa, con il ragazzo giÃƒÂ  grande che assiste alle nozze dei suoi genitori, accompagnandole suonando &quot;con la gola tesa l'armonica come un organo da chiesa&quot;. Oppure la ballata sulla morte, vista come &quot;l'estrema nemica&quot;, una nemica che &quot;non serve colpirla nel cuore / perchÃƒÂ© la morte mai non muore&quot;. Gli esempi potrebbero continuare, ma questi possono bastare. E poichÃƒÂ© la chiacchierata rischia di diventare troppo lunga bisognerÃƒÂ  cercare una plausibile conclusione: in fondo ad ogni canzone di De AndrÃƒÂ¨ c'ÃƒÂ¨ sempre l'uomo. L'uomo con le sue miserie e le sue gioie, le sue poche vittorie e le sue molte sconfitte e, soprattutto, col suo inesauribile bisogno di amore e di speranza.\n\n[...] Le ho scritte cosÃƒÂ¬, come mi hanno aggredito. Per incontenibile affiorare di memoria. [...] Talvolta il ricordo mi arrivava da molto lontano: dai balli a palchetto nelle campagne astigiane degli anni Cinquanta, dove un paio di labbra impiastricciate di viola, la cucitura di una calza di seta che scompariva nella &quot;terra promessa&quot;, il balcone dipinto di verde della casa di mia nonna diventavano i particolari di una memoria diversa e piÃƒÂ¹ recente: dalle labbra di &quot;Bocca di Rosa&quot; alla disperata attrazione per la stanza semibuia di &quot;Via del Campo&quot;.\n(dalla postfazione di Fabrizio De AndrÃƒÂ© al saggio &quot;La lingua cantata&quot;, Garamond, 1995.)\n\nLe prime nove tracce dell'album erano nuove, la decima, Carlo Martello ritorna dalla battaglia di Poitiers, ÃƒÂ¨ un ri-arrangiamento del singolo del 1963.\nQuesto disco viene pubblicato in mono dalla Bluebell nel maggio 1967 con la copertina marrone, e poi ristampato in versione stereo quattro mesi dopo con una copertina fotografica con il viso di De AndrÃƒÂ© a colori in un cerchio.\nLe due edizioni del disco differiscono anche per il testo di Bocca di Rosa: il paese di San Vicario viene modificato in Sant'Ilario nella seconda versione, mentre la strofa &quot;Spesso gli sbirri e i carabinieri al proprio dovere vengono meno / ma non quando sono in alta uniforme e l'accompagnarono al primo treno&quot; fu modificata (dietro &quot;cortesi pressioni dell'Arma dei Carabinieri&quot;) in &quot;Il cuore tenero non ÃƒÂ¨ una dote di cui sian colmi i carabinieri / ma quella volta a prendere il treno l'accompagnarono malvolentieri&quot;\nNon sono perÃƒÂ² finite qui le traversie del disco: infatti nel 1970 la Produttori Associati, etichetta nata dalle ceneri della Bluebell, ristampa il disco sostituendo Caro amore con La stagione del tuo amore, registrata appositamente qualche mese prima per un 45 giri, con produzione e arrangiamenti di Gian Piero Reverberi.\nSi noti che Caro amore (testo di De AndrÃƒÂ© e musica dal secondo tempo del Concerto d'Aranjuez di JoaquÃƒÂ­n Rodrigo), venne tolta dal disco per l'esplicita richiesta del compositore spagnolo, che non approvava il testo inserito da De AndrÃƒÂ© sulla sua musica.\nQuesta versione del disco ha la copertina uguale alla seconda versione Bluebell, con gli spigoli perÃƒÂ² appuntiti e non arrotondati: per alcune copie, perÃƒÂ² la Produttori Associati utilizza alcune copertine dell'edizione Bluebell (evidentemente avanzate) coprendo con un adesivo bianco con la nuova sequenza dei brani la sequenza originale.\nVi fu infine un'ultima ristampa a cura della Ricordi nel 1978, con la stessa sequenza della Produttori Associati.\nSi delinea in questo album quello che sarÃƒÂ  lo stile musicale di De AndrÃƒÂ©, un abbinamento di melodie semplici e allo stesso tempo ricercate con la chitarra e un testo poetico con soggetti spesso tratti ai margini della societÃƒÂ .\n\nnote\n\nQuesta release riguarda l'edizione della Produttori Associati, avendolo disponibile perÃƒÂ² ho inserito anche, a titolo di Bonus Track, il pezzo Caro Amore tratto dall'edizione originale del 1967. Purtroppo la disponibiltÃƒÂ  ÃƒÂ¨ limitata a un mp3 a 128 Kbps, sempre meglio di niente.\n\n Visit this link: http://img24.Imageshack.us/img24/8291/faber7.jpg\n\nscheda\n\nCantautore: Fabrizio De AndrÃƒÂ©\nTitolo: Vol.1\nAnno: 1967\nFormato: Lossy mp3\nBitrate: 320 Kbps\n\ntrack list\n\n01 - Preghiera in gennaio\n02 - Marcia nuziale\n03 - Spiritual\n04 - Si chiamava GesÃƒÂ¹\n05 - La canzone di Barbara\n06 - Via del Campo\n07 - La stagione del tuo amore\n08 - Bocca di rosa\n09 - La morte\n10 - Carlo Martello ritorna dalla battaglia di Poitiers\nBT - Caro amore\n\nVisit","torrent":{"xt":"urn:btih:878e77a60207a546f76126d616a34538e0f2964c","amp;dn":"Fabrizio+De+Andr%C3%83%C2%A9+-+Vol.1%2C+%5BLOSSY+mp3+320kbps%5D+%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"878e77a60207a546f76126d616a34538e0f2964c","infoHashBuffer":{"type":"Buffer","data":[135,142,119,166,2,7,165,70,247,97,38,214,22,163,69,56,224,242,150,76]},"announce":[],"urlList":[]}}