{"title":"The Gladiators Peter Watkins 1969.avi","uid":3378797,"size":732882944,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:879d0a5ee8b72a98c18a98299bf9988bd095256d&amp;dn=The+Gladiators+Peter+Watkins+1969.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gratis_pail","files":1,"time":1125803065,"description":"http://www.mnsi.net/~pwatkins/gladiators.htm\n\n?The Gladiators? is a bleak satire set in the near future, in which the major powers of the world, East and West, aligned and non-aligned, recognize the possibility of a major world war within our lifetime, and try to forestall it by channeling man?s aggressive instincts in a more controllable manner. They do this by forming an International Commission along the lines of the United Nations, dedicated to fighting a series of contests between teams of selected soldiers from each country. These competitions, which can be fought to the death, are called ?Peace Games?, and are broadcast on global television via satellite - complete with sponsors and commercials. The film follows Game 256, which is being ?played? in the International Peace Game Centre near Stockholm, under the controlling eye of a highly sophisticated computer, hired out to the International Commission by the (neutral) Swedish Army. The international group of officers watching Game 256 decide to eliminate a man and a woman from opposing teams who reach out to each other, because they decide that such forms of communication would be the gravest threat of all to the stability of the existing world-system.\n\nFilming: The ?Gladiators? was filmed during the summer and autumn of 1968 in a deserted brick factory in the countryside at K&amp;aring;rsta, outside of Stockholm, and in a empty ?slott? (minor castle) at M&amp;auml;ls&amp;aring;ker on the shores of Lake M&amp;auml;lar. The international cast was a mix of professional and non-professional actors. Many, including the people representing the Chinese army, came from London. The crew included producer Bo Jonsson, cinematographer Peter Suschitsky, sound recordist Tage Sjoborg, costumer Chris Collins, art director Bill Brodie, make-up artist Ann Brodie, and editor Lasse Hagstr&amp;ouml;m. ?The Gladiators? was produced during and following - and was directly influenced by - an upsurge in revolutionary events throughout Europe in 1968, especially the student uprisings in Paris.","torrent":{"xt":"urn:btih:879d0a5ee8b72a98c18a98299bf9988bd095256d","amp;dn":"The+Gladiators+Peter+Watkins+1969.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"879d0a5ee8b72a98c18a98299bf9988bd095256d","infoHashBuffer":{"type":"Buffer","data":[135,157,10,94,232,183,42,152,193,138,152,41,155,249,152,139,208,149,37,109]},"announce":[],"urlList":[]}}