{"title":"Third Odyssey - Europa Universalis IV mod","uid":11030377,"size":1016287,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:88015ae7483b0bcace8ae47f8054d7d689a85593&amp;dn=Third+Odyssey+-+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1410719658,"description":"Third Odyssey - Europa Universalis IV mod\n\nExtract 7zip to your C:Users[user]Documents Paradox Interactive Europa Universalis IV mod folder\n\n\n\nDescription: \nThis mod started out as a desire to colonise the new world as a faltering Byzantium and has grown out to be a much larger project than originally expected. \n\nDiscover a new experience as a young, technologically and philosophically advanced nation in a New World, with all its wonders and perils. The new Nation of Elysia has great potential to grow and become a local superpower. A ton of events and decisions give allot of context and flavor to the nation and shapes its growth and feel. There's allot of events to discover, and depending on the choices you make your experience could change completely! \n\nWill you remain a loyal orthodox christian, or denounce the God that refused to help at times of great peril in favor of the old gods? Will you take along every possible artifact that may be of great boon, or will you take as much supplies and people as possible to avoid collapsing your economy and being overrun by natives? Consider your actions carefully, you can never know what future trouble may arise out of seemingly easy choices... \n\nPlanned content: \nMore flavor and interaction regarding the other Elysian nations that arise \nA new bookmark where Elysia is already formed \nA strong late game in flavor events and, more importantly, missions to get back in Europe \nYour suggestions?","torrent":{"xt":"urn:btih:88015ae7483b0bcace8ae47f8054d7d689a85593","amp;dn":"Third+Odyssey+-+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88015ae7483b0bcace8ae47f8054d7d689a85593","infoHashBuffer":{"type":"Buffer","data":[136,1,90,231,72,59,11,202,206,138,228,127,128,84,215,214,137,168,85,147]},"announce":[],"urlList":[]}}