{"title":"Old Fashioned 3.0 Total Conversion Modpack for Sim City 4","uid":8975468,"size":2118259152,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:886b27b144667749963b064a560f0bd9d7c42383&amp;dn=Old+Fashioned+3.0+Total+Conversion+Modpack+for+Sim+City+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hermarian","files":2,"time":1380421402,"description":"Old Fashioned 3.0 for Sim City 4\n-------- \n&quot;Give me your tired, your poor / Your huddled masses yearning to be free...&quot; of the farce that is EA's Sim City!\n--------\nDESCRIPTION:\nThis is a modpack for Sim City 4, compiled out of the thousands of mods found on Simtropolis and the SC4Lex.  It includes NAM, CAM, a basic SPAM package (not the custom demand stuff as it's incompatible with CAM,) custom terrain and trees, and custom buildings.  Mods have been curated to simulate the dense urban cores and farming hamlets common to Europe and New England; the architecture is not region-specific, but it's designed to propagate beautiful cities, rather than strip malls and parking lots.  Also included are many new parks, decorations, and government buildings to spruce up your cities.  In short: this pack contains just over 7000 individual files, and completely replaces all the original content.  It's a whole new game!\n-------- \nTECH STUFF:\nThis modpack is for windows and requires either the Rush Hour expansion or Deluxe addition.  Some things to note: due to the custom stuff in this pack, it is pretty sensitive.  All of its content is conflict-free, but the pack can be difficult to run on modern machines (as can the original game.)  Most things needed to run the game on modern systems can be found elsewhere online, written by people more knowlegeable and able than me.  That said, in addition I recommend finding and patching appsSimCity 4.exe so it can use 4gb of memory (it's a big pack.)  To use the included HD terrain mods, the game must also be run in hardware mode.  The pack does take a long time to load cities and to transition in and out of subway mode; don't be afraid, this is normal.\n-------- \nI hope this pack gives you many, many hours of fun!\n-------- \nTHANK-YOUS:\nTo the modding community - my deepest thanks.  I've spent many hours cobbling this together, but my time is infinitely small compared to the tens of thousands of hours you've spent painstakingly creating these mods in the first place.  You guys have a long-standing policy of hating people like me, and with good reason; but if possible, understand that my intent here is by no means malicious.  I make no money off this.  The goal of this pack is to allow people who lack the time commitment or technical expertise to access the mods you've worked so hard to create.  Beautiful buildings, crisp trees, myriad freeways and lush farmland: you've made things far more worthy of SimCity than anyone making video games has even come close to creating.  Once again, I thank you.","torrent":{"xt":"urn:btih:886b27b144667749963b064a560f0bd9d7c42383","amp;dn":"Old+Fashioned+3.0+Total+Conversion+Modpack+for+Sim+City+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"886b27b144667749963b064a560f0bd9d7c42383","infoHashBuffer":{"type":"Buffer","data":[136,107,39,177,68,102,119,73,150,59,6,74,86,15,11,217,215,196,35,131]},"announce":[],"urlList":[]}}