{"title":"Grateful Dead - The Grateful Dead (1967) 2013 HDTracks 24-96-FLA","uid":11143018,"size":814336710,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:886d6addaef1f10397b86ae4b9856fe7a89578d8&amp;dn=Grateful+Dead+-+The+Grateful+Dead+%281967%29+2013+HDTracks+24-96-FLA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hal4000","files":-1,"time":1412205673,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nThe Grateful Dead's eponymously titled debut long-player was issued in mid-March of 1967. This gave rise to one immediate impediment -- the difficulty in attempting to encapsulate/recreate the Dead's often improvised musical magic onto a single LP. Unfortunately, the sterile environs of the recording studio disregards the subtle and often not-so-subtle ebbs and zeniths that are so evident within a live experience. So, while this studio recording ultimately fails in accurately exhibiting The Grateful Dead's tremendous range, it's a valiant attempt to corral the group's hydra-headed psychedelic jug-band music on vinyl. Under the technical direction of Dave Hassinger -- who had produced the Rolling Stones as well as the Jefferson Airplane -- the Dead recorded the album in Los Angeles during a Ritalin-fuelled &quot;long weekend&quot; in early 1967. Rather than prepare all new material for the recording sessions, a vast majority of the disc is comprised of titles that the band had worked into their concurrent performance repertoire. This accounts for the unusually high ratio (seven:two) of folk and blues standards to original compositions. The entire group took credit for the slightly saccharine &quot;Golden Road (To Unlimited Devotion),&quot; while Jerry Garcia (guitar/vocals) is credited for the noir garage-flavored raver &quot;Cream Puff War.&quot; Interestingly, both tracks were featured as the respective A- and B-sides of the only 45 rpm single derived from this album. The curious aggregate of cover tunes featured on the Dead's initial outing also demonstrates the band's wide-ranging musical roots and influences. These include Pigpen's greasy harp-fuelled take on Sonny Boy Williamson's &quot;Good Morning Little School Girl&quot; and the minstrel one-man-band folk of Jessie &quot;the Lone Cat&quot; Fuller's &quot;Beat It On Down the Line.&quot; The apocalyptic Cold War folk anthem &quot;Morning Dew&quot; (aka &quot;[Walk Me Out in The] Morning Dew&quot;) is likewise given a full-bodied electric workout as is the obscure jug-band stomper &quot;Viola Lee Blues.&quot; Fittingly, the Dead would continue to play well over half of these tracks in concert for the next 27 years. [Due to the time limitations inherent within the medium, the original release included severely edited performances of &quot;Good Morning Little School Girl,&quot; &quot;Sitting on Top of the World,&quot; &quot;Cream Puff War,&quot; &quot;Morning Dew,&quot; and &quot;New, New Minglewood Blues.&quot; These tracks were restored in 2001, when the Dead's Warner Brothers catalog was reassessed for the Golden Road (1965-1973) box set.]\n\nHDTracks-PCM-24Bit-96Khz.","torrent":{"xt":"urn:btih:886d6addaef1f10397b86ae4b9856fe7a89578d8","amp;dn":"Grateful+Dead+-+The+Grateful+Dead+%281967%29+2013+HDTracks+24-96-FLA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"886d6addaef1f10397b86ae4b9856fe7a89578d8","infoHashBuffer":{"type":"Buffer","data":[136,109,106,221,174,241,241,3,151,184,106,228,185,133,111,231,168,149,120,216]},"announce":[],"urlList":[]}}