{"title":"VA - Revolve Magazine Summer - 2010 [Psychedelic Trance]","uid":5623654,"size":113282942,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88aa1b1be0cbe69bfb7a9589dc536186f2b8a46e&amp;dn=VA+-+Revolve+Magazine+Summer+-+2010+%5BPsychedelic+Trance%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ClydeL","files":-1,"time":1276379802,"description":"VA - Revolve Magazine Summer\n\n\nGenre: Psychedelic Trance\nYear: 2010\nLabel: Revolve Records\nCatalog#: REVOLVECD11\nRelease Date: 12 Jun 2010\nAudio: MP3\nTracks: 10\nQuality: VBR 192-320 kbps\nPlaytime: 72:36\n\nTracklist:\n\n01. Techtonic With E-Jekt &amp; Paul Taylor - Just For Kicks [07:03]\n02. Hoodwink - Chemical Emotions [06:40]\n03. Jocid - Could Have's [07:11]\n04. Dirty Saffi - Fucking Wrong Little Fish [06:55]\n05. Beatnik - Oracle Machine [08:27]\n06. Tripy - The Force [07:04]\n07. Project Redux - Chinese Sunrise [06:17]\n08. Polaris - Robots [06:38]\n09. Protonica - Floating Point (Morning Mix) [08:20]\n10. Rick Pier O'Neil - Come Into My House Remix [08:01]\n\nPsychedelic night-time, morning sound, Goa, Progressive, it's an encapsulating compilation of most styles of our scene, something to listen to as you relax into a different sort of headspace at home or on the dancefloor. DJ Photon's take on things! Pushing London and the UK's pioneering sound, tripy yet still rocking are Hoodwink and Dirty Saffi; Jocid's inventive playfulness and more traditional psy style from Techtonic and friends; Beatnik's playful take on early morning sound leads to uplifting Goa from Tripy and Project Redux who contacted the magazine on Myspace. Polaris with his Acid House-influenced morning sound - note, this would have been hypnotic night-time music back in the day - Protonica with a progressive/psy morning beauty and Rick Pier O'Neil aka RPO with a slower deep progressive tune. Get the wavs for true quality for about 8, 8 including postage rather than shitty downloaded mp3s. If you've never got the magazine before, then try it and support underground independent press! This magazine examines the forces that try to control us and have influenced many parts of the system we live under. An article about the secret societies and their history; the role of the Illuminatists in bringing down Greece; and a piece by a leading light of the free man movement. It's also the 25th anniversary of the Battle of the Beanfield where our right to live a different life was attacked. Martina Hoffmann considers the significance of the Visionary art movement before a Hawaiian conference dedicated to the life of dimensional explorer Terrence McKenna.\n\nInterviews with various musicians: Merv from Eat Static, Chromatone, Kaya Project, Hoodwink, Beatnik and Kinesis. A look ahead to eight of this Summer's festivals, feature on Thailand's trance scene and 32 CD reviews.\n\nGive it a try you might just love it: )","torrent":{"xt":"urn:btih:88aa1b1be0cbe69bfb7a9589dc536186f2b8a46e","amp;dn":"VA+-+Revolve+Magazine+Summer+-+2010+%5BPsychedelic+Trance%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88aa1b1be0cbe69bfb7a9589dc536186f2b8a46e","infoHashBuffer":{"type":"Buffer","data":[136,170,27,27,224,203,230,155,251,122,149,137,220,83,97,134,242,184,164,110]},"announce":[],"urlList":[]}}