{"title":"Jorge Luis Borges - On Writing (1994)","uid":8470121,"size":10636648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:892f45327183b1db366d52f15724b3355ecee6c6&amp;dn=Jorge+Luis+Borges+-+On+Writing+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1368463723,"description":"Jorge Luis Borges - Borges on Writing (E. P. Dutton, 1973; rep. Ecco Press, 1994). Edited by Norman Thomas di Giovanni, Daniel Halpern, and Frank MacShane.\n\nISBN: 0880013680 | 173 pages | PDF\n\nIn 1971, Jorge Luis Borges was invited to preside over a series of seminars on his writing at Columbia University. This book is a record of those seminars, which took the form of informal discussions between Borges, Norman Thomas di Giovanni (his editor and translator), Frank MacShane (then head of the writing program at Columbia), and the students. Borges's prose, poetry, and translations are handled separately and the book is divided accordingly.\n\nThe prose seminar is based on a line-by-line discussion of one of Borges's most distinctive stories, &quot;The End of the Duel.&quot; Borges explains how he wrote the story, his use of local knowledge, and his characteristic method of relating violent events in a precise and ironic way. This close analysis of his methods produces some illuminating observations on the role of the writer and the function of literature.\n\nThe poetry section begins with some general remarks by Borges on the need for form and structure and moves into a revealing analysis of four of his poems. The final section, on translation, is an exciting discussion of how the art and culture of one country can be &quot;translated&quot; into the language of another.\n\nThis book is a tribute to the brilliant craftsmanship of one of South America's -- indeed, the world's -- most distinguished writers and provides valuable insight into his inspiration and his method.\n\n\n======================================================\n\n\nSee also the following works by Jorge Luis Borges:\n\nCollected Fictions (Penguin, 1999): http://thepiratebay.se/torrent/8467776/\n","torrent":{"xt":"urn:btih:892f45327183b1db366d52f15724b3355ecee6c6","amp;dn":"Jorge+Luis+Borges+-+On+Writing+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"892f45327183b1db366d52f15724b3355ecee6c6","infoHashBuffer":{"type":"Buffer","data":[137,47,69,50,113,131,177,219,54,109,82,241,87,36,179,53,94,206,230,198]},"announce":[],"urlList":[]}}