{"title":"The Art Farmer Quintet Blame It on My Youth (jazz)(flac)[rogercc","uid":6065765,"size":274368729,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89582caa414a0148bccdaf8d6b738a06a2d3f7fa&amp;dn=The+Art+Farmer+Quintet+Blame+It+on+My+Youth+%28jazz%29%28flac%29%5Brogercc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc1","files":8,"time":1293348212,"description":"THE ART FARMER QUINTET\nBLAME IT ON MY YOUTH\nAudio CD October 11, 1991 \nOriginal Release Date: September 21, 1988 \nLabel: Contemporary\nFormat:Flac\n\nThe son of a steelworker, Art Farmer worked as a musician from the mid-1940s onwards. Based in Los Angeles, he played in the bands of Benny Carter and Jay McShann among others.\nHe joined Lionel Hampton's orchestra around 1953, fellow trumpeters Clifford Brown and Quincy Jones were also with Hampton at the time), and having relocated to New York, later worked with Gigi Gryce, Horace Silver and Gerry Mulligan among others. From the middle of the decade he featured in recordings by leading arrangers of the day, including George Russell, Jones and Oliver Nelson. He also formed &quot;The Jazztet&quot; with the composer and tenor saxophonist Benny Golson; both men had independently come to the decision that the other should be a member of their group. &quot;The Jazztet&quot; did not gain sufficient club engagements to last beyond 1962, but it did assist the careers of pianist McCoy Tyner and trombonist Grachan Moncur III, and the group recorded several albums for Argo and Mercury Records. In the early 1960s Farmer established a trio with guitarist Jim Hall and bassist Steve Swallow. Later, with drummer Pete La Roca, they recorded the album Sing Me Softly of the Blues (1965) for the Atlantic label.\nFarmer then moved to Europe, ultimately based in Vienna, where he performed with The Kenny Clarke-Francy Boland Big Band. Farmer also recorded extensively as a leader throughout his later career. With Golson he revived 'The Jazztet' in the 1980s for a number of engagements, with the original trombonist Curtis Fuller returning to the group.\n\nTracklist:\n1. Blame It on My Youth \n2. Fairy Tale Countryside \n3. Smile of the Snake, The \n4. Third Avenue \n5. Summer Serenade \n6. Progress Report \n7. I'll Be Around\n\n\nPersonnel: Art Farmer (flugelhorn); Clifford Jordan (tenor, soprano saxophone, tenor saxophone); Jack Williams , James Williams (piano); Rufus Reid (acoustic bass); Victor Lewis (drums).","torrent":{"xt":"urn:btih:89582caa414a0148bccdaf8d6b738a06a2d3f7fa","amp;dn":"The+Art+Farmer+Quintet+Blame+It+on+My+Youth+%28jazz%29%28flac%29%5Brogercc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89582caa414a0148bccdaf8d6b738a06a2d3f7fa","infoHashBuffer":{"type":"Buffer","data":[137,88,44,170,65,74,1,72,188,205,175,141,107,115,138,6,162,211,247,250]},"announce":[],"urlList":[]}}