{"title":"Men of the North book 1","uid":9545574,"size":515220,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89ea7ed742625919a68637113d0c0b0ac0c83c6c&amp;dn=Men+of+the+North+book+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"theapemania","files":1,"time":1391126469,"description":"This is my first historical fiction book that I have written, I was inspired to write it from having played a Swedish Pen &amp; Paper RPG called Viking. I also wanted to learn more of how the Norse lived, which meant I needed to do read and learn about how people loved during the Viking age which was interesting.\n\nThe book itself follows a family of Norse that live on Ã–land, the year is 820 which is a handful of years after the start of the viking age (793). The book itself is the first in my historical fiction series called 'Men of the North', the first book is called The sons of Thorgrim. Right now I am writing on the second book in the series, its name will be 'the blood feud'.\n\nBeing the author of the book, I chose to upload these here in hopes of reaching a wider audience. This book has been published onas ebook (2.99$) or printed books (9.99$ + shipment). Its easy to find my books on Amazon, just search for their names or my author name (Mikael B Lind). Would you feel that this book is well written, feel free to buy either the ebook or the printed version. I also have other torrents up, links to them will be posted either in comments.\n\nWould also love any feedback, both in the form of reviews and comments. Regardless, I hope you all enjoy my books and that they are worth reading.\n\nMay the Emprah be with you\nMikael B Lind","torrent":{"xt":"urn:btih:89ea7ed742625919a68637113d0c0b0ac0c83c6c","amp;dn":"Men+of+the+North+book+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ea7ed742625919a68637113d0c0b0ac0c83c6c","infoHashBuffer":{"type":"Buffer","data":[137,234,126,215,66,98,89,25,166,134,55,17,61,12,11,10,192,200,60,108]},"announce":[],"urlList":[]}}