{"title":"Bela Fleck - Jingle All the Way","uid":6063716,"size":388039572,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8a34182616b62cb3ab29b1252697ad9f35d42026&amp;dn=Bela+Fleck+-+Jingle+All+the+Way&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1293239209,"description":" &lt;a href=&quot;http://ecx.images-amazon.com/images/I/51gFvY3XnwL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://ecx.images-amazon.com/images/I/51gFvY3XnwL._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Jingle All the Way\nArtist: Bela Fleck\nAudio CD (September 30, 2008)\nOriginal Release Date: 2008\nNumber of Discs: 1\nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Jingle Bells\n02. Silent Night\n03. Sleigh Ride\n04. The Christmas Song\n05. Twelve Days of Christmas\n06. J.S. Bach's Christmas Oratorio - BVW 248 #41\n07. Christmas Time Is Here\n08. Linus and Lucy\n09. Jingle Bells (reprise)\n10. The Hanukkah Waltz\n11. Danse of the Sugar Plum Fairies\n12. What Child Is This/Dyngyldai\n13. O Come All Ye Faithful\n14. Medley: We Wish You a Merry Christmas/It's Beginning to Look a Lot Like Christmas\n15. Have Yourself a Merry Little Christmas\n16. River \n\n\nAmazon Description:\nBÃƒÆ’Ã‚Â©la Fleck, often considered the premiere banjo player in the world, has made a name for himself as a virtuoso instrumentalist unbounded by genre. His band The Flecktones - Victor Wooten on electric bass, Jeff Coffin on sax and flute, and Future Man on percussion - are equally talented and adventurous as Fleck himself, and together they have made a string of critically acclaimed albums that combine bluegrass, jazz, funk and world music with technical prowess, unlimited imagination and occasional zaniness. Their new holiday CD Jingle All the Way is all of that, with bells on - Christmas music as it's never been heard it before, with unique tonal textures (banjo, Tuvan throat singing, klezmer mandolin), hot solos and tight ensemble arrangements that make every measure new. Jingle All the Way is the perfect stocking stuffer for those who like their Christmas music fun and challenging at the same time.\n\nAllmusic Review:\nGrammy-winning banjo &quot;fusionist&quot; BÃƒÆ’Ã‚Â©la Fleck and his Flecktones may be the most qualified collective to inject some life into the notoriously monotonous &quot;holiday music&quot; scene, and Jingle All the Way (one would think that an innovator like Fleck could come up with a more creative &quot;Christmas&quot; album title, or at least one that doesn't directly reference a 1996 Arnold Schwarzenegger comedy), doesn't disappoint. All of the standards are here (&quot;Sleigh Ride,&quot; &quot;Silent Night,&quot; &quot;Twelve Days of Christmas&quot;), but they're filtered through the skewed prism of an outfit capable of just about anything from klezmer, to classical to Tuvan throat singing -- the latter is provided by the internationally acclaimed Alash Ensemble. It's not all wacky though, as Fleck, Victor Wooten, Jeff Coffin, and Future Man prove reverent when needed, especially on a cover of Joni Mitchell's &quot;River&quot; and the Vince Guaraldi classics &quot;Linus and Lucy&quot; and &quot;Christmas Time Is Here.&quot; Jingle All the Way, despite its groaner of a title and questionable &quot;frontman in Santa hat with eggnog&quot; photo, is anything but predictable.\n\n","torrent":{"xt":"urn:btih:8a34182616b62cb3ab29b1252697ad9f35d42026","amp;dn":"Bela+Fleck+-+Jingle+All+the+Way","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a34182616b62cb3ab29b1252697ad9f35d42026","infoHashBuffer":{"type":"Buffer","data":[138,52,24,38,22,182,44,179,171,41,177,37,38,151,173,159,53,212,32,38]},"announce":[],"urlList":[]}}