{"title":"Watch Me Cuck","uid":15109990,"size":198016093,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:8ab387ad8dcdc546cffbc0df9facd42971a60cd7&amp;dn=Watch+Me+Cuck+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hunter534","files":1,"time":1466996555,"description":"Cuckolding Queen Sally D'Angelo has done it again! Finding the pool boy hard at work, she latches onto the opportunity not only to engage in her lust for fucking strange cock, she uses the pool boy to cuckold her husband by making him watch from the closet. Watching slut wife Sally descend on the unsuspecting pool boy like a tidal wave of sexual lust erupting out of his pool makes one realize that this sultry and slutty sex goddess can seduce anyone she wants to. Walking out to her target in a steamy fish net body stocking and stiletto heels, he never stood a chance! Sally quickly has him in the bedroom standing and holding her in mid-air and in clear view of her secretly watching husband Bill. Held up by her lover, she's like a leach with her arms and legs tightly gripping him and riding his cock, he seems almost helpless in her wicked clutches as she uses him for her own screaming pleasure! Now in a sexual frenzy, she throws him onto the bed where her whore attack in a 69 drives him into a furious need to fuck her...NOW! Pounding her tight cunt, her legs up high and holding him tightly within her stiletto clad foot's grip, her pussy is electric and milks her victim into an almost involuntary orgasm, he just couldn't hold it back as she grips him with arms and legs and howls for more cock...all the while thinking about her cuckold husband watching from the wings. As the hot cum oozes down her pussy she quickly sends the pool boy away as she pretends to hear hubby arriving home. Exiting from the closet, he's ordered by his hot wife cuckoldress to get busy licking up that dripping cum. Sally D'Angelo has once again gone over the top in a fury of power fucking you'll never forget or stop stroking to! Featuring fishnet body stockings, stiletto heels, cuckolding, hot wife, fucking and big tits, creampie, and cum dripping. Resistance to cumming is futile!\r\n\r\nGenre: Gonzo, Big Tits, MILF\r\nCast: Sally D'Angelo, Divine Retribution\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-57707af0e1775.html \r\n \nhttp://photo-up.info/img-57707af9a3ff2.html","torrent":{"xt":"urn:btih:8ab387ad8dcdc546cffbc0df9facd42971a60cd7","amp;dn":"Watch+Me+Cuck+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ab387ad8dcdc546cffbc0df9facd42971a60cd7","infoHashBuffer":{"type":"Buffer","data":[138,179,135,173,141,205,197,70,207,251,192,223,159,172,212,41,113,166,12,215]},"announce":[],"urlList":[]}}