{"title":"Mythic Role Playing collection with Creature Crafter","uid":8778597,"size":22802483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8afd56dcb1ab44e11ed4d0b4a5af5d16fa2d66b0&amp;dn=Mythic+Role+Playing+collection+with+Creature+Crafter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rewinged","files":1,"time":1375623900,"description":"This is the 3 books for the Mythic Role-Playing game engine by Tom Pigeon. I have also included the Creature Crafter book which is a great compliment to the Mythic Engine.\n\nThe following files are included in the zip...\nMythic - Dynamic Role-Playing.pdf\nMythic - Game Master Emulator.pdf\nMythic - Variations.pdf\nThe_Creature_Crafter.pdf\n\n\nMythic allows you to create any imaginable scenario, from a Star Wars themed epic to a murder mystery, and play it with your friends or alone. It emphasizes randomness of scenes so that even if you have a Game Master, he won't know what's coming up next. \n\nThe Dynamic Role-Playing pdf is an entire game system (like D&amp;D) which also includes the GME.\n\nThe Game Master Emulator (GME) pdf allows you to use the rules from other RPG systems (again, I'll use D&amp;D as an example) but without a Game Master, even allowing you to play solo if you wish!\n\nThe Mythic Variations pdf introduces ways to enhance a specific genre. For example you can choose 'Epic' to allow huge events to take place frequently, or Horror to include events that focus on scary encounters. The book also adds ways to customize the rules and create background stories for your characters, and much more!\n\nFinally, the Creature Crafter introduces an innovative way to craft random creatures on the spot! While it's not part of the Mythic series of books, I think it's a handy book to have.\n\n\n\nJust to save you guys some hassle, the Mythic Dynamic Role-Playing.pdf core book is not the 'revised edition', so I suggest reading through the GME book after to pick up on some revised rules and formulas. The biggest apparent change is from the events table. The non-revised table you only get one word to spark your imagination while the revised has 2 separate tables to help refine your ideas.\n\n\nI hope you guys enjoy, feel free to ask any questions and I'll try my best to answer promptly.","torrent":{"xt":"urn:btih:8afd56dcb1ab44e11ed4d0b4a5af5d16fa2d66b0","amp;dn":"Mythic+Role+Playing+collection+with+Creature+Crafter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8afd56dcb1ab44e11ed4d0b4a5af5d16fa2d66b0","infoHashBuffer":{"type":"Buffer","data":[138,253,86,220,177,171,68,225,30,212,208,180,165,175,93,22,250,45,102,176]},"announce":[],"urlList":[]}}