{"title":"Vietnam: The Killing Zone (2011) Retail DVDBox NL Subs EE-Rel.NL","uid":6764139,"size":19149787245,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8c76aa749bcd126c3a8bd5e05a716c4fc5890681&amp;dn=Vietnam%3A+The+Killing+Zone+%282011%29+Retail+DVDBox+NL+Subs+EE-Rel.NL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NLUPPER002","files":-1,"time":1319306753,"description":"Vietnam - The Killing Zone (2011) PAL Retail 6xDVDBox NL Subs EE-Rel.NL\n.\nRelease Okt 2011\nReleaseInfo:   &lt;a href=&quot; http://www.bol.com/nl/p/dvd/vietnam-het-slagveld-van/1002004011646842/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.bol.com/nl/p/dvd/vietnam-het-slagveld-van/1002004011646842/index.html&lt;/a&gt;\n.\n[IMG]http://img854.imageshack.us/img854/3858/vn2011.jpg[/IMG]\n.\ndescription\nAmerica's longest war (1959 - 1975), a contemporary who is better known because of the fact-based films (Platoon, Apocalypse Now, We Were Soldiers) and TV series (Tour of Duty) than on the facts.\nWhat was this war and what made ??him so cruel? It all becomes clear in VIETNAM: The Killing Zone.\n.\nBeschrijving\n.\nAmerika's langst durende oorlog (1959 ÃƒÂ» 1975), is er ÃƒÅ¡ÃƒÅ¡n die hedendaags beter bekend is vanwege de erop gebaseerde films (Platoon, Apocalypse Now, We Were Soldiers) en tv series (Tour of Duty) dan op de feiten.\nWaar ging deze oorlog om en wat maakte hem zo wreed? Het wordt allemaal duidelijk in VIETNAM: The Killing Zone.\n\nSPIONAGE EN SPIONEREN (DVD1)\nTijdens een van de moeilijkste en dodelijkste conflicten uit de geschiedenis was eenvoudige oorlogsvoering niet genoeg. De oorlog in Vietnam had geheime operaties nodig.\nDe Amerikanen maakten gebruik van tactieken als intimidatie, spionage en geheime razzia's vanuit zee om de vijand te overmeesteren. Volg de verhalen van deze\ngeheime missies die werden uitgevoerd door de CIA en speciale teams binnen het Amerikaanse leger.\n.\nVIETCONG (DVD2)\nHun naam bezorgt Vietnamveteranen nog altijd de rillingen. Zij waren de communistische guerrilla's die extreme vernietigingen voor hun rekening namen tijdens de oorlog in Vietnam.\nBerucht om hun hinderlagen en vooraf geplante bommen waren zij verantwoordelijk voor vele Amerikaanse slachtoffers.\nDe mannen van de Vietcong bewogen zich tussen de burgers en waren daarom erg moeilijk te identificeren en uit te schakelen.\nUiteindelijk moest Amerikadan ook zijn meerdere erkennen in de Vietnamese strijders die hiermee de weg vrij maakte voor de overwinning van het communisme in 1975.\n.\nACHTER DE LINIES (DVD3)\nDeze mannen vormden het belangrijkste geheime team van het Amerikaanse leger tijdens de oorlog in Vietnam. De Studies &amp; Observations Group (SOG) richtte zich met\nhun aanvallen op de meest sterke punten van de vijand op de beruchte Ho Chi Minh route.\nZo bevrijdde zij met hun acties op spectaculaire wijze gevangenen en stonden zij aan de start van de meedogenloze en genadeloze oorlog tegen de Vietcong.\n.\nHET TET-OFFENSIEF &amp; DE RAMP BIJ DIEN BIEN PHU (DVD4)\nHet Tet-offensief op 31 januari 1968 was een van de meest verwoestende dagen van de oorlog in Vietnam. Geheel onverwachts plaatsten de Vietcong en Noord-Vietnamese troepen aanvallen op bijna alle grote steden in Zuid-Vietnam.\nDe ramp bij Dien Bien Phu was een grote miscalculatie van de Fransen. Zij dachten zonder problemen hun basiskamp op te kunnen zetten in Dien Bien Phu. Binnen enkele weken werden zij echter belegerd en overmeesterd.\n.\nBLOEDBAD IN DE LUCHT (DVD5)\nDe bloedigste dag van de oorlog in Vietnam is zonder twijfel 20 mei 1972. De dag waarop de Amerikaanse luchtmacht werd losgelaten boven het Aziatische land.\nNiemand kon vermoeden wat de desastreuze gevolgen van deze actie zouden worden. Het was de Hel boven Hanoi. In de lucht boven Vietnam was een loterij op leven en dood gaande.\nMet behulp van levensechte reconstructies volgen we vanuit de cockpit van de Amerikaanse F-4 Phantoms de bloedige strijd met de beruchte MiG-21 uit Noord-Vietnam.\n.\nRIVIERKRIJGERS (DVD6)\nDe soldaten van de Patrol Boat River (PBR) waren Proud, Brave en Reliable. Oftewel trots, dapper en betrouwbaar. Deze Amerikaanse eliteteams op het water voerden dan ook alle mogelijke missies uit op de rivieren van Vietnam.\nStap in de boot en reis de rivieren af met de mannen van de PBRs. Hoor de verhalen van hen die een diepe en blijvende hechting houden met deze helden van de Vietnamese wateren. \n.\nInfo\n.\nSource: This is the Source\nRelease: DVD5, 6 disks, 270:00 min\nVideo: PAL Retail\nAudio: Eng DD2.0\nSubs Retail: Dutch\nMenu: Yes\n.\nEnjoy EE-Rel.NL\n","torrent":{"xt":"urn:btih:8c76aa749bcd126c3a8bd5e05a716c4fc5890681","amp;dn":"Vietnam%3A+The+Killing+Zone+%282011%29+Retail+DVDBox+NL+Subs+EE-Rel.NL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c76aa749bcd126c3a8bd5e05a716c4fc5890681","infoHashBuffer":{"type":"Buffer","data":[140,118,170,116,155,205,18,108,58,139,213,224,90,113,108,79,197,137,6,129]},"announce":[],"urlList":[]}}