{"title":"Azkend 2","uid":8648549,"size":52172116,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:8d37be69dd3c58a0c8148850a5649a3cd3afbe32&amp;dn=Azkend+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1373046078,"description":"Refer: hxxp://www.10tons.com/Game/azkend2.html\n\nRequirement: Mac OS X 10.7 and Crossover 12 or higher version.\nHow to Install: Run the archive file from finder.\n\nAzkend 2\n\n\nWhile traveling from Liverpool to New York your ship was pulled down into a massive maelstrom and you woke up in a place that may have never been gazed upon by the eyes of men. From now on your goal is to ascend from the bowels of the earth and return to civilization.\n\nDESCRIPTION\n\nEnjoy dozens of exciting levels with variable gameplay in the story mode. The Jules Vernesque story of your journey will be told with gorgeous animated full screen cut scenes and professional voice overs. You'll experience awe and wonder through all the eight fantastic scenes that change constantly as you move through them.\n\nAzkend 2 presents you several different and exciting level styles throughout the adventure. You can also earn almost 20 unique powerups and over a dozen achievements. Choose your powerups wisely for each level to hasten your journey.\n\nIn addition Azkend 2 has two challenge game modes called Time and Medals. The Time-challenge is a quick two minute bite-sized game where you'll try to gain as many points as possible and gain fame on the leaderboards. In the Medals-challenge you can replay all the levels from the story and try to gain a medal from each one.\n\nFEATURES\n\n    Eight unique hand drawn &amp; animated scenes\n    Three game modes including the adventure and two challenges\n    Over 60 levels in the story mode\n    Compete on the GC leaderboards in the Time-challenge\n    Challenge yourself and replay the levels in the Medals-challenge\n    Gain more than a dozen GC achievements\n    Professional voice overs in story scenes\n    Carefully polished puzzle gameplay\n    Cinematic soundtrack by Jonathan Geer\n\n\n","torrent":{"xt":"urn:btih:8d37be69dd3c58a0c8148850a5649a3cd3afbe32","amp;dn":"Azkend+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d37be69dd3c58a0c8148850a5649a3cd3afbe32","infoHashBuffer":{"type":"Buffer","data":[141,55,190,105,221,60,88,160,200,20,136,80,165,100,154,60,211,175,190,50]},"announce":[],"urlList":[]}}