{"title":"Stevie Wonder - Fulfillingness' First Finale (1974) 2011 SHM-SAC","uid":11094373,"size":1805218138,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d8d4139660cbaf3e6473663ba03e1e89139b8e5&amp;dn=Stevie+Wonder+-+Fulfillingness%27+First+Finale+%281974%29+2011+SHM-SAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1411571533,"description":"Stevland Hardaway Morris (born May 13, 1950, as Stevland Hardaway Judkins), known by his stage name Stevie Wonder, is an American musician, singer-songwriter, record producer, and multi-instrumentalist. A child prodigy, he has become one of the most creative and loved musical performers of the late 20th century. Wonder signed with Motown's Tamla label at the age of 11 and continues to perform and record for Motown as of the early 2010s. He has been blind since shortly after birth.\n\nAfter the righteous anger and occasional despair of the socially motivated Innervisions, Stevie Wonder returned with a relationship record: Fulfillingness' First Finale. The cover pictures his life as an enormous wheel, part of which he's looking ahead to and part of which he's already completed (the latter with accompanying images of Little Stevie, JFK and MLK, the Motor Town Revue bus, a child with balloons, his familiar Taurus logo, and multiple Grammy awards). The songs and arrangements are the warmest since Talking Book, and Stevie positively caresses his vocals on this set, encompassing the vagaries of love, from dreaming of it (&quot;Creepin'&quot;) to being bashful of it (&quot;Too Shy to Say&quot;) to knowing when it's over (&quot;It Ain't No Use&quot;). The two big singles are &quot;Boogie on Reggae Woman,&quot; with a deep electronic groove balancing organic congas and gospel piano, and &quot;You Haven't Done Nothin',&quot; an acidic dismissal of President Nixon and the Watergate controversy (he'd already written &quot;He's Misstra Know-It-All&quot; on the same topic). As before, Fulfillingness' First Finale is mostly the work of a single man; Stevie invited over just a bare few musicians, and most of those were background vocalists (though of the finest caliber: Minnie Riperton, Paul Anka, Deniece Williams, and the Jackson 5). Also as before, the appearances are perfectly chosen; &quot;Too Shy to Say&quot; can only benefit from the acoustic bass of Motown institution James Jamerson and the heavenly steel guitar of Sneaky Pete Kleinow, while the Jackson 5 provide some righteous amens to Stevie's preaching on &quot;You Haven't Done Nothin'.&quot; It's also very refreshing to hear more songs devoted to the many and varied stages of romance, among them &quot;It Ain't No Use,&quot; &quot;Too Shy to Say,&quot; &quot;Please Don't Go.&quot; The only element lacking here, in comparison to the rest of his string of brilliant early-'70s records, is a clear focus; Fulfillingness' First Finale is more a collection of excellent songs than an excellent album.\n\nDFF files extracted with Scarletbook\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the Japanese 2011 SHM-SACD.\n\nSHM-SACD-ISO-1Bit-2.8Mhz.","torrent":{"xt":"urn:btih:8d8d4139660cbaf3e6473663ba03e1e89139b8e5","amp;dn":"Stevie+Wonder+-+Fulfillingness%27+First+Finale+%281974%29+2011+SHM-SAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d8d4139660cbaf3e6473663ba03e1e89139b8e5","infoHashBuffer":{"type":"Buffer","data":[141,141,65,57,102,12,186,243,230,71,54,99,186,3,225,232,145,57,184,229]},"announce":[],"urlList":[]}}