{"title":"Nuovomondo (The Golden Door - 2006)(FR NL SUBS) TBS ","uid":6497124,"size":6600000878,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8e3d27c84f11f3ca6d6e0815c80e90f2b3392a5d&amp;dn=Nuovomondo+%28The+Golden+Door+-+2006%29%28FR+NL+SUBS%29+TBS+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Vlinder2","files":-1,"time":1309113147,"description":"Nuovomondo (The Golden Door - 2006) \t\n\n\n\nItaliÃƒÂ« / Frankrijk\nDrama\n120 minuten\n\nmet Charlotte Gainsbourg, Vincent Schiavelli en Vincenzo Amato\n\n\n\nLiefhebbers van een avondje film, vergeet niet dat er naast de grote \\\\\\&quot;Hollywoodreleases\\\\\\&quot; nog tig van \\\\\\&quot;andere\\\\\\&quot; (kwaliteits) films zijn, die te goed zijn om in de anonimiteit te verzwelgen.\n\n\nDeze prachtige film geregisseerd door Emanuele Crialese, ging in premiÃƒÂ¨re op het Film Festival van VenetiÃƒÂ«, De film won 6 Awards, waaronder voor Beste Film, van de 7 nominaties.\n\nSamenvatting:\nDe arme Siciliaanse familie Mancuso verlaat in het begin van de 20ste eeuw Agrigento om naar de Verenigde Staten te emigreren in de hoop op een beter bestaan. Salvatore en zijn familie ontmoeten een nieuwe wereld, die erg verschillend is dan diegene die ze zich hadden ingebeeld.\n\nRecensie:\nRegisseur Emanuele Crialese is zelf ook een emigrant. Hij verliet SiciliÃƒÂ« om in de VS te studeren. Zijn vaderland is een terugkerend element in Crialese\\\\\\'s films. In zijn eerste speelfilm Once We Were Strangers is de hoofdpersoon Antonio een Siciliaan die illegaal in New York verblijft. In Respiro draait het om de vissersvrouw Grazia die op het Italiaanse eiland Lamepdusa woont. Voor Nuovomondo dook Crialese de geschiedenisboeken in om achter de ervaringen te komen van de eerste Italiaanse emigranten in Amerika. Hierbij stuitte hij op een fascinerende quote: \\\\\\&quot;We zijn allemaal zielen die onderweg zijn naar een paradijs waar we, als het geluk ons toe laat, mogen blijven, maar toch sterven we een beetje bij elke golf die we voorbij varen.\\\\\\&quot;\n\nVerhaal:\nBegin 20e eeuw. Salvatore Mancuso heeft genoeg van het miserabele en armoedige bestaan op SiciliÃƒÂ«. Foto\\\\\\'s van enorm vee en geld dat aan bomen groeit, trekken hem naar de Nieuwe Wereld: Amerika. Salvatore verkoopt zijn huis, zijn land en zijn vee, om zijn kinderen en bejaarde moeder mee te nemen naar het beloofde land. Op de lange reis ontmoeten ze een mysterieuze Engelse vrouw, waarover Salvatore zich ontfermt. Ondertussen nemen de mooie verhalen over het beloofde land onder de reizigers steeds groteskere vormen aan. Maar bij aankomst blijkt de Nieuwe Wereld een stuk minder rooskleurig dan Salvatore en zijn familie is voorgehouden.\n\n\nEnglish\n\n\nStoryline\n\nThe story is set at the beginning of the 20th century in Sicily. Salvatore, a very poor farmer, and a widower, decides to emigrate to the US with all his family, including his old mother. Before they embark, they meet Lucy. She is supposed to be a British lady and wants to come back to the States. Lucy, or Luce as Salvatore calls her, for unknown reasons wants to marry someone before to arrive to Ellis Island in New York. Salvatore accepts the proposal. Once they arrive in Ellis Island they spend the quarantine period trying to pass the examinations to be admitted to the States. Tests are not so simple for poor farmers coming from Sicily. Their destiny is in the hands of the custom officers.\n \nInfo:\nBron........: Retail PAl\nTaal........: Italiaans, French\nAudio.......: DD 5.1\nOndertitels.: Nederlands French\nMenu........: Yes\nExtra.......: YEs\nGerne.......: Drama\n\nMet dank en alle eer voor de originele poster\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/39124&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/39124&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0465188/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0465188/&lt;/a&gt;\n\nTBS","torrent":{"xt":"urn:btih:8e3d27c84f11f3ca6d6e0815c80e90f2b3392a5d","amp;dn":"Nuovomondo+%28The+Golden+Door+-+2006%29%28FR+NL+SUBS%29+TBS+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e3d27c84f11f3ca6d6e0815c80e90f2b3392a5d","infoHashBuffer":{"type":"Buffer","data":[142,61,39,200,79,17,243,202,109,110,8,21,200,14,144,242,179,57,42,93]},"announce":[],"urlList":[]}}