{"title":"Jonas Brothers - Tonight","uid":4737642,"size":125255684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8e8cdedd1b8d97819dcdab813754ee4f1ffbe179&amp;dn=Jonas+Brothers+-+Tonight&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1235410444,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Tonight&quot; is the third single by the American pop rock band Jonas Brothers from their third studio album, A Little Bit Longer. Fueled by digital downloads, the song debuted at #8 on the Billboard Hot 100 songs chart on August 7, 2008.\n\nThe song's official single release was confirmed the 36th Annual American Music Awards. They also performed the song later that night during the show. They have confirmed that filming for the music video is complete and it will be sent to mainstream radio in early January. The song was released on January 4, 2009 and the music video was released on January 19, 2009.\n\nThe music video for &quot;Tonight,&quot; was directed by Bruce Hendricks, director of Walt Disney Studios' upcoming Jonas Brothers: The 3D Concert Experience. It contains scenes from the 3D movie, including concert and backstage footage along with interaction with fans.\n\n&quot;Tonight&quot; was released on July 29, 2008 on the iTunes music store and soon reached #1 on the iTunes Top Songs chart. It was the third song from A Little Bit Longer that reached #1 on that chart.\n\nWith over 131,000 downloads in its initial week of release, &quot;Tonight&quot; was the highest debuting song on the Billboard Hot 100 in the issue dated August 16, 2008, coming in at number 8, without an official single release. The Jonas Brothers became the first act to have two songs debut in the top ten on the chart in the same calendar year since Madonna achieved the feat in 1998. The following week, &quot;Tonight&quot; fell to number 74. It premiered during the Kid's Inaugural on Disney Channel on January 19, 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8e8cdedd1b8d97819dcdab813754ee4f1ffbe179","amp;dn":"Jonas+Brothers+-+Tonight","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e8cdedd1b8d97819dcdab813754ee4f1ffbe179","infoHashBuffer":{"type":"Buffer","data":[142,140,222,221,27,141,151,129,157,205,171,129,55,84,238,79,31,251,225,121]},"announce":[],"urlList":[]}}