{"title":"Strokes of Genius (ePUB,Retail){32Skulls}","uid":11095652,"size":18025711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8ec51951f903152454ad088089443991c7b2919a&amp;dn=Strokes+of+Genius+%28ePUB%2CRetail%29%7B32Skulls%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"32Skulls","files":-1,"time":1411591230,"description":"                      â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ â˜ \n\n\nAwe-inspiring works by contemporary masters, along with the secrets behind its creation.\nDrawing is the most intimate and immediate form of self-expression, fundamental to every artist's ability to communicate with a viewer. The sense of energy and expression that can be captured in mere strokes of charcoal, ink, pastel, marker or any of the other modest mediums proudly represented in this book is astounding.\n\nA glowing celebration of the art of drawing, Strokes of Genius features styles ranging from meticulous realism to imaginative flights of fancy, from lyrical sketches created in minutes to intricately layered renderings that took months to complete.\n\nIncludes:\n169 stand-out examples of the finest drawing being done today, selected from hundreds of submissions from around the world.\nAn impressive range of styles, materials and techniques covering a wide array of subjects, including still life, the figure, animals, landscapes, portraits and more.\nComments from the artists offer firsthand insight on the creation of each artwork, diverse perspectives on drawing, and fresh ideas and techniques.\nAn incomparable source of inspiration and delight for artists and art lovers, Strokes of Genius contains hundreds of combined years of expertise, artistic breakthroughs and, above all, remarkable drawings that leave a lasting impression.\n\n\nBy Rachel Rubin Wolf\nPublished by North Light Books in 2007\nEPUB, Retail, 74 pages, English","torrent":{"xt":"urn:btih:8ec51951f903152454ad088089443991c7b2919a","amp;dn":"Strokes+of+Genius+%28ePUB%2CRetail%29%7B32Skulls%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ec51951f903152454ad088089443991c7b2919a","infoHashBuffer":{"type":"Buffer","data":[142,197,25,81,249,3,21,36,84,173,8,128,137,68,57,145,199,178,145,154]},"announce":[],"urlList":[]}}