{"title":"GoodSync, Enterprise, 9.4.1.5, x64, Portable","uid":7992169,"size":16958360,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8f0b0f344f1c23937092cace4f69b60538c3d999&amp;dn=GoodSync%2C+Enterprise%2C+9.4.1.5%2C+x64%2C+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1357466190,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a portable version a better version.\n\nGoodSync is an easy and reliable file backup and file synchronization software. It automatically analyzes, synchronizes, and backs up your emails, precious family photos, contacts, MP3s, financial documents, and other important files locally - between desktops, laptops, servers, external drives, and Windows Mobile devices, as well as remotely through FTP, SFTP, WebDAV, and more. GoodSync file synchronization software combines bulletproof reliability with an extremely easy to use interface to compare, synchronize, and backup your emails, contacts, photos, iTunes, MP3s, and other important files. Automatically synchronize and back up your important files between desktops, laptops, servers, and external drives over a network or the Internet. Using an innovative synchronization algorithm - GoodSync file sync software is years ahead of the pack when it comes to file synchronization.\n\nChanges in GoodSync 9.3.4.5:\n- Server: allow several Admins per computer, one per Admin Windows user. \n- Server: Global Discovery: rewrite to speed up locating server on transitions. \n- Server: UPNP: fix handling ActionTEC (Verizon FIOS) routers, they misreport mappings. \n- Server: Re-introduce Unique Server ID, to detect that server has been replaced. \n- Fix GoodSync was not properly stopping jobs when computer goes to Sleep. \n- Fix On Logoff jobs do not always start properly and may case a freeze. \n- On File Change: delete visual tree on the 'rebound' Analyze after Sync. \n- Browse dialog: redo implementation of drill down to file system, to speed it up. \n- WebDAV: by default use temp files on upload, assuming that MOVE verb does work. \n- S3 and Azure: fix MoveFolder implementation, was not working well in Explorer. \n- Azure: fix non-existent folder is listed as present in Browse dialog. \n- Show separate log message for two-sided filters, to show how many items they excluded. \n- Explorer: make multi-select drag-and-drop work correctly. \n- Explorer: when assembling Pasted items, do resolve ~UserName/folder paths. \n- Browse dialog: fix focus problems that cause auto-select of bookmark.\n\nHome Page: www.goodsync.com","torrent":{"xt":"urn:btih:8f0b0f344f1c23937092cace4f69b60538c3d999","amp;dn":"GoodSync%2C+Enterprise%2C+9.4.1.5%2C+x64%2C+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f0b0f344f1c23937092cace4f69b60538c3d999","infoHashBuffer":{"type":"Buffer","data":[143,11,15,52,79,28,35,147,112,146,202,206,79,105,182,5,56,195,217,153]},"announce":[],"urlList":[]}}