{"title":"Cordwainer Smith - 1993 - The Rediscovery of Man","uid":11474536,"size":472770902,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8f930e8e63a7c4e03fab5cd64311f143674c1696&amp;dn=Cordwainer+Smith+-+1993+-+The+Rediscovery+of+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Cybotage","files":1,"time":1416130967,"description":"Welcome to the strangest, most distinctive future ever imagined by a science fiction writer. An insterstellar empire ruled by the mysterious Lords of the Instrumentality, whose access to the drug stroon from the planet Norstrilia confers on them virtual immortality. A world in which wealthy and leisured humanity is served by the underpeople, genetically engineered animals turned into the semblance of people. A world in which the great ships which sail between the stars are eventually supplanted by the mysterious, instantaneous technique of planoforming. A world of wonder and myth, and extraordinary imagination.\n\nMost of the stories take place in Smith's future history set in the universe of the Instrumentality of Mankind; the collection is arranged in the chronological order in which the stories take place in the fictional timeline. The collection also contains short stories which do not take place in this universe.\n\nWithin the context of the future history, the Rediscovery of Mankind refers to the Instrumentality's re-introduction of chance and unhappiness into the sterile utopia that they had created for humanity. Other than Smith's novel, Norstrilia, which takes place in the same future history, the book collects all of Smith's known science fiction writing.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Rediscovery_of_Man&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Rediscovery_of_Man&lt;/a&gt;","torrent":{"xt":"urn:btih:8f930e8e63a7c4e03fab5cd64311f143674c1696","amp;dn":"Cordwainer+Smith+-+1993+-+The+Rediscovery+of+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f930e8e63a7c4e03fab5cd64311f143674c1696","infoHashBuffer":{"type":"Buffer","data":[143,147,14,142,99,167,196,224,63,171,92,214,67,17,241,67,103,76,22,150]},"announce":[],"urlList":[]}}