{"title":"Jesse Jane: Image (Digital Playground)","uid":7063145,"size":3397994995,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8f982f2ce30a20234c8ecf596a2374312b1a66e6&amp;dn=Jesse+Jane%3A+Image+%28Digital+Playground%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chkm8te","files":1,"time":1330421842,"description":"Screens: &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=oz6wp5n442vup237iexj.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=oz6wp5n442vup237iexj.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=qth0nwf9tmoloqc0g6mo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=qth0nwf9tmoloqc0g6mo.jpg&lt;/a&gt;\n\n\nJesse Jane, Alektra Blue, Rick Patrick, Marco Banderas, Isabella Dior, Daisy Marie, Scott Nails\n\nJesse Jane: Image explores the famous and undeniably sexy image of Digital Playground superstar, Jesse Jane. Her playful fantasies are fulfilled in 4 amazinly provocative scenes. Watch Rick give Jesse the fuck of her lifetime, as he watches her on the big screen, learning in real time that she is today's quintessential pornstar. Marco and Daisy escape a party in the wine cellar and as they look up to catch an image Jesse pleasing herself, magic is made. Then, Jesse and Alektra find themselves in an agressive romp, as they work on their self images in the gym. Beautiful Isabella Dior dreams she is Jesse Jane while boyfriend Scott nails pummels her in front of the mirror. When Scott find Jesse Jane: Image explores the famous and undeniably sexy image of Digital Playground superstar, Jesse Jane. Her playful fantasies are fulfilled in 4 amazinly provocative scenes. Watch Rick give Jesse the fuck of her lifetime, as he watches her on the big screen, learning in real time that she is today's quintessential pornstar. Marco and Daisy escape a party in the wine cellar and as they look up to catch an image Jesse pleasing herself, magic is made. Then, Jesse and Alektra find themselves in an agressive romp, as they work on their self images in the gym. Beautiful Isabella Dior dreams she is Jesse Jane while boyfriend Scott nails pummels her in front of the mirror. When Scott finds an excuse to skip work it's because Jesse is literally fed up in his work tie. As he unravels the knots, Jesse takes over. Jesse Jane: Image offers a plethora of superfine, amazingly erotic footage, all showcasing the lovely and unforgettable Jesse Jane.","torrent":{"xt":"urn:btih:8f982f2ce30a20234c8ecf596a2374312b1a66e6","amp;dn":"Jesse+Jane%3A+Image+%28Digital+Playground%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f982f2ce30a20234c8ecf596a2374312b1a66e6","infoHashBuffer":{"type":"Buffer","data":[143,152,47,44,227,10,32,35,76,142,207,89,106,35,116,49,43,26,102,230]},"announce":[],"urlList":[]}}