{"title":"Worst.Person.Ever - Douglas Coupland","uid":9317229,"size":2111981,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fcbd5947427408d2b01879941b7ce348d10484a&amp;dn=Worst.Person.Ever+-+Douglas+Coupland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sameer_were","files":1,"time":1386486357,"description":"A razor-sharp portrait of a morally bankrupt and gleefully wicked modern man, Worst. Person. Ever. is Douglas Coupland's gloriously filthy, side-splittingly funny and unforgettable novel.\n\n\n\n\nMeet Raymond Gunt. A decent chap who tries to do the right thing. Or, to put it another way, the worst person ever: a foul-mouthed, misanthropic cameraman, trailing creditors, ex-wives and unhappy homeless people in his wake. Men dislike him, women flee from him.\n\n\n\n\nWorst. Person. Ever. is a deeply unworthy book about a dreadful human being with absolutely no redeeming social value. Gunt, in the words of the author, &quot;is a living, walking, talking, hot steaming pile of pure id.&quot; He's a B-unit cameraman who enters an amusing downward failure spiral that takes him from London to Los Angeles and then on to an obscure island in the Pacific where a major American TV network is shooting a Survivor-style reality show. Along the way, Gunt suffers multiple comas and unjust imprisonment, is forced to re-enact the 'Angry Dance' from the movie Billy Elliot and finds himself at the centre of a nuclear war. We also meet Raymond's upwardly failing sidekick, Neal, as well as Raymond's ex-wife, Fiona, herself 'an atomic bomb of pain'.\n\n\n\n\nEven though he really puts the 'anti' in anti-hero, you may find Raymond Gunt an oddly likeable character.","torrent":{"xt":"urn:btih:8fcbd5947427408d2b01879941b7ce348d10484a","amp;dn":"Worst.Person.Ever+-+Douglas+Coupland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fcbd5947427408d2b01879941b7ce348d10484a","infoHashBuffer":{"type":"Buffer","data":[143,203,213,148,116,39,64,141,43,1,135,153,65,183,206,52,141,16,72,74]},"announce":[],"urlList":[]}}