{"title":"Game World by C. J. Farley","uid":9666410,"size":5342830,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fd70a7f8d5dbada4112876bceab1bbceafd9b21&amp;dn=Game+World+by+C.+J.+Farley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":1,"time":1393381382,"description":"\nGame World: A Fantasy Adventure in a Video Game Turned Reality by C. J. Farley\n\nDylan Rudee's life is an epic fail. He's bullied at school and the aunt who has raised him since he was orphaned as a child just lost her job and their apartment. Dylan's one chance to help his family is the only thing he's good at: video games. The multibillion-dollar company Mee Corp. has announced a televised tournament to find the Game-Changers: the forty-four kids who are the best in the world at playing Xamaica, a role-playing fantasy game that's sweeping the planet. If Dylan can win the top prize, he just might be able to change his life.\n\nIt turns out that Dylan is the greatest gamer anyone has ever seen, and his skills unlock a real-life fantasy world inside the game. Now actual monsters are trying to kill him, and he is swept up into an adventure along with his too-tall genius sister Emma, his hacker best friend Eli, and Ines Mee, the privileged daughter of Mee Corp.'s mysterious CEO and chief inventor. Along the way they encounter Nestuh, a giant spider who can spin a story but not a web; Baron Zonip, a hummingbird king who rules a wildly wealthy treetop kingdom; and an enchantress named Nanni who, with her shadow army, may be bent on conquering Xamaica and stealing its magic.\n\nIn order to save his sister and his friends, Dylan must solve a dangerous mystery in three days and uncover secrets about Xamaica, his family, and himself. But will he discover his hidden powers before two worlds - Xamaica and Earth - are completely destroyed?\n\nGenre: Teen Fiction | Fantasy","torrent":{"xt":"urn:btih:8fd70a7f8d5dbada4112876bceab1bbceafd9b21","amp;dn":"Game+World+by+C.+J.+Farley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fd70a7f8d5dbada4112876bceab1bbceafd9b21","infoHashBuffer":{"type":"Buffer","data":[143,215,10,127,141,93,186,218,65,18,135,107,206,171,27,188,234,253,155,33]},"announce":[],"urlList":[]}}