{"title":"Product Info Tools for FreeCycle, Craigslist, Kijiji, Backpage","uid":4362342,"size":662033,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:90467ebf0036aef6d09a34dc17ce58c01a573d0e&amp;dn=Product+Info+Tools+for+FreeCycle%2C+Craigslist%2C+Kijiji%2C+Backpage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ProductInfoToolbar","files":1,"time":1219719201,"description":"[b]Do You Want Pictures, Prices, User Reviews, and Product Locations Instantly?[/b]\n\nAs a frequent user of Internet Classified websites and other ecommerce websites, I would frequently become frustrated by the lack of product information and the lack of quality pictures provided for the items listed, especially on the Classified websites.\n\nI also didn&amp;#039;t like having to retype the same email responses over and over again to buyers and sellers.\n\nSo, being a programmer, I created the Product Info Toolbar.\n\n[b]The Product Info Toolbar Offers Quick and Easy One-Click Access to -[/b]\n\n[b]An Email Clipboard[/b] - saves multiple email replies and responses to your buyers and sellers. No retyping emails required, just copy and paste them quickly and easily.  Save up to six different email responses to your email clipboard.\n\n[b]Instant Access to Product Information[/b]\n\nWith the Product Info Toolbar every product name or model number on a webpage or in an email becomes a link to photos, product reviews, and  price comparisons. \n\nAddresses and city names instantly become links to map locations and directions. \n\nAll that you need to do is select the text and click the toolbar for instant access to the information that you desire.\n[b]\nPicture Search[/b] - Will conduct a Google image search, by default, for your selected product.  Just select the product name or model number in the listing and click the Find Pictures button.\n[b]\nUser Product Reviews[/b] - Will conduct a Google search, by default, for product reviews for your selected product.  Once again just select the product name or model number from the seller&amp;#039;s listing and click the Item Reviews button.\n\n[b]Product Price Comparison[/b] -  Will conduct a Google search, by default, for a pricing comparison for your selected item.  Just select the product name or model number and click the Check Prices button. \n\n[b]Mapping and Directions[/b] - Will conduct a Google map search, by default, for your selected address, city, or area location.  Once again, just select and click the Map Location button.\n\nGet Unbiased Product Information from the Sources that [b]YOU[/b] Select\n\nBy default, all product searches are done through Google.  But if you prefer another search engine or product info website, you can easily change the default search URLs in the Product Info Toolbar Settings to your own preferences.  YOU are in control of the source of information. ","torrent":{"xt":"urn:btih:90467ebf0036aef6d09a34dc17ce58c01a573d0e","amp;dn":"Product+Info+Tools+for+FreeCycle%2C+Craigslist%2C+Kijiji%2C+Backpage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90467ebf0036aef6d09a34dc17ce58c01a573d0e","infoHashBuffer":{"type":"Buffer","data":[144,70,126,191,0,54,174,246,208,154,52,220,23,206,88,192,26,87,61,14]},"announce":[],"urlList":[]}}