{"title":"Sinfest (Web Comic) - Complete through 2014 {WebComixFan}","uid":11977574,"size":406169778,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:90c8c92286b5d6f6fff2fccb13e89aca9574e6bc&amp;dn=Sinfest+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WebComixFan","files":20,"time":1433087141,"description":"&quot;SINFEST&quot; Web Comic\n\n&quot;Sinfest&quot; (sinfest.net) by Tatsuya Ishida is a humorous Web comic dealing with human nature, with particular attention paid to human sexuality, gender roles, addiction and religion.  Less frequently, the strip will parody popular culture or indulge in political commentary.  There are some recurring types of strip, such as &quot;You Had to Be There,&quot; where the reader is not told what the characters are discussing, &quot;Japanese Calligraphy,&quot; where one of the characters transforms over four panels into a kanji ideograph, usually related to the strip in some way, &quot;Porn Script Readings,&quot; where characters read porn star dialogue in deadpan style, &quot;The Matriarchy,&quot; a humorous alternate universe which features the strip's male characters as leaders of a masculine resistance against a matriarchal regime, and &quot;Ninja Theatre,&quot; where the characters take on the roles of heroes and villains in a martial arts movie.  Though there was originally little in the way of overarching story or continuity in &quot;Sinfest,&quot; the central characters have undergone some development and several of them are having their backstories fleshed out at irregular intervals.  With the appearance of &quot;The Sisterhood&quot; in late 2011, story arcs have increasingly revolved around concepts of radical feminism, condemnation of patriarchal dominance, and a rejection of heterosexism.  Many former fans of the strip have complained about the change in focus, while other current fans have praised it and the author for reflecting an evolving conscience and outlook.  &quot;Sinfest&quot; first appeared online in January 2000, though the very first strip actually appeared in print in October 1991 in the UCLA newspaper, &quot;Daily Bruin,&quot; while Ishida was a student at the college.\n\nThis torrent collects &quot;Sinfest&quot; comics from the strip's online premiere in 2000 through the end of 2014 in a set of CBR files, one for each year","torrent":{"xt":"urn:btih:90c8c92286b5d6f6fff2fccb13e89aca9574e6bc","amp;dn":"Sinfest+%28Web+Comic%29+-+Complete+through+2014+%7BWebComixFan%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90c8c92286b5d6f6fff2fccb13e89aca9574e6bc","infoHashBuffer":{"type":"Buffer","data":[144,200,201,34,134,181,214,246,255,242,252,203,19,232,154,202,149,116,230,188]},"announce":[],"urlList":[]}}