{"title":"Defaced - Marissa Farrar","uid":14550124,"size":982837,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:913082d6df33c20fe3ab4dd438376104bf0764ec&amp;dn=Defaced+-+Marissa+Farrar&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1462641588,"description":"Defaced - Marissa Farrar\r\n \r\nMonster \r\nHidden away from society by his criminal father, there lives a man who has never entered the outside world. Now, having taken over his father’s business, he has all the money and power he could dream of, yet still he refuses to let himself be viewed by the rest of society.\r\n\r\nLily \r\nTraumatised by an event in her past, Lily Drayton has a phobia of being touched. Though she helps people externally with her skills as a laser therapist, she refuses to let anyone in, emotionally or physically. When Lily is kidnapped on the way home from work one evening, she discovers she’s not the only person who keeps themselves cut off from the rest of the world.\r\n\r\nDefaced \r\nA man owns her now—a man both dangerous and enigmatic. Drawn by his dual beauty and hidden pain, he awakens something inside her, something she believed was long dead. Brought to a room without windows, she’s given an impossible task: to make her owner acceptable to the outside world.\r\n\r\nCan altering his face change who he is as a man, or is he truly a monster, both inside and out?\r\n \r\nDenied - Merissa Farrar\r\n \r\nLily\r\n\r\nAfter Monster makes an impossible choice that throws her world into chaos, Lily finds herself back in America. Unable to allow what happened to her to go unpunished, and riddled with survivor’s guilt, Lily decides she needs to track down the traffickers who took her.\r\n\r\nMonster\r\n\r\nMonster has only ever wanted to keep his Flower safe, but, when he hears of her plans, he is forced to take control once more. Stepping out of his comfort zone, he vows to once more make her his captive.\r\n\r\nDenied\r\n\r\nExcept Lily doesn’t know the true reason for Monster making the choice that has led to her current situation, and her actions have made her the target of someone who wants a debt paid – a debt that must be paid in flesh","torrent":{"xt":"urn:btih:913082d6df33c20fe3ab4dd438376104bf0764ec","amp;dn":"Defaced+-+Marissa+Farrar","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"913082d6df33c20fe3ab4dd438376104bf0764ec","infoHashBuffer":{"type":"Buffer","data":[145,48,130,214,223,51,194,15,227,171,77,212,56,55,97,4,191,7,100,236]},"announce":[],"urlList":[]}}