{"title":"David Nutt - Expanding the mind, decoding the brain, lessening t","uid":8523625,"size":905741975,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:914d36a1c4bb9f93e352fd594e28f706d3590bd3&amp;dn=David+Nutt+-+Expanding+the+mind%2C+decoding+the+brain%2C+lessening+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LSM-775","files":1,"time":1369970277,"description":"There are quite a few drugs on the market that humans take for a variety of different purposes: alcohol, nicotine, hash, marijuana, LSD, MDMA, cocaine, heroin, ecstasy, etc... but what facts do we know about the effects of these substances in the human brain? How do scientists study these effects and what have they concluded about their positive/negative causes to human health?\n\nThis special event is about the scientific facts behind drugs and will be presented by David Nutt, one of the world's leading experts on neuropsychopharmacology based in London. Nutt will focus on the role of drugs in human life and report on the current knowledge on the nature of drugs and the brain mechanisms that underpin their actions. He will argue that the inconsistent ways in which society reacts to drugs has led to one of the most shameful episodes in modern science.\n\nEnding with results from his own recent research on the modes of action of psychedelic and related drugs such as MDMA, Nutt will explain how the understanding of their actions on the brain can give insights into the nature of consciousness and how these and other studies reveal remarkable potential for the development of new treatments for brain disorders.\n\nAfter a session of Q&amp;A, we are proud to present Lars Graugaard performing under the alias Lars from Mars. Graugaard is an electronic music composer with a strong academic background in interactive music. His works have a strong grounding in rhythms, combined with quite abstract sound-worlds. He uses several algorithm techniques and generative design. His music will keep you in another world for quite a long time.\n\n\nEntrance to the event is free. No registration is necessary. Doors open at 18:00. The audience is limited to a maximum of 250 people. Entrance will be based on a first-come, first-serve basis.\n\nOrganised in cooperation with the Niels Bohr Institute, University of Copenhagen.\n &lt;a href=&quot;\nhttp://het.nbi.dk/SC/2013/DrugEffects.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://het.nbi.dk/SC/2013/DrugEffects.html&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:914d36a1c4bb9f93e352fd594e28f706d3590bd3","amp;dn":"David+Nutt+-+Expanding+the+mind%2C+decoding+the+brain%2C+lessening+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"914d36a1c4bb9f93e352fd594e28f706d3590bd3","infoHashBuffer":{"type":"Buffer","data":[145,77,54,161,196,187,159,147,227,82,253,89,78,40,247,6,211,89,11,211]},"announce":[],"urlList":[]}}