{"title":"Radio Active - S01 to 07 - Audio Comedy - MP3 - Slimoo","uid":5735275,"size":1392857632,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:94634b1e93f8f54feac6ea655e3fec4a15093fa0&amp;dn=Radio+Active+-+S01+to+07+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":55,"time":1280787093,"description":"Radio Active - Audio Comedy - Series 01 to 07 - Audio Comedy - BBC7 via DVB-T\n54 x 30 Minute Episodes - 128Kbps - Mp3 - SnuffBox &amp; Slimoo\n\n\n\n\nThe show was based around an imaginary local radio station and the programmes that it might transmit. Characters on the show were mostly named after pieces of sound equipment, including rising star Mike Flex (Perkins), fading star Mike Channel (Deayton), &quot;children's favourite&quot; &quot;Uncle&quot; Mike Stand (Stevens) and the food-obsessed Anna Daptor (Atkinson-Wood). Also on the station's staff were the incomprehensible Nigel Pry (Pope), the incompetent Martin Brown (Stevens), the carefully enunciated &quot;oh-so-daring&quot; Mike Hunt (Pope), brusque owner Sir Norman Tonsil (Deayton), Norwegian correspondent Oivind Vinstra (Perkins), whose command of English was negligible, and Head of Religious Affairs the Right Reverend Reverend Wright (Deayton), who had a mail-order bride. Other regular characters were unsympathetic agony aunt Anna Rabies (Atkinson-Wood) and singing doctor Philip Percygo (Pope).\n\n\n\nOther parodic elements included over-the-top jingles presenting the station telephone number for phone ins and introducing the commercials which included an exchange between Mary and June and a slot for Honest Ron (&quot;the others are a con) (Stevens). The incompetent Radio Active Drama Repertory Company usually gave a performance, and episodes concluded with a handback designed to embarrass the following BBC continuity announcer.\n\n\n\nCast:\nAnna Dapter (Helen Atkinson-Wood) \nMike Channel (Angus Deayton) \nMike Flex (Geoffrey Perkins) \nMartin Brown (Michael Fenton-Stevens) \nMike Hunt (Philip Pope) \nNigel Pry (Philip Pope) \nOivind Vinstra (Geoffrey Perkins) \nSir Norman Tonsil (Angus Deayton) \nUncle Mike Stand (Michael Fenton-Stevens) \n\n\n\n\nRadio Active - S01 - E00 - The Oxford Review \nRadio Active - S01 - E01 - The Late Show With Mike Channel\nRadio Active - S01 - E02 - Bedrock - The Early Morning Breakfast Show With Mike Flex\nRadio Active - S01 - E03 - The Midday Show With Anna Daptor\nRadio Active - S01 - E04 - The Radio Active Roadshow\nRadio Active - S01 - E05 - What's News\nRadio Active - S01 - E06 - The Radio Active Awards\nRadio Active - S01 - E07 - The Hee Bee Gee Bees Story &lt;&lt; Thanks to HarrySpeakup\n\nRadio Active - S02 - E01 - The History Of Radio Active\nRadio Active - S02 - E02 - Charity Radiothon\nRadio Active - S02 - E03 - Good Day Sport\nRadio Active - S02 - E04 - What's Going On\nRadio Active - S02 - E05 - The Nigel Pry Show\nRadio Active - S02 - E06 - Pick Of The Week\n\nRadio Active - S03 - E01 - Euroshow\nRadio Active - S03 - E02 - Probe Round The Back \nRadio Active - S03 - E03 - Funday\nRadio Active - S03 - E04 - Repeat After Three\nRadio Active - S03 - E05 - Lunchtime With Anna\nRadio Active - S03 - E06 - What's Going On At The Edinburgh Festival\nRadio Active - S03 - E07 - Radio Active's Christmas Turkey\n\nRadio Active - S04 - E01 - Salute To New York\nRadio Active - S04 - E02 - The Martin Brown Show\nRadio Active - S04 - E03 - Round Your Parts\nRadio Active - S04 - E04 - The Breakfast Show\nRadio Active - S04 - E05 - Minority Programmes\nRadio Active - S04 - E06 - Bio Show\nRadio Active - S04 - E07 - Gigantaquiz\nRadio Active - S04 - E08 - Martin Chizzlenutt\n\nRadio Active - S05 - E01 - Wimbledon Special\nRadio Active - S05 - E02 - Nuclear Debate\nRadio Active - S05 - E03 - Out Of Your Depth\nRadio Active - S05 - E04 - In Australia\nRadio Active - S05 - E05 - Get Away With You\nRadio Active - S05 - E06 - Wey Hey, It's Saturday\nRadio Active - S05 - E07 - Musical Festival\nRadio Active - S05 - E08 - Did You Catch It\n\nRadio Active - S06 - E01 - The Thodding By-Election \nRadio Active - S06 - E02 - The Fit And Fat Show\nRadio Active - S06 - E03 - Radio Active's Bogey Awards\nRadio Active - S06 - E04 - The D Day Show \nRadio Active - S06 - E05 - Radio Active Goes To The Movies\nRadio Active - S06 - E06 - Stop That Crime UK\nRadio Active - S06 - E07 - In House Documentary\nRadio Active - S06 - E08 - Backchat\n\nRadio Active - S07 - E01 - It was 20 Years Ago Last Tuesday\nRadio Active - S07 - E02 - Radio Radio Programme \nRadio Active - S07 - E03 - God Alone Knows\nRadio Active - S07 - E04 - Probe Round the Back \nRadio Active - S07 - E05 - Mike Says - Here's A Bit Of Talent \nRadio Active - S07 - E06 - Flu Special\nRadio Active - S07 - E07 - You And Your Things \nRadio Active - S07 - E08 - Radio Active's Mega Phone-In\nRadio Active - S07 - E09 - Radio Active's Digital Turn-On\n\n\n\nAudio\nFormat : MPEG Audio\nFormat version : Version 1\nFormat profile : Layer 3\nDuration : 29mn 14s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n[","torrent":{"xt":"urn:btih:94634b1e93f8f54feac6ea655e3fec4a15093fa0","amp;dn":"Radio+Active+-+S01+to+07+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94634b1e93f8f54feac6ea655e3fec4a15093fa0","infoHashBuffer":{"type":"Buffer","data":[148,99,75,30,147,248,245,79,234,198,234,101,94,63,236,74,21,9,63,160]},"announce":[],"urlList":[]}}