{"title":"Liberty Meadows","uid":4804197,"size":497740596,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:949bbaa82b222aaf9b36c210c81a97c6d38a2e8b&amp;dn=Liberty+Meadows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1238147445,"description":"Liberty Meadows is a strip-style comic book about  the comedic activities of the staff and denizens of an animal sanctuary/rehabilitation clinic.  \n\nIt evolved out of UniversityÃ‚Â² (University Squared), a strip Cho wrote during his college years for The Diamondback, the student newspaper at the University of Maryland, College Park.\nOriginally, it was syndicated and appeared in many newspapers, while also being collected in comic books produced by Insight Studios. At the end of 2001, Cho ceased syndication, partly because editors kept censoring it, and announced he would publish it directly in comic book format.\nCho self-published the comic book at first, with Image Comics taking over printing and distribution with issue #27. The comic book went on a hiatus in early 2004, after issue #36.  June 2006 saw the publication of issue #37, and Cho commented that he would be &quot;trying to have couple of issues of Liberty Meadows out per year&quot;.\n\nTop ten reasons why you should read Liberty Meadows;\n\n1. Main character Brandy was inspired in part by Lynda Carter.\n2. There's a wiener dog named Oscar.\n3. PvP character guest appearances.\n4. There's a male chauvinist pig who's really a pig.\n5. Classic mushy love story that even men can appreciate.\n6. Really REALLY good art! Creator Frank Cho could draw ANYTHING and make it look amazing.\n7. Brandy is positively drool-inspiring for both her physical attributes and her personality.\n8. Easy story to get into without having to know 25 thousand years worth of comic book back-history.\n9. Funnyfunnyfunny!\n10. Liberty Meadows had a moment of silence after R.A. Salvatore's Star Wars novel Vector Prime killed Chewbacca.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:949bbaa82b222aaf9b36c210c81a97c6d38a2e8b","amp;dn":"Liberty+Meadows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"949bbaa82b222aaf9b36c210c81a97c6d38a2e8b","infoHashBuffer":{"type":"Buffer","data":[148,155,186,168,43,34,42,175,155,54,194,16,200,26,151,198,211,138,46,139]},"announce":[],"urlList":[]}}