{"title":"Frazer Smith 2014 Rose Parade","uid":9424741,"size":211767598,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:94f136982ff51b9673ce15968613984321d22fcb&amp;dn=Frazer+Smith+2014+Rose+Parade&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Schizoid1","files":1,"time":1388624265,"description":"Here is the entire audio from the show today. \n\nHopefully someone can upload the video from the KTLA 6am to 10am broadcast so the entire experience can be shared by all. \n\n\n\n\nFrazer Smith, also known as Frazier Smith, (born January 17, 1955) is an American radio personality, actor and stand-up comedian.\n\nBiography[edit]\n\nSmith was born in Detroit, Michigan. He worked in Los Angeles, California at KROQ-FM from 1976 through 1979, KLOS from 1979 through 1984, KMET 1984 through 1986, KLSX 1986 through 1997 KLOS in 1997 and KRTH in 2002. He has played small roles in movies and TV shows and was one of the announcers on the TBS music video show Night Tracks from 1986 to 1988 and 1989 to 1991.\n\nThe debut of his manic show on KROQ-FM coincided with that station's rise playing what was then-new New Wave music. His extended improvisational comedy based on a mythical lothario/detective was also heard on the sporadically-produced Hollywood Nightshift which featured Phil Austin of the Firesign Theatre, as well as movie, TV actor and radio DJ, Michael C. Gwynne who also ran the board and spun the records. There was never a script, contrary to popular reviews of the time. A 'topic' appeared spontaneously as the theme ran and Laura Quinn, the announcer got set to introduce 'the boys.'\n\nFor several years, Smith, along with Peter &quot;Crabman&quot; Crabbe, made an annual tradition of offering an alternate audio commentary to television coverage of the famous Tournament of Roses Parade. Listeners would be told to tune in to Los Angeles television station KTLA, which was hosted by Stephanie Edwards and Bob Eubanks. Smith would tell viewers to turn down the television volume and turn up the radio to hear the comedy parody, which included discussing news themes from the past year and applying them to the floats. For example, the year of the O.J. Simpson slow-speed car chase, one of the floats was described as a reenactment of the event. Smith and Crabbe would also describe the passing bands while playing continuous looped marching band music.","torrent":{"xt":"urn:btih:94f136982ff51b9673ce15968613984321d22fcb","amp;dn":"Frazer+Smith+2014+Rose+Parade","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94f136982ff51b9673ce15968613984321d22fcb","infoHashBuffer":{"type":"Buffer","data":[148,241,54,152,47,245,27,150,115,206,21,150,134,19,152,67,33,210,47,203]},"announce":[],"urlList":[]}}