{"title":"Prison Architect - Alpha 20 - Linux","uid":10065768,"size":117384016,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:952d04bed281e2c14549844f069f12c28fea12de&amp;dn=Prison+Architect+-+Alpha+20+-+Linux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sharpshot94549","files":-1,"time":1398791962,"description":"Prison Architect Alpha 20\n\nBuild and Manage A Maximum Security Prison. Prison Architect is the world's latest Prison Management Sim. Starting with an empty plot of land you must construct a holding cell with basic water and electricity to house your first batch of prisoners, to buy you enough time to create a proper cell block.\n\nPrison Architect 20 changelog follows:\n\n= Prisoner Grading\nAll prisoners have a new 'Grading' tab in their rap sheet, in which they are scored on four key metrics:\n\nPUNISHMENT To what extent has this prisoner been punished? Long jail terms and solitary increase this.\nREFORM How successful have your reform attempts been? Passing reform programs and working increases this.\nSECURITY Was the prisoner kept safely locked away? Fights and escapes detract from this, armed lockdown counts towards it.\nHEALTH A measure of the welfare of your prisoner. Keeping them well fed and exercised will increase this.\nThese factors are combined, together with their age, number of prior convictions etc, to produce an estimate of their Re-offending chance.\n\nThere is a new overall grading 'score' screen, available from the build toolbar.\nThe gradings for all your released prisoners are combined together and shown.\nThis screen shows what type of prison you have produced, and how successful you have been.\n= Failure conditions (!!! TURNED OFF FOR PRE-EXISTING PRISONS !!!)\nIt is now possible to fail when building your prison, in certain circumstances. This constitutes a game over event.\nAll failure conditions come with a verbal warning from the CEO, giving you chance to avert the failure.\nThere are currently four failure conditions:\nRIOT If you let a riot run for too long, the government will be forced to step in and take over your prison. In this event you will be sacked, and the National Guard will be deployed to retake your prison by force.\nBANKRUPTCY If you have a negative bank balance and a negative cashflow, you are bankrupt. You will have 24 hours to put in place a financial rescue package before being sacked.\nDEATHS Too many deaths in a single day will trigger a warning. If more deaths occur the next day you will be sacked. You will then be convicted of Criminal Negligence, and will spend time within your own jail as a prisoner.\nESCAPES Too many escapes in a single day is a PR disaster waiting to happen. If more escapes occur the next day you will be sacked.\nNOTE : Failure conditions are OFF for all pre-existing prisons. They will apply when you create a new prison.\nYou can manually turn them on by adding this line to your save file at the top:\nFailureConditions true\nOn screen counters will popup to notify you of deaths and escapes that occurred today\n- It is now much easier to find foreign language translations in the Steam Workshop.\nGo to the main menu / Extras / Mods / Find more translations.\nFixed: Many steam mods were incorrectly tagged as language translations.\n- Finance continued\nThe &quot;Days without incident&quot; bonus now scales based on how many prisoners you have. You now need 200 prisoners on site to achieve the maximum bonus increase of $1,000 per day. This scales up each day you achieve it, up to a maximum of $10,000 per day, requiring 200 prisoners without incident for 10 or more days. Good luck!\nYou can no longer trade in shares, or sell your prison, if there have been any deaths or escapes in the past 24 hours. This should put a stop to unconsionable players who helped prisoners escape or commit murder in order to profit from share trading!\nYesterday's exports are now reflected in your cashflow as income\n- New graphics added for body armour upgrades\nguards, armed guards and dog handlers.\n- Fixes\nFixed : Exports zone would not work correctly if placed above the Deliveries zone, or placed vertically aligned with the Deliveries or garbage zones\nFixed : Having negative cash reserves stopped hourly cashflow from happening\nFixed : Prisoner sentences counted down faster on larger maps, due to the time warp factor used\nFixed : In the &quot;New prison&quot; window, the &quot;Fog of war&quot; and &quot;Continuous intake&quot; tick boxes didn't work properly\nFixed : Particles and sun shadows are now correctly obscured by fog of war\n","torrent":{"xt":"urn:btih:952d04bed281e2c14549844f069f12c28fea12de","amp;dn":"Prison+Architect+-+Alpha+20+-+Linux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952d04bed281e2c14549844f069f12c28fea12de","infoHashBuffer":{"type":"Buffer","data":[149,45,4,190,210,129,226,193,69,73,132,79,6,159,18,194,143,234,18,222]},"announce":[],"urlList":[]}}