{"title":"[George Helffrich , James Wookey , Ian Bastow ]The Seismic Analy","uid":11231844,"size":6748422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9553de1e395f4f4329a1402cd8e8887c73ee0024&amp;dn=%5BGeorge+Helffrich+%2C+James+Wookey+%2C+Ian+Bastow+%5DThe+Seismic+Analy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413505398,"description":"The Seismic Analysis Code (SAC) is one of the most widely used analysis packages for regional and teleseismic seismic data. For the first time, this book provides users at introductory and advanced levels with a complete guide to SAC. It leads new users of SAC through the steps of learning basic commands, describes the SAC processing philosophy, and presents its macro language in full, supported throughout with example inputs and outputs from SAC. For more experienced practitioners, the book describes SAC's many hidden features, including advanced graphics aspects, its file structure, how to write independent programs to access and create files, and much more. Tutorial exercises engage users with newly acquired skills, providing data and code to implement the standard methods of teleseismic shear-wave splitting and receiver function analysis. Methodical and authoritative, this is a key resource for researchers and graduate students in global seismology, earthquake seismology and geophysics.\n\nProduct Description\nBook Description\nThis book provides introductory- and advanced-level users with the first complete guide to SAC, from basic viewing of seismic data, to advanced use of macros, graphics, and much more. Supported online with command examples, source-code and macros, for researchers and graduate students in global seismology, earthquake seismology and geophysics.\nAbout the Author\nGeorge Helffrich is a Professor of Seismology in the School of Earth Sciences at the University of Bristol. His research interests include using observational seismology to study features of the crust, mantle and core. Recently, he has based his analysis techniques on large-scale seismic array data, using SAC as the primary seismological data analysis tool. Before embarking on his research career, Professor Helffrich was a programmer who developed and supported mainframe operating systems. Bringing this experience to the seismological realm, he has contributed to the development of SAC for over twenty years.\n\nJames Wookey is a Research Fellow and Lecturer at the School of Earth Sciences at the University of Bristol. His research focuses on observational seismology, particularly seismic anisotropy, applied to problems from the inner core to oil reservoirs, with a recent focus on Earth's core-mantle boundary region. Dr Wookey has spent much of his research career developing and applying novel methods for analysing seismic data, and comparing them with predictions from mineral physics and geodynamics to better understand Earth processes. His experience with SAC spans fifteen years, including as contributor to its development.\n\nIan Bastow is Lecturer in Seismology in the Department of Earth Science and Engineering at Imperial College London. His research focuses primarily on the analysis of broadband seismological data from networks of temporary seismograph stations to better understand the Earth's crust and mantle. Dr Bastow has worked extensively on tectonic problems concerning the seismically and volcanically active East African rift system, as well as on the development of Laurentia, the Precambrian core of North America. He has been a user of SAC for over a decade. \n\nPublisher: Cambridge University Press (19 September 2013)\nLanguage: English\nISBN-10: 1107045452\nISBN-13: 978-1107045453","torrent":{"xt":"urn:btih:9553de1e395f4f4329a1402cd8e8887c73ee0024","amp;dn":"%5BGeorge+Helffrich+%2C+James+Wookey+%2C+Ian+Bastow+%5DThe+Seismic+Analy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9553de1e395f4f4329a1402cd8e8887c73ee0024","infoHashBuffer":{"type":"Buffer","data":[149,83,222,30,57,95,79,67,41,161,64,44,216,232,136,124,115,238,0,36]},"announce":[],"urlList":[]}}