{"title":"Ex Situ Plant Conservation","uid":6502758,"size":1752419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97c80ea8d3d14086d5a3d56057e1a2faa427651b&amp;dn=Ex+Situ+Plant+Conservation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309307876,"description":"Ex Situ Plant Conservation: Supporting Species Survival In The Wild\nIsland Press; 1 edition | January 1, 2004 | ISBN-10: 1559638745 | 536 pages | PDF | 1.67 MB\n\nFaced with widespread and devastating loss of biodiversity in wild habitats, scientists have developed innovative strategies for studying and protecting targeted plant and animal species in &quot;off-site&quot; facilities such as botanic gardens and zoos. Such ex situ work is an increasingly important component of conservation and restoration efforts.\nEx Situ Plant Conservation, edited by Edward O. Guerrant Jr., Kayri Havens, and Mike Maunder, is the first book to address integrated plant conservation strategies and to examine the scientific, technical, and strategic bases of the ex situ approach. The book examines where and how ex situ investment can best support in situ conservation. Ex Situ Plant Conservation outlines the role, value, and limits of ex situ conservation as well as updating best management practices for the field, and is an invaluable resource for plant conservation practitioners at botanic gardens, zoos, and other conservation organizations; students and faculty in conservation biology and related fields; managers of protected areas and other public and private lands; and policymakers and members of the international community concerned with species conservation.","torrent":{"xt":"urn:btih:97c80ea8d3d14086d5a3d56057e1a2faa427651b","amp;dn":"Ex+Situ+Plant+Conservation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c80ea8d3d14086d5a3d56057e1a2faa427651b","infoHashBuffer":{"type":"Buffer","data":[151,200,14,168,211,209,64,134,213,163,213,96,87,225,162,250,164,39,101,27]},"announce":[],"urlList":[]}}