{"title":"Bill Carson - Show No Fear A Bouncers Diary (mobi + epub)","uid":7895914,"size":318377,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:980afab328d16b9071ab64316f3e5fc865d7a85d&amp;dn=Bill+Carson+-+Show+No+Fear+A+Bouncers+Diary+%28mobi+%2B+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"kevinkray","files":-1,"time":1354837077,"description":"'Time for a bit of scumbag cleansing'\n\nShow no fear is a true account of what it is like to be a night club doorman, there are no frills and Carson blows the myth of it being a somewhat glamourous industry right out of the water. The book is set in West London during the naughty nineties and is a real eye opener of a book as the author records the 'more unusual and violent incidents' in his career as a night club bouncer.\nIt may shock you to realise exactly the risks that bouncers take on the doors of night clubs and pubs, and even at private functions.\n\nIf the bouncer is to 'show no fear', he must build up strong mental and physical toughness through disciplined training. The author gets plenty of opportunities to try out the techniques he learns in his gym, whether its's a stranglehold or a right hander. If you have a run in with some 'weekend warriors', sometimes words are simply not enough to deal with it.\n\nBut this is not a disheartening story of mindless aggression. Some incidents are really funny, and the authors colourful language and wry humour help soften the blows when they come. Read this book and the next time you'll spare a thought for the bouncer who takes all the crap so you don't have to.","torrent":{"xt":"urn:btih:980afab328d16b9071ab64316f3e5fc865d7a85d","amp;dn":"Bill+Carson+-+Show+No+Fear+A+Bouncers+Diary+%28mobi+%2B+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"980afab328d16b9071ab64316f3e5fc865d7a85d","infoHashBuffer":{"type":"Buffer","data":[152,10,250,179,40,209,107,144,113,171,100,49,111,62,95,200,101,215,168,93]},"announce":[],"urlList":[]}}