{"title":"Au Revoir Simone - The Bird of Music","uid":4939624,"size":43150624,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:993be47d26bef6cbe75887c0e69e7b4e378d6407&amp;dn=Au+Revoir+Simone+-+The+Bird+of+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tweekins","files":12,"time":1244398673,"description":"AllMusic Review:\n\nThe first full-length by Brooklyn's all-girl Au Revoir Simone enchants in a way the trio itself once captured best: the music is the perfect soundtrack to &quot;exploring a secret garden at night with a flashlight,&quot; as they told British Vogue in 2006. Though that description made its way to newsstands before this album took shape -- the girls were discussing earlier tracks and sessions -- it holds: The Bird of Music presents dreamy, image-mad synth pop with a sparkly magic quality; it's the perfect album for contemplating unicorns to. Vocally, there's a sweetness to the songs that's nicely tempered by honesty -- when Au Revoir Simone sing &quot;You make me wanna measure stars in the backyard with a calculator and a ruler, baby,&quot; on the infectious &quot;Stars,&quot; for instance, you believe them, even if you find the idea a little odd. Musically, they make a mountain of sound out of three keyboards and a drum machine, but it's a mountain of sound you'd never attach the word &quot;quirky&quot; to. Au Revoir Simone are serious if highly idiosyncratic musicians. Their album should find favor with listeners who love Stereolab and the Waitresses but don't mind a little Bananarama thrown in the mix, either.\n","torrent":{"xt":"urn:btih:993be47d26bef6cbe75887c0e69e7b4e378d6407","amp;dn":"Au+Revoir+Simone+-+The+Bird+of+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"993be47d26bef6cbe75887c0e69e7b4e378d6407","infoHashBuffer":{"type":"Buffer","data":[153,59,228,125,38,190,246,203,231,88,135,192,230,158,123,78,55,141,100,7]},"announce":[],"urlList":[]}}