{"title":"Horny Housewives 3 (2015) DVDRip","uid":12230761,"size":1680944602,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9a7e0a1e2a4105a42e3146ec24fff6ee987f962e&amp;dn=Horny+Housewives+3+%282015%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TKTh3K1ng","files":1,"time":1439567865,"description":"Description\nAva Addams, Tommy Gunn, Bill Bailey, Ariella Ferrera, Summer Brielle, Alexis Monroe, Holly Halston, Keiran Lee, Alena Croft, Kate Frost\n\nThe Hottest, Horniest Wives For Your Enjoyment - Starring Ava Addams, Summer Brielle &amp; Alena Croft!\nDouble Timing Wife\nWhen Bill Bailey comes home from work and finds his wife Ava Addams in the shower, he doesn't suspect for a second that she was actually in there with her lover Keiran Lee! Once Keiran had blown his load all over her pretty face, Ava went to find her husband and get another fix of fat cock.\nThe Trophy Wife\nSummer Brielle is a trophy wife who married some rich old guy she isn't attracted to for his looks. So when her hubby wants to get freaky, Summer gets an idea! In order to enjoy fucking the rich old dude, she imagines her husband looking as tall, dark and handsome as he used to be.\nReal Ex-Wives Of Beverly Hills\nWhen Alena Croft is on her way to her ex Bill Bailey's house, she overhears her frenemy Ariella Ferrera talking about hooking up with him. The two sexy sluts get into a cat fight over Bill's big cock, until he manages to break up the scuffle with a suggestion of love, not war!\nFreeze, Fucker!\nHolly Halston was dressed up as a sexy cop, ready for a little roleplay with her husband. When the burglar she confronts in her bedroom isn't her husband, she quickly takes control, giving the burglar Keiran Lee a nice sloppy deepthroat blowjob and then bends over so he can fuck her deep in her tight pink pussy.\nFucking While We Wait\nWhen a client invites Bill Bailey over for dinner and then doesn't show up leaving him to make small talk with his busty blonde wife Alexis Monroe, both Bill and Alexis can feel the sexual tension in the air. So when he asks her to show off her new dress, she doesn't hesitate to strip down right in front of him.\n\n\nScreenshots:\n &lt;a href=&quot;\nhttp://imgsking.com/image/87F&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/87F&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgsking.com/image/87d&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/87d&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgsking.com/image/87m&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgsking.com/image/87m&lt;/a&gt;","torrent":{"xt":"urn:btih:9a7e0a1e2a4105a42e3146ec24fff6ee987f962e","amp;dn":"Horny+Housewives+3+%282015%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7e0a1e2a4105a42e3146ec24fff6ee987f962e","infoHashBuffer":{"type":"Buffer","data":[154,126,10,30,42,65,5,164,46,49,70,236,36,255,246,238,152,127,150,46]},"announce":[],"urlList":[]}}