{"title":"Girls Aloud - Jump  (2nafish)","uid":5434988,"size":135512068,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9ae4a0f60b00b45d736ad4a067548e7069fa8983&amp;dn=Girls+Aloud+-+Jump++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1268563216,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Jump (for My Love)&quot; was the opening track (and third single) of the Pointer Sisters' 1983 album, Break Out.\n\nReleased prior to the 1984 Summer Olympics games, the song's video featured footage of athletes competing in track and field events. The song was the second of four Billboard Hot 100 top 10 singles in a row for the sisters in 1984; it peaked at #3 in July. It also appeared on Billboard's Adult Contemporary chart and reached the Top 10 in the UK, peaking at number six.\n\nThe original title given to the song simply was &quot;Jump.&quot; The title was modified to &quot;Jump (for My Love)&quot; prior to its release to avoid confusion with the Van Halen song Jump, which was released earlier the same year.\n\nThe song netted the group a Grammy Award for Best Pop Performance by a Duo or Group with Vocal in 1985.\n\nThe song was featured in a gay-themed movie in 2002, &quot;The Trip,&quot; an epic gay romance that traces the relationship between two men from their initial meeting in 1973 until 1984. In 2003, this recording was used in the movie Love Actually.\n\nIn 2003, the British all-female pop group Girls Aloud covered &quot;Jump&quot;, produced by Brian Higgins and his production team Xenomania  for the soundtrack to the film Love Actually. The track was released on 17 November 2003 and continued Girls Aloud's string of hits, peaking at number two on the UK Singles Chart. Their version appeared on the re-release of their debut album Sound of the Underground and was also included on 2004's What Will the Neighbours Say?.\n\nThe director of Love Actually, Richard Curtis, phoned Xenomania while they were in a taxi in Berlin to tell them he thought &quot;Jump&quot; would make a good Girls Aloud single. Girls Aloud's version of &quot;Jump&quot; was not featured in the film itself. Love Actually uses the Pointer Sisters' original version due to international audiences being unaware of Girls Aloud, who feature in the end credits. Girls Aloud do, however, appear on the British soundtrack. The fourth single would have been the album track &quot;Some Kind of Miracle&quot; had the soundtrack opportunity not arisen.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:9ae4a0f60b00b45d736ad4a067548e7069fa8983","amp;dn":"Girls+Aloud+-+Jump++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae4a0f60b00b45d736ad4a067548e7069fa8983","infoHashBuffer":{"type":"Buffer","data":[154,228,160,246,11,0,180,93,115,106,212,160,103,84,142,112,105,250,137,131]},"announce":[],"urlList":[]}}