{"title":"Blind Man's Bluff - The Untold Story of American Submarine Espi","uid":4214124,"size":182072592,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9b3e9448979ebe5a8132c7a5605022226fd75242&amp;dn=Blind+Man%5C%27s+Bluff+-+The+Untold+Story+of+American+Submarine+Espi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":6,"time":1212239081,"description":"Blind Man&amp;#039;s Bluff - The Untold Story of American Submarine Espionage\nby Sherry Sontag, Christopher Drew\n\n\nI was a submariner on an LA class boat in the early 90s, and I heard some of this stuff from my COB (Chief Of the Boat) under conditions of secrecy. Recently declassified, such information appears for the first time in the book. Also made into documentary for the History Channel, one of the submariners from the 1960s interviewed said that it had become common for submariners of the period to simply hand copies of this book to their families and say &quot;Honey, THIS is what I was doing all that time I was away from you.&quot; Unfortunatly for many Cold Warriors, other activities of the period remain classified and a source of friction in some families. Additionally, many people are unaware that most of America&amp;#039;s nukes have been on submarines for decades, This above all other reasons is why the USSR never dared start a war. They knew they couldn&amp;#039;t find us in time to stop us.\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Blind-Mans-Bluff-Submarine-Espionage/dp/006097771X/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1211969609&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Blind-Mans-Bluff-Submarine-Espionage/dp/006097771X/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1211969609&amp;sr=8-1&lt;/a&gt;\n\nEditorial Reviews\n\nAmazon.com\nLittle is known--and less has been published--about American submarine espionage during the Cold War. These submerged sentinels silently monitored the Soviet Union&amp;#039;s harbors, shadowed its subs, watched its missile tests, eavesdropped on its conversations, and even retrieved top-secret debris from the bottom of the sea. In an engaging mix of first-rate journalism and historical narrative, Sherry Sontag, Christopher Drew, and Annette Lawrence Drew describe what went on.\n&quot;Most of the stories in Blind Man&amp;#039;s Bluff have never been told publicly,&quot; they write, &quot;and none have ever been told in this level of detail.&quot; Among their revelations is the most complete accounting to date of the 1968 disappearance of the U.S.S. Scorpion; the story of how the Navy located a live hydrogen bomb lost by the Air Force; and a plot by the CIA and Howard Hughes to steal a Soviet sub. The most interesting chapter reveals how an American sub secretly tapped Soviet communications cables beneath the waves. Blind Man&amp;#039;s Bluff is a compelling book about the courage, ingenuity, and patriotism of America&amp;#039;s underwater spies. --John J. Miller --This text refers to the Hardcover edition. \n\nFrom Publishers Weekly\nIn an unusually successful amalgam, veteran journalists Sontag and Christopher Drew combine a gripping story with admirable research to relate previously unknown information. Throughout the Cold War, the U.S. depended heavily on submarines for intelligence gathering, whether tracking Soviet missile subs, monitoring Soviet harbors and missile tests or, in some cases, retrieving lost Soviet equipment. The U.S.S.R. responded with everything from comprehensive espionage operations to depth charge attacks on particularly intrusive snoopers. The broad outlines of this clandestine confrontation are relatively familiar, but the details have largely remained secret. Although the authors have based their book largely on interviews with submariners, intelligence operatives and politicians, they recognize the possibility of distortion and back up personal accounts with an elaborate and convincing system of verification. While necessarily incomplete, the resulting work depicts what was arguably the most successful long-term, large-scale intelligence operation in American history. From captains to seamen, the participants combined technical proficiency, insouciant courage and a cheerful scorn for regulations that often interfered with their missions. That mind-set was hardly calculated to avoid direct confrontations, and accidental collisions were not uncommon. The authors nevertheless make a solid case that the risk of a destabilizing incident was far outweighed by the gains of the campaign?especially given the depth of mutual ignorance during the Cold War. \nCopyright 1998 Reed Business Information, Inc. --This text refers to the Hardcover edition. \n\n\n\nPaperback: 432 pages \nPublisher: Harper Paperbacks; Reprint edition (October 3, 2000) \nLanguage: English \nISBN-10: 006097771X \nISBN-13: 978-0060977719  ","torrent":{"xt":"urn:btih:9b3e9448979ebe5a8132c7a5605022226fd75242","amp;dn":"Blind+Man%5C%27s+Bluff+-+The+Untold+Story+of+American+Submarine+Espi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b3e9448979ebe5a8132c7a5605022226fd75242","infoHashBuffer":{"type":"Buffer","data":[155,62,148,72,151,158,190,90,129,50,199,165,96,80,34,34,111,215,82,66]},"announce":[],"urlList":[]}}