{"title":"State-Sponsored Terrorism, Crimes, and Lies - C.24 (Iraq War3)","uid":12536428,"size":167876276,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b816b5a4e047cb26fc2ebe246c3bf8fb60f2bfb&amp;dn=State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+C.24+%28Iraq+War3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":35,"time":1444326516,"description":"State-Sponsored Terrorism, Crimes, and Lies - Collection 24 (Iraq War 3):\r\n\r\nWe have 35 titles here:\r\n\r\n-  Ahmad - The Road to Iraq; the Making of a Neoconservative War (2014)\r\n\r\n-  Bert - American Military Intervention in Unconventional War; from the Philippines to Iraq (2011)\r\n\r\n-  Blum - America's Deadliest Export, Democracy; the Truth About U.S. Foreign Policy and Everything Else (2013)\r\n\r\n-  Bodansky - The Secret History of the Iraq War (2004)\r\n\r\n-  Bogdanos &amp; Patrick - Thieves of Baghdad; One Marine's Passion to Recover the World's Greatest Stolen Treasures (2005)\r\n\r\n-  Bolger - Why We Lost; a General's Inside Account of the Iraq and Afghanistan Wars (2014)\r\n\r\n-  Bruneau - Patriots for Profit; Contractors and the Military in U.S. National Security (2011)\r\n\r\n-  Buley - The New American Way of War; Military Culture and the Political Utility of Force (2008)\r\n\r\n-  Campbell - Desert War; the New Conflict between the U.S. and Iraq (2003)\r\n\r\n-  Cerf &amp; Navasky - Mission Accomplished; or How We Won the War in Iraq (2008)\r\n\r\n-  Chandrasekaran - Imperial Life in the Emerald City; Inside Iraq's Green Zone (2006)\r\n\r\n-  Cooley - An Alliance Against Babylon; the US, Israel and Iraq (2005)\r\n\r\n-  Dadge - The War in Iraq and Why the Media Failed Us (2006)\r\n\r\n-  Davies - Blood on Our Hands; the American Invasion and Destruction of Iraq (2010)\r\n\r\n-  Davis - Presidential Policies and the Road to the Second Iraq War; from Forty One to Forty Three (2006)\r\n\r\n-  Engel (Eds.) - Into the Desert; Reflection on the Gulf War (2013)\r\n\r\n-  Harvey - Explaining the Iraq War; Counterfactual Theory Logic and Evidence (2012)\r\n\r\n-  HRW - Violent Response; the US Army in Al-Falluja (2003)\r\n\r\n-  Kinsey &amp; Patterson (Eds.) - Contractors &amp; War; the Transformation of US Expeditionary Operations (2012)\r\n\r\n-  Lewis - 935 Lies; the Future of Truth and the Decline of America's Moral Integrity (2014)\r\n\r\n-  Malone - The International Struggle Over Iraq; Politics in the UN Security Council, 1980-2005 (2006)\r\n\r\n-  Martin - The Iraqi Prisoners Abuse Scandal  (2005)\r\n\r\n-  Mowle (Ed.) - Hope Is Not a Plan; the War in Iraq from Inside the Green Zone (2007)\r\n\r\n-  Packer - The Assassins' Gate; America in Iraq (2005)\r\n\r\n-  Pearson - The Search for Iraq's Weapons of Mass Destruction; Inspection, Verification and Non-Proliferation (2005)\r\n\r\n-  Pillar - Intelligence and U.S. Foreign Policy; Iraq, 9-11, and Misguided Reform (2011)\r\n\r\n-  Rampton &amp; Stauber - Weapons of Mass Deception; the Uses of Propaganda in Bush's War on Iraq (2003)\r\n\r\n-  Roussel &amp; Lechauxm - Voicing Dissent; American Artists and the War on Iraq (2010)\r\n\r\n-  Rutherford - Weapons of Mass Persuasion; Marketing the War against Iraq (2004)\r\n\r\n-  Schumacher - A Bloody Business; America's War Zone Contractors and the Occupation of Iraq (2010)\r\n\r\n-  Tracy - I am Sorry for Your Loss, and I Wish You Well in a Free Iraq; Compensating Civilian Causalities (Nov. 2008)\r\n\r\n-  Unger - Boss Rove; Inside Karl Rove's Secret Kingdom of Power (2012)\r\n\r\n-  Warren - No Place to Hide; a Brain Surgeon's Long Journey Home from the Iraq War (2014)\r\n\r\n-  Wolfe - Winning the War of Words; Selling the War on Terror from Afghanistan to Iraq (2008)\r\n\r\n-  Zinsmeister - Dawn Over Baghdad; How the U.S. Military Is Using Bullets and Ballots to Remake Iraq (2004)","torrent":{"xt":"urn:btih:9b816b5a4e047cb26fc2ebe246c3bf8fb60f2bfb","amp;dn":"State-Sponsored+Terrorism%2C+Crimes%2C+and+Lies+-+C.24+%28Iraq+War3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b816b5a4e047cb26fc2ebe246c3bf8fb60f2bfb","infoHashBuffer":{"type":"Buffer","data":[155,129,107,90,78,4,124,178,111,194,235,226,70,195,191,143,182,15,43,251]},"announce":[],"urlList":[]}}