{"title":"Teach Yourself Finnish","uid":5234534,"size":130934807,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9c1c216c3ddf84385cf6990fe89a59e65bd7875c&amp;dn=Teach+Yourself+Finnish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"123dutch","files":1,"time":1261482075,"description":"Teach Yourself Finnish (CD version)\nAuthor: Terttu Leney\nPublisher: Hodder Edu.\nPublication date: 2003\nFormat: pdf+mp3-&gt;rar\nSize: 60,7MB\n\nThe old cassette version is here \nTeach Yourself Finnish is the course for anyone who wants to progress quickly from the basics to understanding, speaking and writing Finnish with confidence. Although aimed at those with no previous knowledge, it is equally suitable for anyone wishing to brush up existing knowledge for a holiday or business trip. Key structures and vocabulary are introduced in 18 thematic units progressing from introducing yourself and dealing with everyday situations to talking about work and driving in Finland. The first five units are a survival package. They give a basic introduction to the kind of language you need when you visit the country. In the later units you will become familiar with many aspects of Finnish life as well as the language. The emphasis is on communication throughout with important language structures introduced through dialogues on the accompanying recording. There are plenty of exercises to practise the language as it is introduced and tips throughout to help with grammar. Cultural information boxes give useful advice and information for anyone planning a trip to Finland.\n\nThe new edition has been updated and is now accompanied by a double CD with extra audio material. Popular features of the previous edition have been retained:\n\n- English-Finnish vocabulary\n- glossary of grammatical terms\n- a 'taking it further' section to direct learners to further sources of real Finnish\n\nTerttu Leney is an experienced teacher, teacher trainer, translator and broadcaster of Finnish. She has taught Finnish in various firms and language schools, at Chelsea &amp; Westminster Adult Education Institute, the University of Surrey and has been teaching Finnish at the Foreign Office in London for over twenty years. She has taught several generations of UK diplomats to Helsinki. She has also been a freelance broadcaster for the Finnish section of the BBC World Service and Examinations Administrator for Language Testing Associates, London. In 1996 she gained a Postgraduate Diploma in Current Developments in Language Training from the University of Westminster.","torrent":{"xt":"urn:btih:9c1c216c3ddf84385cf6990fe89a59e65bd7875c","amp;dn":"Teach+Yourself+Finnish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c1c216c3ddf84385cf6990fe89a59e65bd7875c","infoHashBuffer":{"type":"Buffer","data":[156,28,33,108,61,223,132,56,92,246,153,15,232,154,89,230,91,215,135,92]},"announce":[],"urlList":[]}}