{"title":"Jack Carty...Break Your Own Heart(2012)[FLAC]","uid":7328104,"size":291764527,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9c3eb54f0ca07b5baa752e6970e07bedd68c7e53&amp;dn=Jack+Carty...Break+Your+Own+Heart%282012%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dickspic","files":18,"time":1338823413,"description":" &lt;a href=&quot;http://f0.bcbits.com/z/11/31/1131844148-1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://f0.bcbits.com/z/11/31/1131844148-1.jpg&lt;/a&gt;\n\nBreak Your Own Heart [2012]Gigpigle / GP0010\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\nThe Length Of Canada\nToo Many Things In Too Many Places\nEverything, Unhappily\nTravelling Shoes\nA Point On A Map\nShe Loves Me\nA Master Of All Things\nWaiting, Waiting!\nBreak Your Own Heart\nShe's Got A Boyfriend\nGiveth And Taketh Away\nI Hope You'll Come Around\n\n\nIT'S always refreshing when someone breathes new life into an old genre, and that is exactly what young Sydney-based folkie Jack Carty has done on his sensational sophomore album Break Your Own Heart.\nIt marks him as a man to watch. Carty works in a realm we once called &quot;bedsit folk&quot;, a charming nonsense that implied noble poverty, scant success, malnutrition and existential angst.\nHe does it with plenty of sincerity but with a refreshing lack of the didactic earnestness that once defined such music. You'll not be advised to say Hello in There, as you would by John Prine, or to stop whingeing about how lonely you are on The Streets of London, by Ralph McTell. No, the songs here are as ironic as the title.\nCarty's lyrics are observational, witty vignettes. &quot;Unwashed hair and a nose-ring staring back at me / a portrait of the Melbourne indie-hipster scene,&quot; he sings, at the beginning of Everything Unhappily, in its own way a folk song for a member of an entire generation normally oblivious to them. Carty has several voices, all of them rich in character, including a pure tenor.\nYou sense that these songs are crafted to be sung alone if necessary, accompanied by his skilful playing on warm toned Gibson guitars. But they are beautifully enhanced on the record with delicate brushwork, bass, cello, a little piano, some banjo, slide guitar and trumpet.\nOh, and a sporadic vocal chorus. It's not all folkie tenderness. There's the finger-picked bounce of A Master of All Things, which wouldn't be out of place on a Josh Pyke record, and there's a touch of Mumford &amp; Sons energy on Waiting, Waiting!, while She's Got a Boyfriend is close to a pure country stomp, complete with raving harmonica and lunatic vocal chorus.\nThe strings on Travelling Shoes so effectively support the song's emotive candour and natural climax that tears are not out of the question, even for tough guys. But Carty is too quick for self-pity, too sharp for sentiment. The songs sail by like the yachts on the foldout cover, each one prettier and better crafted than the last.\n\ncd ripped by EAC\n\n[img]http://i809.photobucket.com/albums/zz12/elitter/fd0138fdb1-1.gif[/img]\n &lt;a href=&quot;\nhttp://dickthespic.org/about/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/about/&lt;/a&gt;","torrent":{"xt":"urn:btih:9c3eb54f0ca07b5baa752e6970e07bedd68c7e53","amp;dn":"Jack+Carty...Break+Your+Own+Heart%282012%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c3eb54f0ca07b5baa752e6970e07bedd68c7e53","infoHashBuffer":{"type":"Buffer","data":[156,62,181,79,12,160,123,91,170,117,46,105,112,224,123,237,214,140,126,83]},"announce":[],"urlList":[]}}