{"title":"Process Systems Engineering Vol. 4 - Supply Chain Optimization, ","uid":12154221,"size":5331562,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9cafc6ed3a391b030eaf821cb4832b1f11cd53fd&amp;dn=Process+Systems+Engineering+Vol.+4+-+Supply+Chain+Optimization%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1437728246,"description":"Process Systems Engineering Vol. 4 - Supply Chain Optimization, Part II (Wiley-VCH, 2008).pdf\n\nISBN 9783527319060\n\nThis volume and the preceding Volume 3 present an in depth account of recent novel methodologies and algorithmic developments for the simulation, modeling and optimization of integrated supply chains. Emphasis is placed on strategic and tactical Supply Chain planning for the process industries. \n\nManagement of supply chains is a complex task mainly due to the large size of the physical supply network and inherent uncertainties. Depending on the level, one or more of the following decisions are taken:\n- Number, size and location of manufacturing sites, warehouses and distribution centres \n- Network connectivity \n- Production decisions \n- Management of inventory levels and replenishment policies\n- Transportation decisions \n- Sustainability aspects \n\nThe book contains high-quality works from leading researchers in the field whose expertise fits within this scope. It is intended for academics, researchers, industry practitioners in supply chain management, who are involved in model-based supply chain activities, across engineering and applied science disciplines, as well as for educational purposes both in academia and industry.\nThe Process Systems Engineering (PSE) Series offers an integrated and interdisciplinary approach towards the development of methodologies and tools for modelling, design, control and optimisation of enterprise-wide, process, manufacturing, energy and other such complex systems. A key theme is the systematic management of complexity in systems involving uncertainty across different time and length scales. To address this formidable challenge, the multi-disciplinary expertise of mechanical, control, chemical, molecular and biological engineers, operations researchers, mathematical programming specialists, and computer scientists is required","torrent":{"xt":"urn:btih:9cafc6ed3a391b030eaf821cb4832b1f11cd53fd","amp;dn":"Process+Systems+Engineering+Vol.+4+-+Supply+Chain+Optimization%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cafc6ed3a391b030eaf821cb4832b1f11cd53fd","infoHashBuffer":{"type":"Buffer","data":[156,175,198,237,58,57,27,3,14,175,130,28,180,131,43,31,17,205,83,253]},"announce":[],"urlList":[]}}