{"title":"Strange Case","uid":15506282,"size":553352568,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e68d4feaf8258f2c51d62a1e6817aa3b41ffaf4&amp;dn=Strange+Case&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Psychodad149","files":6,"time":1470589880,"description":"The Strange Case of the End of Civilization As We Know It (1977)\r\nRunning Time: 55 min.\r\n\r\nJohn Cleese  \r\nConnie Booth\r\n\r\nThe Strange Case of the End of Civilization As We Know It is a spoof of the Sherlock Holmes detective series, as well as the mystery genre in general.\r\n\r\nThe film begins aboard a luxury aircraft as US diplomat Dr. Henry Gropinger (a Dr. Henry Kissinger parody) travels on a goodwill tour. His diary stolen, he no longer knows where he is or is supposed to be next. Stepping off the plane, he is shot dead after offering woefully erroneous greetings to a reception committee of Arabs. Soon after, the U.S. President (a President Gerald Ford parody) receives a threatening letter signed only &quot;Moriarty&quot;, claiming responsibility for the death. The letter also claims Moriarty has set in motion a plan that will allow him to gain control of the world. \r\n\r\nScotland Yard takes the logical approach and contacts Arthur Sherlock Holmes, grandson of the legendary detective, Sherlock Holmes, who ferreted out Moriarty so many times in the past. This Holmes is perhaps not the detective his famous forbearer was, but, truth be told, he is considerably hampered by his sidekick, the remarkably daft and dense grandson of the original Dr Watson, also Dr Watson.  Watson's hapless and naive inabilities are completely not compensated for by his bionic enhancement.\r\n\r\nTrue to form, this latter-day Holmes also has a taste for certain illicit substances, stashed in containers bearing legends such as &quot;Grand Royal African Special Selection&quot; and &quot;Herbs Au Sherlock Holmes&quot;.\r\n\r\nIn a bold gamble, Holmes calls together a convention of the world's greatest detectives, making an irresistable target to force Moriarty's hand.  This sequence gives us marvelous spoofs of Columbo, Kojak, Poirot, and more.  This sequence also gives us the following Holmes/Watson dialogue, over a crossword puzzle:\r\n\r\nWatson: 1 Across. A simple source of citrus fruit, 1, 5, 4. \r\nHolmes: A lemon tree, my dear Watson. \r\n \r\nWatson : 2 Down. Conservative pays ex-wife maintenance. 7, 5. \r\nHolmes: Alimony...alimony Tory, my dear Watson. \r\nWatson: Never cease to astound me.\r\n \r\nWatson: 2 Down. Southern California style. 1, 2, 8. \r\nHolmes: A la Monterey, my dear Watson. \r\nWatson: Really good, Holmes. \r\n\r\nWatson: 4 Down. Burglar's entrance. \r\nHolmes: Alarm entry, my dear Watson.\r\n\r\nWatson: That's rather poor, isn't it, Holmes? Right. One to go. A cowardly fish, with a sting in its tail. \r\nHolmes: Yellow manta ray, my dear Watson. \r\nWatson: Brilliant, Holmes. \r\n\r\nAs the two riff on &quot;Elementary, My dear Watson,&quot; Moriarty is busy assassinating the gathered crime fighters, with each death marked by Watson's unknowingly, yet grotesquely appropriate &quot;1 down,&quot; &quot;2 down,&quot;, etc., which leads, inevitably, to the final showdown between Holmes and Moriarity.  \r\n\r\nCleese's performance is reminiscent of Basil Fawlty, with Arthur Lowe's Watson standing in for Manuel, although Manuel of course was not the blithering dolt this sidekick is.  This show aired once or twice in the US, and many critics regard it as the least of Cleese's works, citing flat humor, low budget, and ethnic references which may be inappropriate by modern standards.  The last has probably received the greatest assault in dismissing this movie, yet the original Monty Python series had far more racially-charged material.  \r\n\r\n\r\nAll in all, even if this is not the best work that John Cleese ever did, it is still John Cleese. And that alone puts it head and shoulders above 99% of the rest of what passes for comedy these days.  So there","torrent":{"xt":"urn:btih:9e68d4feaf8258f2c51d62a1e6817aa3b41ffaf4","amp;dn":"Strange+Case","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e68d4feaf8258f2c51d62a1e6817aa3b41ffaf4","infoHashBuffer":{"type":"Buffer","data":[158,104,212,254,175,130,88,242,197,29,98,161,230,129,122,163,180,31,250,244]},"announce":[],"urlList":[]}}