{"title":"WAX, or the Discovery of Television among the Bees","uid":7038313,"size":733443652,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9e6fc7a915545c80ccb3034e0fb777d6b4d6d69d&amp;dn=WAX%2C+or+the+Discovery+of+Television+among+the+Bees&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wootle01","files":2,"time":1329462844,"description":"WAX, or the Discovery of Television among the Bees -- David Blair (1991)\n\nScript: David Blair\nCamera: Mark Kaplan\nMusic: Beo Morales, Brooks Williams\n\nCast (in alphabetical order)\n\tFather Bessarion\t... \tHimself\n\tDavid Blair\t\t... \tJacob Maker\n\tWilliam S. Burroughs\t... \tJames \\'Hive\\' Maker\n\tFlorence Ormezzano\t... \tAllellee Zillah\n\tMeg Savlov\t\t... \tMelissa Maker\n\tDr. Clyde Tombaugh\t... \tHimself\n\nOriginal torrent from Greylodge\n\n.......................................................................\nCOMMENTS (IMDB)\n\nA Very Strange Film, 19 January 2001\nAuthor: debtman from Columbus, OH\n\nThis is a very strange movie. I\\'m not even sure that I can accurately\ndescribe the plot, because it doesn\\'t make any sense and I don\\'t know\nif it\\'s really a plot anyway. But I\\'ll give it a shot. I rented this\nbased on the quotes on the box, which described it as being like Total\nRecall, only with 10 times the weirdness. After seeing the movie, I\ndon\\'t know what they were talking about... The whole movie is narrated\nby David Blair in a very monotone voice, and has no similarities to\nTotal Recall that I see...\n\nThe movie starts out with James Maker, who is a member of something\ncalled the Supernormal Film Society whos goal is to film the spirits\nof the dead walking among the living. There\\'s some background on this\nwhich seems largely irrelevant. Then we meet his grandson, Jacob Maker\nwho is the main character of this story. Jacob is a programmer who\nworks on aircraft simulation programs. He\\'s also a beekeeper of\nMesopotamian bees he inherited from his grandfather.\n\nSo, after a bit the bees drill a hole in his head and put in a\ntelevision, which the bees use to start showing him things. About this\ntime, a statue of Kane outside his house kills the statue of Able, and\nKane is marked with the X symbol. Then at work, Jacob wonders why his\nco-workers never wonder what happens to the missiles they launch that\ndon\\'t come back (never mind that a programmer probably doesn\\'t deal\nwith missile launches), and he realizes that they turn into flying\nsaucers which fly to the moon where the dead live.\n\nAbout this time, the bees start showing him things on the television\nand he makes a big pilgrimage to the Garden of Eden Cave which the\nbees tell him is the entrance to the world of the dead. Jacob then\nrealizes that the bees are actually the dead of the future, and goes\nto the cave. Although it is a 40 miles walk through the desert, he\nmakes the journey a bit easier by becoming a bomb part of the way. He\nthen learns that he has to kill someone to fulfill his destiny, which\nis to be reborn in a wax body that the bees make in the cave.\n\nWhen arriving at the cave, Jacob learns that the cave is actually the\nentrance to a planet inside of our planet where the bees live. There,\nhe dies and goes to join the world of the dead. For a while, he\nbecomes the X symbol. Then he becomes a poem in the language of\nKane. Then he travels to some other planets, including the Planet of\nTelevision. Next he becomes a rival beekeeper of his grandfather. Then\nhe decides it\\'s time to fulfill his destiny, which is to kill\nsomeone. So, he becomes a bomb and blows up two Iraqi soldiers in a\ntank. Then he becomes the X symbol with himself, his grandfather\\'s\narch enemy, and the two soldiers he blew up.\n\nAnd that\\'s pretty much it... Make sense? No, I didn\\'t think\nso... David Blair calls this Independent Electronic Cinema. I don\\'t\nknow what to call it. I can\\'t figure out if this movie is bad because\nthe weirdness of it all is hard to get over. And the filming is\nworse... One could today make this movie on a home PC fairly\neasy. There are 3 distinct types of footage in the movie. First, there\nis a lot of stock footage of bees, bombs, and other scenes. Second,\nthere is footage that was shot with an amateur camera I\\'m\nguessing. Third, there were digital renderings. Nothing fancy, these\nwere things like 3D letters and symbols, and renderings of the cave\nceiling and floor just on the screen with a black background.\n\nAnd it\\'s heavily edited. I hesitate to refer to this as special\neffects, as I think it\\'s overly abused. There is not a point where\nmore than 1 minute goes by without further senseless video\neffects. Things like the image warping, folding, unraveling into a\nstring, blurring, etc. Basically all the stuff you could do to a movie\nwith a piece of $100 modern software and a video capture card. And it\ntook six years to make. Personally, I don\\'t see what makes this a\ngreat art film, as I\\'ve seen some reviews and essays claim it is. I\nthink it falls into the trap of being so different and bizarre that\npeople figure it must be artistic. I don\\'t know what the hell it is,\nand I don\\'t think I ever will. I keep thinking that there must be some\nmeaning in this movie, but I haven\\'t the slightest idea what...\n\n............................................................................\nSPECS\n\nFile Name .............: WAX.avi\nFile Size (in bytes) ..: 733,443,076 bytes\nRuntime (# of frames) .: 1:28:26 (127199 frames)\n\nVideo Codec ...........: XviD 1.1.0 Final\nFrame Size ............: 640x480 [=1.333]\nFPS ...................: 23.976\nVideo Bitrate .........: 965 kb/s\nBits per Pixel ........: 0.131 bpp\nB-VOP, N-VOP, QPel, GMC ......: []...[]...[]...[]\n\nAudio Codec ...........: 0x0055 MPEG-1 Layer 3\nSample Rate ...........: 44100 Hz\nAudio bitrate .........: 128 kb/s [2 channel(s)] CBR audio\nInterleave ............: 42 ms\nNo. of audio streams ..: 1\n\n*****************************FREAKYFLICKS*****************************\n\nFreakyFlicks is a free and open community dedicated to preserving and\nsharing cinematic art in the digital era. Our goal is to disseminate\nsuch works of art to the widest audience possible through the channels\nprovided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played\nan exceptional role in the history of cinema and its progression in\nbecoming a great art. Films that are usually described as classic,\ncult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them\nand participate in our community. All you need do is include this tag\nin your upload and join us at the forum to announce your release.\n       \n            \n           &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\t\n\t\n\n*****************************FREAKYFLICKS*****************************\t\t\n","torrent":{"xt":"urn:btih:9e6fc7a915545c80ccb3034e0fb777d6b4d6d69d","amp;dn":"WAX%2C+or+the+Discovery+of+Television+among+the+Bees","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e6fc7a915545c80ccb3034e0fb777d6b4d6d69d","infoHashBuffer":{"type":"Buffer","data":[158,111,199,169,21,84,92,128,204,179,3,78,15,183,119,214,180,214,214,157]},"announce":[],"urlList":[]}}