{"title":"Ascent to heaven Thaddeus music by Sanaya Roman","uid":4194149,"size":175157796,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9f39697083847bcdcc0401c1b72238bb06e8e498&amp;dn=Ascent+to+heaven+Thaddeus+music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iloveabrahamhicks","files":4,"time":1211129889,"description":"Ascent to Heaven\nEnjoy traveling to the higher realms of light as you listen to this melodic, flowing, and gentle music of the Heavens. Open to higher vibrations as you listen to angelic voices, harp, piano, strings, and slow, soothing melodies. Let your spirit soar as you journey upward.\n\nThis is very peaceful, relaxing, soothing music that will expand your consciousness and relax your body as you listen. Each album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment.\n\nSide 1 Ascent to Heaven\nJourney upward into the realms of light. Let go of the density of matter, and become a being of light. Enjoy the beautiful, uplifting harmonies as you increase your vibratory rate and ascend into the realms of light. Music has piano, strings, choir, and other beautiful sounds to lift you higher.\n\nSide 2 Heavenly Choir\nBask in the light of angels and beings of light. Experience the healing angels, who sing to you to welcome you into heavenly realms. Music has piano and choir sounds, and is very steady and soothing.\n\nSide 3 River of Love\nAs you listen, imagine you are traveling on a river of love. This music can relax you very deeply and lift your spirit. It is flowing, peaceful, and uplifting music composed of piano and strings.\n\nSide 4 Sea of Light\nLet yourself be lifted into the sea of light of the soul plane as you listen. This is a place of great light, serenity, joy, flow, and love. This music can help you experience the serenity, peace, and flowing energy of the sea of light. Harp with choir. \n &lt;a href=&quot;\nhttp://www.orindaben.com/music/listenrm.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/music/listenrm.php&lt;/a&gt;","torrent":{"xt":"urn:btih:9f39697083847bcdcc0401c1b72238bb06e8e498","amp;dn":"Ascent+to+heaven+Thaddeus+music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f39697083847bcdcc0401c1b72238bb06e8e498","infoHashBuffer":{"type":"Buffer","data":[159,57,105,112,131,132,123,205,204,4,1,193,183,34,56,187,6,232,228,152]},"announce":[],"urlList":[]}}