{"title":"Alex Jones Show - 2013 Sep 12 TH [sebaygo1]","uid":8911210,"size":64351485,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:9f80acd443556a9f5d7041fb65358f7514977eb2&amp;dn=Alex+Jones+Show+-+2013+Sep+12+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":12,"time":1379027001,"description":"\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 12 September 2013\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site :: Today on this Thursday, September 12 edition of The Alex Jones Show, Alex covers Russian President Vladimir Putin's unprecedented New York Times op-ed in which he stated that the evidence points to the al-Qaeda Syrian rebels being responsible for the chemical attacks in Syria, not the Syrian Army. Putin also emphasized that outside countries have fueled the conflict by supplying weapons to the extremist opposition. \n\nRon Paul's former congressional chief of staff and author Lew Rockwell joins the show to discuss these latest revelations on the Syrian civil war. \n\nReni Todashev, widow of the late Ibragim Todashev who was shot and killed by a FBI agent while being interrogated about the Boston Bombings, also joins the show to talk about the motives the FBI had for confronting Todashev in his home and the cover-up of what happened prior to his death.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n.\n","torrent":{"xt":"urn:btih:9f80acd443556a9f5d7041fb65358f7514977eb2","amp;dn":"Alex+Jones+Show+-+2013+Sep+12+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f80acd443556a9f5d7041fb65358f7514977eb2","infoHashBuffer":{"type":"Buffer","data":[159,128,172,212,67,85,106,159,93,112,65,251,101,53,143,117,20,151,126,178]},"announce":[],"urlList":[]}}