{"title":"Classic.Rock.Productions.AC.DC.Music.In.Review.3of3.Back.In.Blac","uid":6495332,"size":854894592,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a0e1a6721c46c2102ba77fb3297765a083f51117&amp;dn=Classic.Rock.Productions.AC.DC.Music.In.Review.3of3.Back.In.Blac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DocFreak08","files":-1,"time":1309043326,"description":"AC/DC is a hard rock band, formed in Sydney, Australia in 1973 by brothers Angus and Malcolm Young. The group is considered to be a pioneer of hard rock and heavy metal music along with Led Zeppelin, Deep Purple and Black Sabbath, but the members refer to their music as &quot;rock 'n roll.&quot; More than three decades into a career that shows no signs of slowing down or letting up, AC/DC, like electricity itself, provides the world with an essential source of power and energy. Since forming in 1973, AC/DC's high voltage rock 'n' roll has flowed out into the world via consistently sold-out concert tours and global sales totaling more than 150 million albums and counting.\n\nThis is the ultimate critical review of a legendary band, from the early days when AC/DC rose from playing obscure clubs to conquering the world. For many fans, Bon Scott was a legendary frontman without equal, and his powerful voice was the key to a host of classic hits from Whole Lotta Rosie to Let There Be Rock. After his trgic death, the virtually unknown Brian Johnson stepped into the breach, and AC/DC came storming back with the classic album Back In Black.\n\n\nPart 3 : Back in Black \n\nA dedicated team of professionals, including AC/DC aficionado and author Paul Stenning and journalist and author Carol Clerk, review the key factors in the conception and creation of the album. One of the most important elements in Back In Black was the production, and experts Tony Platt (engineer and producer to a stellar list of rock stars) and Simon Davie (Angus Young in top tribute act Dirty DC) give their industry insight into what really made this album buzz. With rare archive performance and interview footage, this film will take you behind the facade of the official release, in an uncompromising and complete review of one of the best rock'n'roll albums ever made.\n\n\n\nTechnical Specs\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1285 kbps\nVideo Resolution: 688x400\nVideo Aspect Ratio: 1.720:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams: 2\nAudio Languages: english\nRunTime Per Part: 1:16:45\nNumber Of Parts: 3\nPart Size: 854,980,608 Bytes\nRipped by: DocFreak08","torrent":{"xt":"urn:btih:a0e1a6721c46c2102ba77fb3297765a083f51117","amp;dn":"Classic.Rock.Productions.AC.DC.Music.In.Review.3of3.Back.In.Blac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0e1a6721c46c2102ba77fb3297765a083f51117","infoHashBuffer":{"type":"Buffer","data":[160,225,166,114,28,70,194,16,43,167,127,179,41,119,101,160,131,245,17,23]},"announce":[],"urlList":[]}}