{"title":"[FakeAgentUK] Ashley (Episode 62 / 02.18.2014)","uid":9631084,"size":909258920,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:a3756e45751afddf9aa769b52e939ba19834ca18&amp;dn=%5BFakeAgentUK%5D+Ashley+%28Episode+62+%2F+02.18.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1392787367,"description":"[FakeAgentUK] Ashley (Episode 62 / 02.18.2014)\n\nBritish transport... Late. London taxi cabs... Late. My next fucking appointment... Late. Ashley turned up 30 fucking minutes late, I was about ready to throw the towel in and go home for the day, catch up on a bit of footy. Well, as you can imagine I was not impressed. So I sat her down gave her a bit of a grilling and then got on with the game in hand. So I find out that this Scottish lass wants to do catwalk, fucking catwalk, she's only bloody 5ft 1?. Jesus Christ. So I set her straight and point her in the only direction I know, the path to porn. With the prospect of 2, maybe 3 grand a day, she was merrily skipping down the path, stripping everything off and lying in wait. Just how I like it. Now this bird was a little apprehensive I must say, so I had to put in a little extra verbal persuasion, which then tipped the scales in my favour. It wasn't long before she was orgasming on the couch and then inserted my thumb up her arse for good measure. Good girl. Then onto my old favourite, cock handling... This wee Scot can really suck cock, wow, really impressive deepthroat skills from such a petite bird, gave it all she had. Really impressed. Now it was time to get down to the nitty gritty... Fuck time. Again for a petite bird she really has got some stamina, bucking and writhing around on my cock, especially when I got her on top, she really slammed her arse on my cock. A lesser man would have cracked at this point, but I soldiered through and proceeded to finish up with a good old wank and blasted my hot load all over her. What I initially thought was going to be a disaster turned out to be a real surprise terrific fuck. Enjoy.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=zet98c7g687mdbh6ujrk.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=zet98c7g687mdbh6ujrk.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=8m2tdy81vgjt5rjbvt5f.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=8m2tdy81vgjt5rjbvt5f.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a3756e45751afddf9aa769b52e939ba19834ca18","amp;dn":"%5BFakeAgentUK%5D+Ashley+%28Episode+62+%2F+02.18.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3756e45751afddf9aa769b52e939ba19834ca18","infoHashBuffer":{"type":"Buffer","data":[163,117,110,69,117,26,253,223,154,167,105,181,46,147,155,161,152,52,202,24]},"announce":[],"urlList":[]}}