{"title":"TwoKinds Chapters 1-17 (Including MiniKinds &amp; Wallpapers)","uid":9204582,"size":197870557,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a3d31e1e639e0e7d37d03557ad92414858e7afee&amp;dn=TwoKinds+Chapters+1-17+%28Including+MiniKinds+%26amp%3B+Wallpapers%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"HeyItsPhantom","files":-1,"time":1384661256,"description":"Name: Twokinds (2kinds)\nStarted: October 22nd, 2003\nType: Fantasy Manga\nPages: 500+\n\nSummary: After losing his memory to a mysterious battle, Trace Legacy, a former leader for an organization of mages called the Templar, finds himself in the company of Flora, a girl of strange, tiger-like qualities. As Trace gradually begins to re-learn what he once knew, he soon discovers that Flora belongs to a race of people who are enemies of his kind. As friendship confects with racial differences, Trace and Flora find themselves in a situation more critical than either of them can imagine.\n\nOverview: Twokinds is a webcomic that takes place in a world conflicted with racial tension, primarily between the human-like Humans and the animal-like Keidran. They have dramatically different societies and ideas on how to live and act. It is because of these differences that the two races are almost always in some form of conflict. The story begins as the world hinges on the brink of another war. However, unlike before, this time war seems to be the result of a single man, manipulating the two races for his own personal gain - though he no longer has any memory of doing so.\n\nRaces: Twokinds have three major races: Humans, Keidran, and Basitins. However, most of the conflict surrounds the first two. Humans are your standard primate-based, bipedal, sentient animals. They are technologically superior to the other two races, due to their high intelligence and natural curiosity.\n\nKeidran are canine- and feline-based, bipedal, sentient animals. They come in a variety of shapes and sizes, which include: Tigers, Large Cats, Dogs, Wolves, and Foxes. They are a short-lived but intense race; guided by powerful base instincts. They are highly territorial and usually short-tempered. However, they are relatively easy to subdue and dominate individually, and thus make ideal slaves for Humans. This has been a point of contention for centuries between the two races.\n\nBasitins are a little-known race of bipedal, long-eared, brown-furred, sentient animals. Unlike the other two races, the Basitins live off the mainland on a distant island-continent. Due to their isolation, they are often forgotten by the other two races and left to their own devices. They are a warrior race, with a society solely consisting of soldiers. They behave in a hive-like manner, following orders of superiors without question. They are usually even-tempered and disciplined.\n\nTHIS TORRENT INCLUDES EVERY FULL UP-TO-DATE COMIC FROM TWOKINDS, ALSO &quot;MiniKinds&quot; AND WALLPAPERS!!!","torrent":{"xt":"urn:btih:a3d31e1e639e0e7d37d03557ad92414858e7afee","amp;dn":"TwoKinds+Chapters+1-17+%28Including+MiniKinds+%26amp%3B+Wallpapers%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3d31e1e639e0e7d37d03557ad92414858e7afee","infoHashBuffer":{"type":"Buffer","data":[163,211,30,30,99,158,14,125,55,208,53,87,173,146,65,72,88,231,175,238]},"announce":[],"urlList":[]}}