{"title":"Molecular Modeling in Heavy Hydrocarbon Conversions","uid":12398182,"size":3206482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a5778e1f357d22c39025a792d8bd4ef367a4b2e2&amp;dn=Molecular+Modeling+in+Heavy+Hydrocarbon+Conversions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1441982648,"description":"Molecular Modeling in Heavy Hydrocarbon Conversions (Chemical Industries Vol. 109)(CRC, 2006).pdf\n\nISBN 978-0-8247-5851-6\n\nIn the past two decades, new modeling efforts have gradually incorporated more molecular and structural detail in response to environmental and technical interests. Molecular Modeling in Heavy Hydrocarbon Conversions introduces a systematic molecule-based modeling approach with a system of chemical engineering software tools that can automate the entire model building, solution, and optimization process.\n\nPart I shows how chemical engineering principles provide a rigorous framework for the building, solution, and optimization of detailed kinetic models for delivery to process chemists and engineers. Part II presents illustrative examples that apply this approach to the development of kinetic models for complex process chemistries, such as heavy naphtha reforming and gas oil hydroprocessing.\n\nMolecular Modeling in Heavy Hydrocarbon Conversions develops the key tools and best possible approaches that process chemists and engineers can use to focus on the process chemistry and reaction kinetics for performing work that is repetitive or prone to human-error accurately and quickly","torrent":{"xt":"urn:btih:a5778e1f357d22c39025a792d8bd4ef367a4b2e2","amp;dn":"Molecular+Modeling+in+Heavy+Hydrocarbon+Conversions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5778e1f357d22c39025a792d8bd4ef367a4b2e2","infoHashBuffer":{"type":"Buffer","data":[165,119,142,31,53,125,34,195,144,37,167,146,216,189,78,243,103,164,178,226]},"announce":[],"urlList":[]}}