{"title":"BETTY BOO -- Doin' The Do -- The Best Of","uid":4147819,"size":101631724,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a6025b7e0e7f9e31421847cb35b6e7765821339d&amp;dn=BETTY+BOO+--+Doin%5C%27+The+Do+--+The+Best+Of&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"badbigdog","files":-1,"time":1208809069,"description":"BETTY BOO -- Doin The Do: The Best Of /// 224kbps\n\t\t\t\n\t\t01.\tWhere Are You Baby? [7&quot; Version]\n\t\t02.\tDoin' the Do [7&quot; Version]\n\t\t03.\tHey DJ _ I Can't Dance (To That Music You're Playing)\n\t\t04.\t24 Hours [Norman Cook Remix]\n\t\t05.\tBoo's Boogie\n\t\t06.\tLeave Me Alone\n\t\t07.\tShame\n\t\t08.\tBoo Is Booming\n\t\t09.\tMumbo Jumbo\n\t\t10.\t('Til My Last Breath) Doin' It to Def\n\t\t11.\tDon't Know What to Do\n\t\t12.\tValentine's Day\n\t\t13.\t24 Hours\n\t\t14.\tWhere Are You Baby? [12&quot; Peter Lorimer Version]\n\t\t15.\tDoin' the Do [12&quot; Version]\n\t\t16.\tBoo's Megamix -----------------------------------------------Alison Moira Clarkson, better known as Betty Boo born 6 March 1970 in Kensington, London) is an English dance-music artist, singer, and songwriter --- Clarkson studied sound engineering at college before having a string of hits between 1989 and 1992. Originally nicknamed &quot;Betty Boop&quot; for her similarity to the cartoon character, she changed it to avoid trademark disputes with Boop's owners. Of mixed Dusun and Scottish descent, she had an unusual, striking look and dressed in mildly provocative and revealing outfits.\n\nA sampled version of her 1990 hit &quot;Doin' The Do&quot; was used as a title tune for the 1991 video game Magic Pockets by the Bitmap Brothers.\n\nBoo started off working with the group the She Rockers, before going solo. Her big break came with the 1989 number 7 UK smash, &quot;Hey DJ - I Can't Dance (To That Music You're Playing)&quot;, with the Beatmasters. &quot;Doin' The Do&quot; followed and was another Top 10 single in 1990, also reaching number one on Billboard's dance chart in the United States. Her debut album Boomania was hailed by many as a witty, contemporary pop masterpiece and sold very well.[citation needed] &quot;Where Are You Baby?&quot;, Boo's biggest solo hit to date, reached number 3 in August of 1990. &quot;24 Hours&quot; (December 1990) was the last single from Boomania, and although it was a hit, it was less so than previous releases.\n\nNevertheless, Boo still returned with a new record deal with (WEA) in 1992, and her follow up album, GRRR! It's Betty Boo. The album itself suffered very disappointing sales in the UK, reaching only number 62.  In 1999 a Best Of compilation (effectively an expanded version of Boomania with extra remixes and a different running order) was released and sold moderately well.\n\nAfter her solo career floundered, Boo turned to songwriting and had success co-writing the song &quot;Pure and Simple&quot; for HearÃƒÂ¢??Say. She has also written for Girls Aloud, Louise Nurding, Dannii Minogue and The Tweenies.\n\nIn 2006 she formed a band called WigWam, with Alex James, bassist from Blur. They released a one off single also entitled Wigwam.\n\nIn 2007 she appeared as an interviewee on BBC Three's The Most Annoying Pop Songs... show passing comment on several songs that made the top 100 list.\n\nAs of August 2007, Betty Boo is in the process of releasing a new single entitled &quot;Take Off&quot;, which is a joint project between Betty Boo and London based dance act Jack Rokka. The track is much more dance oriented than Betty's previous work. She performed along with some of her other songs at Manchester Pride 2007. The video sees Betty Boo's trademark look resurrected and even features the 'Boosters', Betty Boo's backing dancers, who always appear with identical hair and outfits to Betty, and the Betty Boo spiral. The song has been played on Radio 1's dance oriented shows but is yet to receive airplay during mainstream programming.\n\nBetty Boo appeared on ITV's Loose Women on 16 October 2007 to promote her latest single. [ W I K I P E D I A : http://en.wikipedia.org/wiki/Betty_Boo ]","torrent":{"xt":"urn:btih:a6025b7e0e7f9e31421847cb35b6e7765821339d","amp;dn":"BETTY+BOO+--+Doin%5C%27+The+Do+--+The+Best+Of","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6025b7e0e7f9e31421847cb35b6e7765821339d","infoHashBuffer":{"type":"Buffer","data":[166,2,91,126,14,127,158,49,66,24,71,203,53,182,231,118,88,33,51,157]},"announce":[],"urlList":[]}}