{"title":"Fast and Furious: Tokyo Drift (2006) DVD-R NTSC WS -eng/spa/fre-","uid":4796773,"size":4687751345,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:a634618ceb007a62ca3ded6acec8e9c13d80dab8&amp;dn=Fast+and+Furious%3A+Tokyo+Drift+%282006%29+DVD-R+NTSC+WS+-eng%2Fspa%2Ffre-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twiztidxxninja","files":39,"time":1237909473,"description":"I'm Trying to help out djfred for all the wonderful movies he uploads\n\n\n\t\t     M O V i E   i N F O R M A T i O N * * *\n                      &lt;a href=&quot; http://www.imdb.com/title/tt0463985/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0463985/&lt;/a&gt;\n\n               \nBetter Luck Tomorrow director Justin Lin picks up where John Singleton left off to offer a high-octane look at the world of underground Japanese drift-racing in the latest installment of the super-charged Fast and the Furious film series. A frustrated teen from a broken home, Sean Boswell (Lucas Black) is an outsider looking to make a name for himself on the illegal street racing circuit. When Sean is busted by the police for his high-speed exploits and given the option of either spending time behind bars or moving overseas to live with his no-nonsense, military man father who's currently stationed in Tokyo, the young rebel packs his bags and sets his sights on Nippon. Though at first reluctant to adapt to the unfamiliar customs and foreign code of honor of his new home, Sean soon strikes up a friendship with American speed freak Twinkie (Bow Wow), a like-minded race fan who schools the inexperienced newcomer in the pulse-pounding world of drift-racing. Inadvertently challenging local champion and yakuza associate D.K. (The Drift King) his first time on the road, Sean is subsequently forced to work under expatriate Han (Sung Kang) to pay off his debt after failing to cross the finish line first. Taking note of the young American's affinity for racing as he warmly welcomes him into his merry band of misfit drift-fanatics, Han slowly introduces Sean to the key principles of the popular new racing style. When Sean makes the potentially deadly mistake of falling for D.K.'s girlfriend Neela (Nathalie Kelley), he'll need all the help he can get to face his most challenging race to date and take on the most notorious driver on the Tokyo drift scene in a hair-raising, hairpin-turn race where the winner truly takes all.\n\n                            \n\n\n\t\t\t\tM P A A  R A T I N G  * * * \n\n\t                                 Rated PG-13\n\n\n\n\t\t\t       R E L E A S E   D A T E  * * *\n\n\t\t\t\t\t16 June 2006\n\n\n                           \n\n\t\t\t\tD V D  C o n t e n t  * * * \n  \n        Main Movie ******:\n         * Video - UNTOUCHED - 2631 Kbps\n         * Audio - English, French, Spanish\n         * Subs  - English, French, Spanish\n\n        Menu ************:\n         * Yes\n\n        Extras **********:\n         * All\n\n        Ripped **********:\n         * Nothing\n\n\n        Chapters ********:\n\n1. Main Titles [:00]\n2. Winner Take All [:00]\n3. Off the Streets [:00]\n4. Stick To The Rules [:00]\n5. First Day In Class [3:04]\n6. My Ride [6:39]\n7. DK Challenge [2:27]\n8. No Choice [4:04]\n9. Represent [4:01]\n10. Trust &amp; Character [6:18]\n11. Feel It! [6:20]\n12. Drifting Date [8:17]\n13. Gaijin [5:19]\n14. For Want [6:20]\n15. It's What We Do [5:25]\n16. My Mess [3:25]\n17. Peaceful Resolution [4:04]\n18. To The Finish [3:05]\n19. An Old Friend [7:18]\n20. End Titles [:08]\n\n\n        Uploader Info ***:\n\tThank you for choosing my release from others that are available\n\ton the internet already. I wanted to ask a small favor. After you\n\thave completly downloaded my release, please return back where you \n\tdownloaded the movie and leave a comment. Let I know how the \n\tmovie quality is others who are going to be downloading my release\n\ta better information about the upload. I actually do check the \n\tcomments and i try to respond as much as possible. \n\tIf you trully love this DVD, do actually buy and support the \n\tproducers, writers, actors who made this movie possible\n\t\tThank You  [TwiztidxxNinja]","torrent":{"xt":"urn:btih:a634618ceb007a62ca3ded6acec8e9c13d80dab8","amp;dn":"Fast+and+Furious%3A+Tokyo+Drift+%282006%29+DVD-R+NTSC+WS+-eng%2Fspa%2Ffre-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a634618ceb007a62ca3ded6acec8e9c13d80dab8","infoHashBuffer":{"type":"Buffer","data":[166,52,97,140,235,0,122,98,202,61,237,106,206,200,233,193,61,128,218,184]},"announce":[],"urlList":[]}}