{"title":"RIM_Battle_Planets-FLT","uid":6430826,"size":423999443,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a63db0e8e9b1d907d17ef1381e1c9499378a4203&amp;dn=RIM_Battle_Planets-FLT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Totenkruez","files":-1,"time":1306643165,"description":"  Game information :\n  ==================\n   For the first time, the research ship RSS SOLARIUS has successfully\n   travelled through the Great Nebula of a distant galaxy on its way to\n   the OUTER RIM. The humanoid REYS - designers and builders of the vast\n   SOLARIUS carrier ship - thus tackled their first major project since\n   the Galactic War. The SOLARIUS is approaching the first unknown\n   worlds of the OUTER RIM with its scientific instruments, research\n   units, eagerly inquisitive officers and highly motivated team. The\n   reason for the War, its end, and the mission of the carrier ship can\n   be described in a single word - Might! Might based on a technology\n   that has endured since the depths of prehistory. Wars had been fought\n   over the coveted technology and unparalleled knowledge left behind\n   by the Ancient People. They also left a trail behind - a trail leading\n   to the OUTER RIM, which Crimson, an agent of the REYs ILB secret\n   service, suspects is the source of the technology.\n   \n   You will experience the mission of the RSS SOLARIUS from the viewpoint\n   of Max Adamski, officer of the ALPHA landing troop. Adamski is a\n   veteran of the war against the antlike, bionic SLAKZ, and is on board\n   because of an regrettable error. As Adamski, you will take control and\n   assume the responsibility for the units, equipment and personnel of\n   the landing troops. Your actions will be decisive for the success or\n   failure of the mission. Adamski is thinking back - the difficulties\n   began as the planet \\&quot;Paradise\\&quot; came within range of the scanners...\n  Features :\n  ==========\n   * The game is set in scene highly detailed by the \\&quot;state of the art\\&quot;\n     3D-engine. Light, animation, shadows, fog, changing weather and\n     many other special effects ensure remarkable moods.\n   * An unique game system combines proven elements with innovative\n     gameplay and guarantees strategic decisions, as well as thrilling\n     real-time entertainment.\n   * An easy to use interface and 8 tutorials guarantee easy entry\n     into gameplay.\n   * The special developed \\&quot;Video Entertainment Engine\\&quot; takes the\n     player right into the action. Detailed 3D graphics shows every\n     detail of the combat. The scene can be saved, replayed and\n     shared with others, even the enemy.\n   * Over 70 different units represents the high level of game value.\n     Every unit gets you in touch with new strategies and\n     possibilities: radar-vehicles, tanks with gun shields, fast and\n     aggressive drones, artillery, aircrafts, transports, shelter\n     grounds and much much more.\n   * Multiplayer for up to 8 players, many eligible game modes,\n     6 different races with their own skills, units and strategies,\n     fast setup, cooperative game, optional goals.\n   * A highly competitive computer-enemy with complex strategies\n     and an AI library build up in many years of knowledge and\n     testing, gives you more than a simple playmate, RIM is a\n     real challenge.\n   * Over 30 missions in completely different landscapes: dry\n     deserts, stormy iceplanets, abandoned meteors, weapon infested\n     fortresses and many other interesting leveldesigns.\n   * The intriguing storyline, which guides the player through the\n     whole game, provides unexpected turns and interesting twists,\n     supported by video sequences and voice output. Many different\n     quests and missions provides all new challenges and actions.\n   \n   More on http://www.trinode.com/internat/games/rim/index.htm","torrent":{"xt":"urn:btih:a63db0e8e9b1d907d17ef1381e1c9499378a4203","amp;dn":"RIM_Battle_Planets-FLT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a63db0e8e9b1d907d17ef1381e1c9499378a4203","infoHashBuffer":{"type":"Buffer","data":[166,61,176,232,233,177,217,7,209,126,241,56,30,28,148,153,55,138,66,3]},"announce":[],"urlList":[]}}