{"title":"The Anthony Cumia Show 2015-03-12 MP4 MP3 combo","uid":11753067,"size":354359455,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a73ef6ec14df39fb2b9c913dfece7c979abf25f5&amp;dn=The+Anthony+Cumia+Show+2015-03-12+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1426268721,"description":"NOTE: Audio was having that &quot;bouncing to the right channel&quot; thing upon re-encode again (tried updating HB, different AAC encoders same issue). This has the original AAC track pulled in and therefore is a little larger in size.\n\n*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\n\nEpisode 126: Today kicks off with Anthony going through some of the Twitter &quot;debates&quot; he had in the last 24-hours, playing the horrendous McDonald's fight video that is all over the internet today, and talks about a six-hour documentary he saw called &quot;The Greatest Story Never Told&quot;. He then reads a news story about the band &quot;Black Pussy&quot; and plays one of their tracks, entertains a few callers, we hear new entries for the &quot;Most Offensive Song&quot; contest, and watch the rebuttal video Ari Shaffir made due to Howard Stern shitting on him and podcasting. We see a TV reporter get mugged on-air, Ant reiterates that you (yes you!) should never show up to his house uninvited, tells us he'll be streaming live from the No Limits Tattoo Show on March 21st, mentions that the FCC finally made the rules of Net Neutrality public, and discusses a couple of news stories that are causing &quot;outrage&quot;. KtC gives us an arrest update on the McDonald's fight video, Ant talks about the hypocrisy of the &quot;black lives matter&quot; preachers, briefly conveys his views on the latest news out of Ferguson, and TACS week ends with a ridiculous clip from &quot;The Ed Show&quot; waxing retarded with suggestions on how to handle things in Ferguson.\n\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a73ef6ec14df39fb2b9c913dfece7c979abf25f5","amp;dn":"The+Anthony+Cumia+Show+2015-03-12+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a73ef6ec14df39fb2b9c913dfece7c979abf25f5","infoHashBuffer":{"type":"Buffer","data":[167,62,246,236,20,223,57,251,43,156,145,61,254,206,124,151,154,191,37,245]},"announce":[],"urlList":[]}}