{"title":"Little Shop Of Horrors - DVD Rip, Extras, Commentary","uid":11471461,"size":1603224556,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a78bd758d6eb33bb6d216df4e2f4792823979520&amp;dn=Little+Shop+Of+Horrors+-+DVD+Rip%2C+Extras%2C+Commentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"rambam1776","files":-1,"time":1416093496,"description":"Little Shop Of Horrors - [1986] Rick Moranis, Ellen Greene\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 1.20 GiB\nDuration                                 : 1h 33mn\nNominal bit rate                         : 1 000 Kbps\nWidth                                    : 720 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 16:9\nFrame rate mode                          : Variable\nStandard                                 : NTSC\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nWriting library                          : x264 core 120\n\nSUBTITLES - English, French Spanish, Director's Commentary Audio Track\n\nIncludes original trailers and making of documentary - **NOTE** - This DVD rip does NOT include the original ending first made available on the 2012 Blu-Ray release. That ending can be seen HERE\n\n &lt;a href=&quot;\nhttp://bayimg.com/DaeCaAaGO&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/DaeCaAaGO&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0091419/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0091419/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Little_Shop_of_Horrors_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Little_Shop_of_Horrors_(film)&lt;/a&gt;\n\nLittle Shop of Horrors is a 1986 American musical horror comedy film directed by Frank Oz. It is a film adaptation of the off-Broadway musical comedy of the same name by composer Alan Menken and writer Howard Ashman about a nerdy florist shop worker who raises a vicious, raunchy plant that feeds on human blood. Menken and Ashman's Off-Broadway musical was based on the low-budget 1960 film The Little Shop of Horrors, directed by Roger Corman. The 1986 film stars Rick Moranis, Ellen Greene, Vincent Gardenia, Steve Martin, and Levi Stubbs as the voice of Audrey II. The film also featured special appearances by James Belushi, John Candy, Christopher Guest, and Bill Murray. It was produced by David Geffen through The Geffen Company and released by Warner Bros. Pictures on December 19, 1986.\n\nLittle Shop of Horrors was filmed on the Albert R. Broccoli 007 Stage at the Pinewood Studios in England, where a &quot;downtown&quot; set, complete with overhead train track, was constructed. The film was produced on a budget of $25 million, in contrast to the original 1960 film, which, according to Corman, only cost $30,000. The film's original 23-minute finale, based on the musical's ending, was rewritten and reshot after receiving a strong negative reception from test audiences. Before it was fully restored in 2012 by Warner Home Video, the ending was never available publicly other than in the form of black-and-white workprint footage.\n\nCast\nRick Moranis  -  Seymour Krelborn, a nerdy florist who loves &quot;strange and interesting&quot; plants.\nEllen Greene  -  Audrey, a sweet, quiet, ditsy and insecure coworker who is the object of Seymour's affections, but dating the sadistic Orin Scrivello.\nVincent Gardenia  -  Mr. Mushnik, the grouchy, penny-pinching owner of Mushnik's Flower Shop.\nSteve Martin  -  Orin Scrivello, DDS, an abusive, sadistic and nitrous oxide-huffing dentist, and Audrey's boyfriend.\nLevi Stubbs  -  the voice of Audrey II, an evil and profane flytrap-like extraterrestrial plant with plans to take over the world.\nTichina Arnold, Michelle Weeks, and Tisha Campbell  -  Crystal, Ronette, and Chiffon, the three dropout schoolgirls who act as  a Greek chorus throughout the film.\nJames Belushi  -  Patrick Martin, a Licensing and Marketing executive from World Botanical Enterprises who offers Seymour a proposal to sell Audrey IIs worldwide. Belushi appears in the theatrical release after re-shoots after actor Paul Dooley (who played Martin in the original ending) was  unavailable to reprise his scenes.\nJohn Candy  -  Wink Wilkinson, the WSKID DJ (the only one) who enjoys putting on a radio show about &quot;weird stuff&quot; called, &quot;Wink Wilkinson's Weird World\nChristopher Guest  -  The First Customer, the first customer to enter the flower shop and notice Audrey II.\nBill Murray  -  Arthur Denton, an enthusiastic masochist man who goes to Orin for &quot;a long, slow root canal.&quot;\nMiriam Margolyes  -  a Dental Nurse, Orin's sarcastic nurse/secretary who Orin appears to enjoy harming frequently.\nStanley Jones  -  the Narrator, whose voice is heard reading the opening words.\nMak Wilson, Danny John-Jules, Danny Cunningham, Gary Palmer, and Paul Swaby  -  the doo-wop backup singers.\n\nAudrey II was operated by John Alexander, Anthony Asbury, Don Austen, David Barclay, Michael Barclay, James Barton, Michael Bayliss, Marcus Clarke, Sue Dacre, Graham Fletcher, Brian Henson, Terry Lee, Christopher Leith, Toby Philpott, Mike Quinn, Paul Springer, William Todd-Jones, Ian Tregonnian, Robert Tygner, and Mak Wilson","torrent":{"xt":"urn:btih:a78bd758d6eb33bb6d216df4e2f4792823979520","amp;dn":"Little+Shop+Of+Horrors+-+DVD+Rip%2C+Extras%2C+Commentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a78bd758d6eb33bb6d216df4e2f4792823979520","infoHashBuffer":{"type":"Buffer","data":[167,139,215,88,214,235,51,187,109,33,109,244,226,244,121,40,35,151,149,32]},"announce":[],"urlList":[]}}