{"title":"PlayFirst - Winemaker Extraordinaire - RaBBiT","uid":4748391,"size":52274530,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a7cb1d1897dd76fe3fe9017b5f2ccfc877a064eb&amp;dn=PlayFirst+-+Winemaker+Extraordinaire+-+RaBBiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"no_cr","files":3,"time":1236014508,"description":"PlayFirst - Winemaker Extraordinaire\n\nWhen Maria Bellaventura finds out that she has inherited an Italian winery, she must leave her stress-filled life as a corporate lawyer to take over the family business. That's the premise of Winemaker Extraordinaire, an upcoming strategy game that publisher Merscom describes as Chocolatier meets Ernest &amp; Julio Gallo. \nFortunately for Maria, her uncle Guiseppe is around to show her the ropes, and it turns out that winemaking is all fun and games (three mini-games to be exact, which help increase efficiency and quality of production.) \nWhen she's not overseeing the winery, Maria gets to travel to fifteen picturesque locations around the world to collect new recipes and exotic grape seeds to turn her small family winery into a successful international winemaking enterprise. \nMaria's great grandfather was the leader of a very prestigious World Guild of Extraordinary Winemakers. His lifetime goal was to unite all 15 members of the Guild and befriend them again, which is why he tore up the recipe of the Vino Ultimae and distributed the pieces among the members in the hope that one day they would be able to put aside their differences and make perfect wine together. You'll have to help Maria reunite the guild, restore the lost recipe, and create the Vino Ultimae - the greatest wine the world has ever seen. \n","torrent":{"xt":"urn:btih:a7cb1d1897dd76fe3fe9017b5f2ccfc877a064eb","amp;dn":"PlayFirst+-+Winemaker+Extraordinaire+-+RaBBiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7cb1d1897dd76fe3fe9017b5f2ccfc877a064eb","infoHashBuffer":{"type":"Buffer","data":[167,203,29,24,151,221,118,254,63,233,1,123,95,44,207,200,119,160,100,235]},"announce":[],"urlList":[]}}