{"title":"ThumbsPlusPro7-updated","uid":4629605,"size":38506559,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a878126ee5d95e84898388a090fbff7bf15e73c6&amp;dn=ThumbsPlusPro7-updated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FanoFart","files":6,"time":1231343600,"description":"Original Torrent reloaded from SSG (full credit) with their kg, and the SP2 now available for this nifty little dooda from Cerious Software\n\n\nAs this here be my foist up :) advice comments and downright slanging matches welcome.\n\n\nThumbsPlus is a graphic file viewer, locator and organizer that simplifies the process of finding and maintaining graphics, clip-art files, fonts and animations. It displays an image (thumbnail view) of each file. You can use ThumbsPlus to browse, view, edit, crop, launch external editors, and copy images to the clipboard. You can use drag-and-drop to organize graphics files by moving them to appropriate folders. ThumbsPlus will also create a slide show from selected graphics, and install bitmap files as Windows wallpaper. You can print individual graphics files, or the thumbnails themselves as a catalog. ThumbsPlus can convert to several formats, either one at a time or during batch processing. You can also perform image editing in batch mode. ThumbsPlus will also convert metafile graphics to bitmaps (rasterize). You can create graphic contact sheets with thumbnails and descriptions of files, and even build web pages of thumbnails!","torrent":{"xt":"urn:btih:a878126ee5d95e84898388a090fbff7bf15e73c6","amp;dn":"ThumbsPlusPro7-updated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a878126ee5d95e84898388a090fbff7bf15e73c6","infoHashBuffer":{"type":"Buffer","data":[168,120,18,110,229,217,94,132,137,131,136,160,144,251,255,123,241,94,115,198]},"announce":[],"urlList":[]}}