{"title":"Metallica - Metallica (1991/2014)   24-bit/96 kHz  Official","uid":11829608,"size":2168582467,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a89d60e7668d73ca80f26fed668daa2ba47e56e3&amp;dn=Metallica+-+Metallica+%281991%2F2014%29+++24-bit%2F96+kHz++Official&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":15,"time":1429589336,"description":"\nMetallica - Metallica (1991/2014)\n FLAC (tracks) 24-bit/96 kHz | Time - 62:37 minutes | 2,12 GB\nStudio Master, Official Digital Download | Artwork: Front cover\n\n Metallica (also known as The Black Album) is the eponymously titled fifth studio album by American heavy metal band Metallica. The album received widespread critical acclaim and became the band's best selling record.\n\n\n After the muddled production and ultracomplicated song structures of ...And Justice for All, Metallica decided that they had taken the progressive elements of their music as far as they could and that a simplification and streamlining of their sound was in order. While the assessment made sense from a musical standpoint, it also presented an opportunity to commercialize their music, and Metallica accomplishes both goals. The best songs are more melodic and immediate, the crushing, stripped-down grooves of &quot;Enter Sandman,&quot; &quot;Sad but True,&quot; and &quot;Wherever I May Roam&quot; sticking to traditional structures and using the same main riffs throughout; the crisp, professional production by Bob Rock adds to their accessibility. &quot;The Unforgiven&quot; and &quot;Nothing Else Matters&quot; avoid the slash-and-burn guitar riffs that had always punctuated the band's ballads; the latter is a full-fledged love song complete with string section, which works much better than might be imagined. The song- and riff-writing slips here and there, a rare occurrence for Metallica, which some longtime fans interpreted as filler next to a batch of singles calculated for commercial success. The objections were often more to the idea that Metallica was doing anything explicitly commercial, but millions more disagreed. In fact, the band's popularity exploded so much that most of their back catalog found mainstream acceptance in its own right, while other progressively inclined speed metal bands copied the move toward simplification. In retrospect, Metallica is a good, but not quite great, album, one whose best moments deservedly captured the heavy metal crown, but whose approach also foreshadowed a creative decline.  \n\n\nTracklist:\n\n 01 - Enter Sandman\n 02 - Sad But True\n 03 - Holier Than Thou\n 04 - The Unforgiven\n 05 - Wherever I May Roam\n 06 - Don't Tread On Me\n 07 - Through The Never\n 08 - Nothing Else Matters\n 09 - Of Wolf And Man\n 10 - The God That Failed\n 11 - My Friend Of Misery\n 12 - The Stuggle Within","torrent":{"xt":"urn:btih:a89d60e7668d73ca80f26fed668daa2ba47e56e3","amp;dn":"Metallica+-+Metallica+%281991%2F2014%29+++24-bit%2F96+kHz++Official","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89d60e7668d73ca80f26fed668daa2ba47e56e3","infoHashBuffer":{"type":"Buffer","data":[168,157,96,231,102,141,115,202,128,242,111,237,102,141,170,43,164,126,86,227]},"announce":[],"urlList":[]}}