{"title":"Marvel Knights Spider-Man &amp; Sensational Spider-Man v2 (Complete)","uid":4024932,"size":465220971,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a8d425b6a5e908e4a80e8daaeb5725433a188571&amp;dn=Marvel+Knights+Spider-Man+%26+Sensational+Spider-Man+v2+%28Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chisman21","files":41,"time":1202861251,"description":"Marvel Knights Spider-Man #1-22 (June 2004-March 2006)\nSensational Spider-Man (vol. 2) #23-41 (April 2006-November 2007)\n\n\n&quot;Down Among the Dead Men&quot; (issues 1-4)\nWriter: Mark Millar \nPenciler: Terry Dodson \nInker: Rachel Dodson \nWhen Spider-Man finally sends the Green Goblin to jail, an unknown enemy who knows that Peter Parker is Spider-Man kidnaps Aunt May. After an embarrassing trip to the Avengers, Spidey visits the Owl, who says that Electro and the Vulture kidnapped her. This turns out to be a ploy by the Owl, who is after the two villains for stealing from him. Spidey goes through a brutal fight with Electro and is hospitalized. He is photographed (with most of his mask torn away) and is ambushed by the Vulture, only to be saved by the Black Cat who leaves Vulture in a bad condition due to her foul mood at the time of their fight. The photos are brought to J. Jonah Jameson, who says he thinks the partial face looks familiar. Also in the panel where a wounded Peter is climbing up an office building three characters are visible bearing a striking resemblance to Clark Kent, Jimmy Oslen and Lois Lane. On the side of the computer there is a note from a man named &quot;Perry&quot; and a picture of an &quot;S&quot; symbol.\n\n\n&quot;Venomous&quot; (issues 5-8)\nWriter: Mark Millar \nPenciler: Terry Dodson and Frank Cho \nInker: Rachel Dodson \nThe pictures of the unmasked Spider-Man are published by the Daily Bugle, but Parker&amp;#039;s face is too mangled to be identified. Jameson issues a $5 million reward for Spidey&amp;#039;s alias. Meanwhile Doctor Octopus goes on a rampage and Eddie Brock auctions off the Venom costume, which is bought by the Fortunato family for the baby of the family, Angelo. Spidey visits the X-Men, where Rachel Summers tells Spidey she thinks Aunt May is dead. Parker goes to his high school reunion and is attacked by Venom. During a grueling battle, the suit abandons Angelo, who falls to his death. Eddie Brock is discovered to have slit his own wrists. May&amp;#039;s kidnapper then calls Parker and asks him to lunch.\n\n\n&quot;The Last Stand&quot; (issues 9-12)\nWriter: Mark Millar \nPenciler: Terry Dodson \nInker: Rachel Dodson \nThe kidnapper turns out to be the Scorpion, who is working for Norman Osborn. Spidey is blackmailed into breaking the Goblin out of jail. During the breakout, Spidey (along with the Black Cat) is attacked by the new Sinister 12, which includes the Scorpion as the new Venom. The 12, with the exclusion of the Goblin and Venom, battle the two heroes until many of the Marvel heroes come to save the day. Spidey chases after the Goblin, but is ambushed by Venom, whom he defeats. Spidey finds the Goblin on the Brooklyn Bridge with his wife, Mary Jane Watson. The two battle, but are interrupted by Doctor Octopus, who has been brainwashed to kill the Goblin by a shadowy organization. Spidey defeats them both, saves MJ, and rescues his Aunt, who is buried alive and unharmed in the grave of his Uncle Ben.\n\n\n&quot;Wild Blue Yonder&quot; (issues 13-18)\nWriter: Reginald Hudlin \nPenciler: Billy Tan \nInker: John Sibal \nAfter all the trauma of finding Aunt May and once again defeating the Green Goblin, Spider-Man is now a full member of the Avengers, living in Stark Tower with Aunt May and Mary Jane Watson. His summer-school job falls through, so he looks to the Daily Bugle for work. The Owl has placed a bounty on Spider-Man and the Absorbing Man and his unnamed female consultant are looking to collect. After a fight the unnamed woman stole Peter&amp;#039;s wallet and starts looking for him at Aunt May and Peter&amp;#039;s houses which are destroyed, so they leave none-the-wiser.\n\nAt the Daily Bugle, Peter meets the new star reporter from Iowa, named Ethan Edwards. Ethan&amp;#039;s fundamentalist parents raised him to believe that &quot;with power there must also come great responsibility&quot; in life. Ethan asks Peter to train him and Peter agrees.\n\nMeanwhile, the Absorbing Man was critically wounded by the Punisher shortly after escaping from a robbery, and turns into steel to avoid bleeding to death. He absorbs the properties of cocaine (actually an unnamed drug, but the reference is clear enough) so the slug can be removed. The Owl&amp;#039;s men use a high-powered electric fan to blow the Absorbing Man apart after he had turned into cocaine.\n\nThe cocaine remains of the Absorbing Man are sold on the streets, and the users temporarily gain the powers of the Absorbing Man.\n\n\n&quot;The Other&quot; (issues 19-22)\nMain article: Spider-Man: The Other\nWriter: Peter David, Reginald Hudlin, J. Michael Straczynski \nPenciler: Pat Lee \nInker: Dream Engine \nThese issues are part of the twelve-part crossover, &quot;Spider-Man: The Other&quot;, one-third of which will be told in Marvel Knights Spider-Man (the other two-thirds told in Friendly Neighborhood Spider-Man and Amazing Spider-Man).\n\nThe second chapter of The Other, &quot;Denial,&quot; focuses on Mary Jane, who overhears that Spider-Man might be getting killed on television. She rushes to a bar to see the live coverage on TV, and she sees Spider-Man fighting Tracer, who is controlling Iron Man&amp;#039;s armor and forcing him to attack Spider-Man. Later, at home, Mary Jane confronts Peter, telling him she thinks he has a death wish, but Peter interrupts her to tell her the news from the doctor.\n\nThe fifth chapter of The Other, &quot;Retreat&quot;, Peter, Mary Jane and Aunt May go to Latveria to use Dr. Doom&amp;#039;s Time Machine to see past scenes in his life, like the day Richard Parker and Mary Fitzpatrick-Parker left Peter in the care of his Uncle Ben and Aunt May. After returning to Stark Tower, Peter briefly considers a trip to Las Vegas with Mary Jane, namely in Tony Stark&amp;#039;s penthouse suite. He ultimately rejects the idea, assuming even if he managed to win big at the blackjack tables, some super-villain or other would end up disrupting the whole vacation. Later, Morlun searches for Spider-man, in vain, as Peter and Mary-Jane are in one of Stark&amp;#039;s space pods, looking down upon the earth.\n\n\n&quot;Feral&quot; (Issues 23-27)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Angel Medina, Clayton Crain \nInker: Scott Hanna \nCurt Connors takes a look at &quot;The Rock of Life&quot; which causes a mysterious disease and causes many characters to become very angry, including Man-Wolf, Vermin, The Lizard, Black Cat, Puma and others. The Black Cat has the hardest time controlling her anger, almost killing The Lizard in a fury. Mary Jane also finds herself with a knife in a fit of rage. It is soon discovered that the rock was brought to New York by the villain Stegron with the aim of regressing all of humanity. Spider-Man, who has been able to show the most resistance to the rock, stops him.\n\n\n&quot;My Science Teacher is Spider-Man!!&quot; (Issue 28)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Clayton Crain \nInker: Scott Hanna \nDue to the events in &quot;Civil War&quot;, Spider-Man has unmasked to the world. Jordan Harrison, one of Peter&amp;#039;s students, is shocked to learn this. When Doctor Octopus discovers that Spider-Man was only fifteen when he first defeated him, he goes on a rampage through New York. Jordan Harrison distracts Doc Ock so Spidey can knock him out.\n\n\n&quot;The Deadly Foes of Peter Parker&quot;(Issue 29-31)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Angel Medina \nInker: Scott Hanna \nNow that the world knows Spidey&amp;#039;s identity, The Chameleon arranges his deadliest foes to go after his loved ones. Black Cat is angry that Spider-Man has gone public, but she teams up with him to stop his foes all the same.\n\n\n&quot;The Husband Or The Spider?,&quot; &quot;Wounds,&quot; and &quot;Nothing Can Stop the Rhino&quot; (Issues 32-34)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Sean Chen \nThese three issues deal with how the women in Spider-Man&amp;#039;s life are affected by his unmasking. The issues deal with Mary Jane Watson-Parker, Aunt May, and the Black Cat respectively. The storyline focuses on each of the women reacting to not only Peter&amp;#039;s public unmasking, but also a brutal beating that Peter receives at the hands of the Rhino.\n\n\n&quot;The Strange Case Of...&quot; (Issues 35-37)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Angel Medina (#35), Ramon Bachs (#36-#37) \nSpider-Man copycats start turning up in Manhattan, with some of them having the same powers as Peter. After Spider-Man finds one of them and sees that something is seriously wrong, he takes him to see Mr. Fantastic while Doc Connors investigates the strange fluids on a blanket the doppelganger had been in contact with.\n\n\n&quot;The Last Temptation of Eddie Brock&quot; (Issues 38-39)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Lee Weeks \nEddie Brock, wasting away from cancer, finds that Peter&amp;#039;s Aunt May is in the very same hospital, and he hatches one final plan to take his revenge against Spider-Man.\n\n\n&quot;The Book of Peter&quot; (Issue 40)\nWriter: Roberto Aguirre-Sacasa \nPenciller: Clayton Crain \nPeter&amp;#039;s guilt deepens as he fears that his Aunt May will die from injuries sustained during an attack that was targeted at him. Peter reflects on the amount of death and tragedy he has encountered (Uncle Ben, Gwen Stacy, etc.) due to his leading a double-life as Spider-Man. As his anger and despair consume him, he is visited by a mysterious stranger who conveys to him that in life tragedy effects everyone in some form or another. Also, he explains that due to Spider-Man&amp;#039;s heroic efforts, many people are alive and well, and that should bring him some comfort. While alleviating some of Peter&amp;#039;s guilt, the information doesn&amp;#039;t change the helplessness that Peter feels towards his situation. The story concludes with the stranger telling Peter have faith...\n\n\n&quot;One More Day&quot; Part 3 of 4 (Issue 41)\nWriter: J. Michael Straczynski \nPenciller: Joe Quesada \nSee &quot;One More Day&quot; article for synopsis.\n\nNOTE: Issue #41 marks the final &quot;The Sensational Spider-Man (vol. 2)&quot; issue. At the conclusion of the &quot;One More Day&quot; storyline, This book and &quot;Friendly Neighborhood Spider-Man&quot; will be merged into &quot;Amazing Spider-Man&quot; which will begin publication 3 times a month starting in 2008.\n\n","torrent":{"xt":"urn:btih:a8d425b6a5e908e4a80e8daaeb5725433a188571","amp;dn":"Marvel+Knights+Spider-Man+%26+Sensational+Spider-Man+v2+%28Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d425b6a5e908e4a80e8daaeb5725433a188571","infoHashBuffer":{"type":"Buffer","data":[168,212,37,182,165,233,8,228,168,14,141,170,235,87,37,67,58,24,133,113]},"announce":[],"urlList":[]}}