{"title":"Democracy Now - 23 feb 2012","uid":7053160,"size":457189015,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aa99c1ad6235f2d988613fa1973aca0ac5fce965&amp;dn=Democracy+Now+-+23+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1330015768,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 23, 2012\n\n- Iraq: Dozens Killed in Wave of Violence\n- Afghan Soldier Kills 2 U.S. Troops as Koran Protests Intensify\n- Syria: Homs Shelled, U.N. Plans Humanitarian Visit\n- Bradley Manning Faces Arraignment on WikiLeaks Charges\n- U.N. Officials Announce Failure of Iran Visit\n- Former U.S. Resident Jailed at Gitmo Reaches Plea Deal\n- U.S. Marine Convicted in Iraq Massacre Discharged Under Honorable Conditions\n- U.S. Troops Deployed to Fight LRA Rebels in 4 African Countries\n- Newark Mayor: NYPD Hid Spying on Muslims\n- Virginia Ultrasound Bill Altered After Protests\n- Oscar Grant's Cousin Shot, Wounded by Oakland Police\n- Obama Visits Future Site of African-American History Museum\n- UC-Davis Pepper Spraying Victims File Suit\n- Publisher Barney Rosset Dies at 89\n\n\nSpecial reports\n\n- Republicans Debate in Arizona As GOP Faces Backlash in State Over Extremist, Anti-Immigrant Policies\n\nWith Maricopa County Sheriff Joe Arpaio in the audience, leading Republican candidates Mitt Romney and Rick Santorum praised Arizona's crackdown on immigration during a debate on Thursday night. Romney vowed to drop the Obama administration's immigration lawsuits against the state of Arizona on the first day of his presidency. Santorum said police across the country should be given, &quot;the opportunity to do what they're doing here in Arizona and what Sheriff Arpaio was doing before he ran into some issues with the federal government.&quot; Santorum's comment comes just months after a federal Department of Justice investigation found &quot;a pervasive culture of discriminatory bias against Latinos&quot; in Arpaio's office. Arizona journalist Terry Greene Sterling says, &quot;Republican overreach&quot; could lead to an Obama victory in Arizona in November. &quot;What has happened in Arizona is that the Arizona Legislature has been taken over by the extreme right-wing of the Arizona Republican Party. An agenda of extremist bills has been passed and proposed,&quot; Greene Sterling says. &quot;As a result, Democrats are saying, 'Wait a minute. We think we can win moderates and independents into our wing.'&quot;\n\n\n- Under Fire Over Earmarks &amp; Spending Record, Rick Santorum Seen As D.C. Insider, Culture Warrior\n\nFormer Pennsylvania Senator Rick Santorum repeatedly came under criticism at Wednesday's debate over his voting record in Washington. We speak to Will Bunch of the Philadelphia Daily News, author of the recent article, &quot;A Pennsylvanian's Guide to the Rick Santorum You Don't Know.&quot; &quot;There's basically two sides of Santorum,&quot; Bunch says. &quot;One is the culture warrior side, and that's the side we tend to talk about most in the media: The abortion, the gay rights stuff, the contraception stuff. But the other side of Rick Santorum, and one that I've written about a lot over the years, is the Washington insider Rick Santorum.&quot;\n\n\n- Sen. Russ Feingold, New Obama Election Co-Chair: &quot;The President Is Wrong&quot; To Accept Super PAC Money\n\nOne of the newly named co-chairs of President Obama's re-election campaign is openly criticizing the President's decision to accept super PAC funds, his record on civil liberties and his handling of the war in Afghanistan. Former U.S. Senator Russ Feingold of Wisconsin has described Obama's decision on super PACs as &quot;dancing the with the devil.&quot; At the time Feingold was named a campaign election co-chair on Wednesday, the lead headline on his organization's website read: &quot;The President Is Wrong.&quot; &quot;I think it's a big mistake to go down the road of unlimited, undisclosed corporate contributions,&quot; Feingold says. &quot;That's not who Barack Obama is, that's not who the Democratic Party should be, and I think it doesn't help him get re-elected. I think it delivers the Democrats as well as the Republicans to corporate power and corporate domination.&quot; Feingold served in the U.S. Senate for 18 years. During that time, he wrote the landmark campaign finance law McCain-Feingold. He also opposed the war in Iraq and was the only senator to vote against the USA PATRIOT Act. After he he lost his re-election bid in 2010, he is founded the organization Progressives United. His new book is called, &quot;While America Sleeps: A Wake-Up Call for the Post-9/11 Era.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:aa99c1ad6235f2d988613fa1973aca0ac5fce965","amp;dn":"Democracy+Now+-+23+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa99c1ad6235f2d988613fa1973aca0ac5fce965","infoHashBuffer":{"type":"Buffer","data":[170,153,193,173,98,53,242,217,136,97,63,161,151,58,202,10,197,252,233,101]},"announce":[],"urlList":[]}}