{"title":"Captain Marvel v1","uid":4747625,"size":582305903,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ab39b661fab2d463147ddcdc1f7ed8fc4f6ea27e&amp;dn=Captain+Marvel+v1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zero_Assassin","files":63,"time":1235972088,"description":"\tCaptain Marvel is the name of several fictional characters, superheroes appearing in comic books published by Marvel Comics. Most of these versions exist in Marvel's main shared universe, known as the Marvel Universe.\n\n\nThe first of these is an alien military officer, Captain Mar-Vell of the Kree Imperial Militia, who is sent to observe the planet Earth. Mar-Vell eventually wearies of his superiors' malign intent and allies himself with Earth as the Kree Empire brands him a traitor. From then on, Mar-Vell fights to protect Earth from all threats. Captain Mar-Vell was created by Stan Lee and Gene Colan in Marvel Super-Heroes #12 (Dec. 1967).\n\nHe would later be revamped by Roy Thomas and Gil Kane. Having been exiled to the Negative Zone by the Supreme Intelligence, the only way Mar-Vell can temporarily escape is to exchange atoms with Rick Jones by means of special wristbands called Nega-Bands. He is also given superpowers and his Kree military uniform is replaced with a form fitting costume.\n\nWith the title's sales still fledgling, Marvel allowed Jim Starlin to conceptually revamp the character, although his appearance was little changed. Mar-Vell is freed from the Negative Zone and becomes a cosmic champion, the &quot;Protector of the Universe&quot; appointed by the cosmic entity Eon. Together, Mar-Vell and Rick continue to battle against evil, most notably battling the Death-worshipping Thanos. Mar-Vell became a close ally of the Titans, and one of their number, Elysius, became his lover.\n\nHowever, his career was cut short when he developed inoperable cancer, the result of an earlier exposure to toxic nerve gas during a battle with Nitro. He died from this cancer on Titan in the presence of the Marvel Universe's superhero community, as chronicled in Marvel's first large-format graphic novel, The Death of Captain Marvel.","torrent":{"xt":"urn:btih:ab39b661fab2d463147ddcdc1f7ed8fc4f6ea27e","amp;dn":"Captain+Marvel+v1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab39b661fab2d463147ddcdc1f7ed8fc4f6ea27e","infoHashBuffer":{"type":"Buffer","data":[171,57,182,97,250,178,212,99,20,125,220,220,31,126,216,252,79,110,162,126]},"announce":[],"urlList":[]}}