{"title":"SycAmour - All Current Songs (2012)","uid":7211626,"size":37854924,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ac217792d6030cc14f6e23b60def14544e2c4387&amp;dn=SycAmour+-+All+Current+Songs+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SycAmour","files":5,"time":1335256219,"description":"SycAmour - Get With The Times, New Roman!\nSycAmour - Crassinova\nSycAmour - Mana Fontannah\nSycAmour - Dance Dance (Cover of Fallout Boy's Dance Dance)\nSycAmour - Set Fire To The Rain (Cover of Adele's Set Fire To The Rain)\n\n\n----------------------------------\n\n\n\t\nWe Will Rape And Pillage Your Ears...And You Will Like It...\n\nBut seriously, we're SycAmour (like the tree) and we want to make music that creates a force in people.\n\nWe want our music to inspire emotions, make movement and bring about thought.\nWe strive for both rebellion and conformity, technical and catchy, light and dark, spine-smashing breakdowns and hip-swinging dance parties. We want the best of all aspects of music to meet at an equilibrium. An equilibrium that we can call ourselves.\n\nWe want people to drop hate and pick up love and conviction. There's enough bullshit in the world to throw global rodeo, and we want to be a part of the clean-up crew. On top of that we want anyone who we can touch to be a part of it.\nMusic, obviously is a rather indirect way of promoting truth and peace in the world. Hardcore music is an even more indirect way. But as much as we love our fans, friends and supporters, when it comes down to it, this is about us.\nWe make music because we love to. If you love what we do, then we're happy to share the experience with you. But we promise to never be one of these bands that change solely based on popular opinion. We owe it to anyone who ever does anything to support us, to stay true to what we want to do, for them.\n\nWe're SycAmour from Belleville and Ypsilanti Michigan, and this is our passion.\t","torrent":{"xt":"urn:btih:ac217792d6030cc14f6e23b60def14544e2c4387","amp;dn":"SycAmour+-+All+Current+Songs+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac217792d6030cc14f6e23b60def14544e2c4387","infoHashBuffer":{"type":"Buffer","data":[172,33,119,146,214,3,12,193,79,110,35,182,13,239,20,84,78,44,67,135]},"announce":[],"urlList":[]}}