{"title":"Food Production and Population Growth - Daniel Quinn &amp; Alan D. T","uid":4206438,"size":1473351939,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac341be2a3bcdbbfd2bac7c1de84d5a5ebe54b43&amp;dn=Food+Production+and+Population+Growth+-+Daniel+Quinn+%26+Alan+D.+T&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jsmith12345","files":3,"time":1211828106,"description":"FOOD PRODUCTION AND POPULATION GROWTH\nWhy the greatest crisis in human history is being faced in OUR generation.\n\nDaniel Quinn\nAlan D. Thornhill, PhD.\n\nISBN 1-885664-01-X\nVHS approximately 3 hours\nwww.newtribalventures.com\n\n\nIn his remarkable books, Daniel Quinn has made it clear that the version of history our children learn in school is fundamentally skewed and falsified to reflect and condone our culture&amp;#039;s world-devouring advance. But this isn&amp;#039;t the only fundamental lie our children learn in school about &quot;how things came to be this way.&quot; They&amp;#039;re also given a false understanding of the origins and future of our disastrous population explosion.\n\nIn November 1998 Daniel Quinn and biologist Alan D. Thornhill met in dialogue with a small group in Houston, Texas, to forge a new tool designed to unseat the unexamined conventional wisdom that typically shapes all discourse on this subject.\nThis videotape program is that tool.\n\n\nDaniel Quinn is best known as the author the prize-winning novel Ishmael, which is available in 18 languages worldwide and has been used in hundreds of classrooms all over North America from mid-school to graduate school in courses as varied as history, geography, biology, economics, sociology, anthropology, philosophy, religion, and literature. He has addressed students and faculty at the University of Massachusetts, the University of Texas, Salisbury State University, Elon College, Baylor University, Texas A&amp;M, Virginia Tech, Carnegie Mellon University, Rice University, Kent State University, and elsewhere.\n\nAlan D. Thornhill, Ph.D., is Executive Director of the Society for Conservation Biology, an international professional organization representing over 6000 scientists and practitioners (from more than 90 countries) dedicated to promoting the scientific study of the phenomena that affect the maintenance, loss, and restoration of biological diversity on Earth. Previously he has been the Director of Learning and Communications for the Conservation Science Division of the Department of The Nature Conservancy and an Assistant Professor of Biology in the Department of Ecology and Evolutionary Biology at Rice University, Houston, Texas. He is actively involved in research exploring the ecological effects of human encroachment on natural ecosystems and the use of technology in education and communications.","torrent":{"xt":"urn:btih:ac341be2a3bcdbbfd2bac7c1de84d5a5ebe54b43","amp;dn":"Food+Production+and+Population+Growth+-+Daniel+Quinn+%26+Alan+D.+T","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac341be2a3bcdbbfd2bac7c1de84d5a5ebe54b43","infoHashBuffer":{"type":"Buffer","data":[172,52,27,226,163,188,219,191,210,186,199,193,222,132,213,165,235,229,75,67]},"announce":[],"urlList":[]}}