{"title":"Shelly Manne - 1962 - Steps to the Desert (2004) FLAC","uid":8380778,"size":331710749,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae14f88233f683a63c39c0734b4ef208c540ce62&amp;dn=Shelly+Manne+-+1962+-+Steps+to+the+Desert+%282004%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1366153132,"description":"Shelly Manne - 1962 - Steps to the Desert (2004)\n\nWhen Shelly Manne recorded Steps to the Desert in 1962, John Coltrane was among the most controversial musicians in jazz. Some people praised Coltrane's modal innovations; others detested his post-bop work and even went so far as to describe it as &quot;anti-jazz&quot; (which is simply ridiculous). Arguably, Steps to the Desert is Manne's way of acknowledging the influential saxophonist; the CD has a modal orientation, and it indicates that the Los Angeles-based drummer was paying close attention to Coltrane in the early '60s. Not that Steps to the Desert is actually meant to be a tribute to the influential saxman -- if Coltrane (or for that matter, Miles Davis or Yusef Lateef) showed Manne the possibilities of modal jazz, he certainly embraces it on his own terms. Steps to the Desert finds Manne and five other West Coast jazzmen (including trumpeter/flugelhornist Shorty Rogers, tenor saxman Teddy Edwards, vibist/pianist Victor Feldman, guitarist Al Viola and bassist Monty Budwig) providing post-bop interpretations of songs that have some type of Jewish connection, and the material ranges from traditional favorites like &quot;Hava Nagila,&quot; &quot;Yossel, Yossel&quot; (also known as &quot;Joseph, Joseph&quot;) and &quot;Zamar Nodad&quot; to Ernest Gold's &quot;Exodus&quot; (which a hit for French vocalist Edith Piaf). Coltrane never recorded an album with a Jewish theme; he did, however, show a strong appreciation of modal music from India, the Middle East and North Africa, and Jewish music is certainly part of the modal family. If Coltrane had decided to record a bunch of Yiddish and Israeli songs, they probably would have worked as well for him as they work for Manne on Steps to the Desert -- which is among the most intriguing and memorable sessions that he recorded in the early '60s. (AllMusic)\n\nTrack list:\n01 - Hava Nagila (Come let's be happy)\n02 - Bei mir bist du schoen\n03 - Yossel, Yossel\n04 - Zamar Nodad\n05 - Bokrei Lachish\n06 - Tzena\n07 - Exodus\n08 - Die greene Koseene\n09 - My Yiddishe Momme\n10 - Orchah Bamidbar (steps to the desert)\n11 - Zamare Nodad (single edit)\n12 - Exodus (single edit)\n13 - Tzena (single edit)\n14 - Hava Nagila (single edit)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:ae14f88233f683a63c39c0734b4ef208c540ce62","amp;dn":"Shelly+Manne+-+1962+-+Steps+to+the+Desert+%282004%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae14f88233f683a63c39c0734b4ef208c540ce62","infoHashBuffer":{"type":"Buffer","data":[174,20,248,130,51,246,131,166,60,57,192,115,75,78,242,8,197,64,206,98]},"announce":[],"urlList":[]}}