{"title":"Great Lakes Myth Society - Great Lakes Myth Society [2005][EAC,l","uid":8742248,"size":340797057,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae7ad82c9c8e5df8fcf3c85f7051227fb1f36b75&amp;dn=Great+Lakes+Myth+Society+-+Great+Lakes+Myth+Society+%5B2005%5D%5BEAC%2Cl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1374818591,"description":"Artist: Great Lakes Myth Society\nRelease: Great Lakes Myth Society\nReleased: 2005\nLabel: Stop, Pop, and Roll \nCatalog#: SPR005\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: folk rock\n\n1. 3.27 The Salt Trucks\n2. 4.14 Across the Bridge \n3. 4.31 Love Story\n4. 3.46 Buffalo Nickel\n5. 3.20 Big Jim Hawkins\n6. 1.13 Marquette County, 1959\n6. 3.42 Seeds for Sale\n7. 3.04 Pining, Drinking, Understanding\n8. 3.21 Isabella County, 1992\n9. 3.20 No. VI\n10. 2.46 The Northern Lights Over Atlanta, Michigan\n11. 3.30 The Foolish Motives of Lost Debates\n12. 1.28 Railway Ties\n13. 4.05 Cottonmouth\n14. 4.59 Lake Effect\n\nFew bands state their intent as clearly in their very name as the Great Lakes Myth Society. The members of this southeastern Michigan-based quintet are singularly captivated with their home state, conjuring legends from the past and meditating on living in the state in the present day. These obsessions bubbled to the surface on H.O.M.E.S., Vol. 1, the 2001 second album by the Original Brothers and Sisters of Love, which is the former incarnation of the Great Lakes Myth Society. Four years later and minus one member -- violinist/vocalist Elisabeth Auchinvole, who nevertheless is present on the Great Lakes Myth Society's eponymous 2005 debut, and even receives a &quot;featuring&quot; special billing in the credits -- the group re-emerges as a similar but distinctly different beast, at once stronger, stranger, and all the more compelling than before. While the blending of folk, rock, pop, and prog will be familiar to anyone acquainted with the two TOBASOL albums, Great Lakes Myth Society explores more territory and delves deeper than either of those two records, resulting in an album that tantalizingly hangs in a place just out of time and fashion. What's most fascinating about the album is that the band's two main singer/songwriters, the brothers James Christopher and Timothy Monger, reach common ground by following two different paths. James' songs are rough and ragged, rooted in folk and written with a romanticized American gothic bent; his tunes give the album muscle and bone, as well as a haunted soul. Timothy, in contrast, has a softer touch, crafting sweet, breezy pop tunes that are gentle as spring, but never cloying or precious. While the differing perspectives of the Mongers complement each other well, they're tied together by the band's third singer/songwriter, Gregory Dean McIntosh -- the George Harrison to the Lennon/McCartney of James and Timothy. McIntosh's songs on Great Lakes Myth Society fall halfway between James' dark, robust, oversized folktales and Timothy's smaller-scaled, precisely detailed songs, recalling the mood of the former and the introspection of the latter. Throughout it all, certain musical signatures are shared -- sighing vocal harmonies out of '60s sunshine pop, folk instrumentation played with rock vigor, flourishes of violins or jazz horns, strong memorable melodies that make the complex, suite-like songs sound fluid -- and it's all grounded by the sinewy rhythm section of bassist J. Scott McClintock and drummer Fido Kennington, who provide a center for the adept multi-instrumental skills of the Mongers and McIntosh. It all results in a spellbinding, fascinating album, one that sounds like little else in the past or present.","torrent":{"xt":"urn:btih:ae7ad82c9c8e5df8fcf3c85f7051227fb1f36b75","amp;dn":"Great+Lakes+Myth+Society+-+Great+Lakes+Myth+Society+%5B2005%5D%5BEAC%2Cl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae7ad82c9c8e5df8fcf3c85f7051227fb1f36b75","infoHashBuffer":{"type":"Buffer","data":[174,122,216,44,156,142,93,248,252,243,200,95,112,81,34,127,177,243,107,117]},"announce":[],"urlList":[]}}