{"title":"Zorro Rides Again (1937) Xvid - Western Theatrical Serial - 12 C","uid":9219944,"size":2029555712,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aea22486d643ee13a11d575669889d37d0f64639&amp;dn=Zorro+Rides+Again+%281937%29+Xvid+-+Western+Theatrical+Serial+-+12+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1384918201,"description":"Zorro Rides Again (1937) Xvid - Western Theatrical Serial - 12 Chapters [DDR]\n\nZorro Rides Again (1937) is a 12-chapter Republic Pictures film serial. \n It was the eighth of the sixty-six Republic serials, the third with a western theme (a third of Republic's serials were westerns) and the last produced in 1937. \nThe serial was directed by William Witney &amp; John English and starred John Carroll as a modern descendant of the original Zorro. \nThe plot is a fairly standard western storyline about a villain attempting to illicitly take valuable land (in this case a new railroad). \nThe setting is a hybrid of modern (1930s) and western elements that was used occasionally in B-Westerns (such as the western feature films also produced by Republic).\n\n    CAST:-\n    John Carroll as James Vega and his masked alter ego Zorro. \n    Helen Christian as Joyce Andrews\n    Reed Howes as Phillip Andrews\n    Duncan Renaldo as Renaldo\n    Noah Beery, Sr. as J. A. Marsden\n    Richard Alexander as Brad &quot;El Lobo&quot; Dace\n    Nigel De Brulier as Don Manuel Vega\n    Robert Kortman as Trelliger\n    Jack Ingram as Carter\n    Roger Williams as Manning\n    Edmund Cobb as Larkin\n    Mona Rico as Carmelita\n    Tom London as O'Shea\n    Harry Strang as O'Brien\n    Jerry Frank as Duncan\n\nDirected by William Witney, John English\nProduced by Sol C. Siegel\nWritten by Franklin Adreon, Morgan Cox, Ronald Davidson, John Rathmell, Barry Shipman, Johnston McCulley (original Zorro novel)\n\n    CHAPTERS:-\n    01. Death from the Sky: Zorro, Joyce and Philip, aboard a train, are bombed \n        from the air by El Lobo. \n    02. The Fatal Minute: Knocked unconscious in a warehouse, Zorro is caught in \n        the detonation of a hidden bomb. \n    03. Juggernaut: Zorro's foot is caught in the tracks of a railroad, helpless \n        before an oncoming Express Train.\n    04. Unmasked: Under cover of his heavies' guns, El Lobo reaches to remove \n        Zorro's mask.\n    05. Sky Pirates: Zorro's plane comes under fire as it taxies for takeoff.\n    06. The Fatal Shot: Fighting Trelliger, Zorro falls to the courtyard. El Lobo \n        pulls a gun on the prone vigilante.\n    07. Burning Embers: Zorro is caught in a burning building when the floor gives \n        way beneath him.\n    08. Plunge of Peril: Attempting to escape on a funicualr railway, Zorro \n        plummets down a cliff.\n    09. Tunnel of Terror: Zorro is trapped atop the carriage of a train as it \n        enters a tunnel - which explodes.\n    10. Trapped: In a rooftop chase, Zorro loses his balance and falls from the \n        skyscraper.\n    11. Right of Way: Zorro, in a truck, is set for a collision with El Lobo, in a \n        train.\n    12. Retribution: \n\nSYNOPSIS:- Zorro Rides Again (1937)\nIn contemporary (for the 1937 production) California, villain J. A. Marsden aims to take over the California-Yucatan Railroad with the aid of his henchman El Lobo. The rightful owners, Joyce and Phillip Andrews, naturally object. Their partner, Don Manuel Vega summons his nephew, James Vega, to help them as he is the great grandson of the original Zorro, Don Diego de la Vega. He is disappointed, however, to find that his nephew is a useless fop (presumably Don Manuel had not paid too much attention to his family history).\n\nNevertheless, James Vega installs himself in the original Zorro's hideout and adopts the Zorro identity to defeat Marsden and El Lobo. This Zorro uses twin pistols and (like the original Zorro) a whip as his main weapons of choice, rather than a more traditional sword.\n\nThe California-Yucatan Railroad, being built for the good of Mexico, is under siege by a gang of terrorists hoping to force its sale; no one can prove their connection to profiteer Marsden. Manuel Vega, aged co-owner, calls in the aid of his nephew James, great-grandson of the original Zorro. Alas, James seems more adept at golf than derring-do; but after he arrives, Zorro rides again! Can one black-clad man on horseback defeat a gang supplied with airplanes and machine guns\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 3:32:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 3:32:00","torrent":{"xt":"urn:btih:aea22486d643ee13a11d575669889d37d0f64639","amp;dn":"Zorro+Rides+Again+%281937%29+Xvid+-+Western+Theatrical+Serial+-+12+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aea22486d643ee13a11d575669889d37d0f64639","infoHashBuffer":{"type":"Buffer","data":[174,162,36,134,214,67,238,19,161,29,87,86,105,136,157,55,208,246,70,57]},"announce":[],"urlList":[]}}