{"title":"Omraam Mickhaël Aïvanov - 42 livres au format epub","uid":13078381,"size":32444793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aeb19eaa13308b7de394e14c1b5572b3b105fad4&amp;dn=Omraam+Mickha%26euml%3Bl+A%26iuml%3Bvanov+-+42+livres+au+format+epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":43,"time":1450876251,"description":"Omraam Mickhaël Aïvanov - 42 livres au format epub\r\n\r\nC'est en 1937 que Omraam Mikhaël Aïvanhov (1900-1986), philosophe et pédagogue français d'origine bulgare, est arrivé en France.\r\nJusqu'en 1986, Omraam Mikhaël Aïvanhov a donné près 5000 conférences, essentiellement en France et en Suisse, mais aussi au Canada, aux Etats-Unis, en Inde, en Suède et en Norvège. Il n'a pas écrit, et ses conférences, toujours improvisées, ont été soit sténographiées, soit enregistrées sur bandes magnétiques ou video-cassettes.\r\nEncore en cours de parution, elles sont éditées et diffusées par les Éditions Prosveta qui sont présentes sur les cinq continents, et traduites en plus de 30 langues.\r\nLargement diffusée en Occident dès le dernier tiers du 20e siècle, l'influence de la pensée d'O. M. Aïvanhov ne cesse de grandir. Nombreuses sont les personnes qui s'en inspirent pour la conduite de leur propre vie ce dont nous ne cessons de recevoir des témoignages ; d'autres y trouvent matière à écrire eux-mêmes des ouvrages traitant de spiritualité, de philosophie, de religion, d'ésotérisme, de yoga, de psychologie, de médecine.\r\nToutes sont sensibles au caractère vivant et concret de son enseignement : les analogies qu'il fait apparaître entre le monde physique et le monde psychique, les différentes méthodes qu'il donne rendent non seulement accessibles mais applicables les notions philosophiques les plus abstraites. Si on ne l'applique pas, disait-il, la meilleure des philosophies est presque inutile.\r\nNombreux sont aussi les lecteurs qui reconnaissent que cet enseignement est particulièrement adapté à notre temps. Enfin, Omraam Mikhaël Aïvanhov n'a cessé de répéter que la pratique spirituelle, qui est en général considérée comme une démarche purement personnelle, doit tenir compte des liens qui unissent les humains entre eux. Pour lui le mot « fraternité » prend là tout son sens","torrent":{"xt":"urn:btih:aeb19eaa13308b7de394e14c1b5572b3b105fad4","amp;dn":"Omraam+Mickha%26euml%3Bl+A%26iuml%3Bvanov+-+42+livres+au+format+epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aeb19eaa13308b7de394e14c1b5572b3b105fad4","infoHashBuffer":{"type":"Buffer","data":[174,177,158,170,19,48,139,125,227,148,225,76,27,85,114,179,177,5,250,212]},"announce":[],"urlList":[]}}