{"title":"Ed Schultz Show - February 22 2013 ","uid":8179047,"size":43156540,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b0094280621c446b21d49482212ad860bdba3d53&amp;dn=Ed+Schultz+Show+-+February+22+2013+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":3,"time":1361590489,"description":"Friday, February 22, 2013\nEd Schultz Show\n\n\nSen. Sherrod Brown, D-OH, joins the 1st hour of Friday's show to discuss avoiding the sequestration.\n\nGeoff Freeman, Chief Operating Officer at the U.S. Travel Association, joins the 2nd hour of Friday's show to discuss how sequestration will affect air travel.\n\nJohn Nichols, Washington Correspondent for The Nation Magazine, joins the 2nd hour of Friday's show to discuss the news of the day.\n\nAdam Green, Co-founder of the Progressive Change Campaign Committee, joins the 3rd hour of Friday's show to discuss keeping entitlement programs off the table.\n\nPresident Barack Obama expressed doubt on Thursday that a deal can be struck with Republican lawmakers by a March 1 deadline to head off the start of $85 billion in spending cuts. We'll give you the details.\n\nAfter weeks without talks on the U.S. budget crisis, President Barack Obama called Republican leaders on Thursday to discuss the harsh &quot;sequestration&quot; cuts to government spending due to begin in just over a week. We'll talk about it.\n\nChuck Hagel's path to confirmation as President Barack Obama's new secretary of defense became more secure on Thursday when Republican Senator Richard Shelby said he would support the nomination. We'll bring you the latest.\n\nand the latest news, Friday on The Ed Schultz Show.","torrent":{"xt":"urn:btih:b0094280621c446b21d49482212ad860bdba3d53","amp;dn":"Ed+Schultz+Show+-+February+22+2013+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0094280621c446b21d49482212ad860bdba3d53","infoHashBuffer":{"type":"Buffer","data":[176,9,66,128,98,28,68,107,33,212,148,130,33,42,216,96,189,186,61,83]},"announce":[],"urlList":[]}}