{"title":"Russian Synodal","uid":9012840,"size":22536926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0aaa0a7c1c9e6350c4c3bfd3a9abe8a2b5b6c78&amp;dn=Russian+Synodal&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"booksservice","files":12,"time":1381139755,"description":"The complete work was published in 1876. The final editorship was performed by the Synod and personally by Filaret, Metropolitan of Moscow. The translation of the Old Testament is based on the Jewish Masoretic Text while that of the New Testament is based on the Greek printed editions of that time.[2] This decision was grounded on Filaret's 1834 note &quot;On the need of the Russian Church for a translation of the whole Bible from the original texts to the modern Russian language&quot;. The permission to use the Masoretic Text as preserved by the Jews (rather than relying on the Septuagint and/or the Church Slavonic translations as preserved by the Christians) was granted to Filaret by the Synod in 1862. Though the linguistic norms of the Russian language have changed since the early editions, some features remained untouched. Due to its vocabulary resemblance to the Church Slavonic language, the Synodal version helped shape some distinctive Slavonic-inspired features used both in the Russian spoken language and in Russian literature up to now.","torrent":{"xt":"urn:btih:b0aaa0a7c1c9e6350c4c3bfd3a9abe8a2b5b6c78","amp;dn":"Russian+Synodal","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0aaa0a7c1c9e6350c4c3bfd3a9abe8a2b5b6c78","infoHashBuffer":{"type":"Buffer","data":[176,170,160,167,193,201,230,53,12,76,59,253,58,154,190,138,43,91,108,120]},"announce":[],"urlList":[]}}