{"title":"3OH!3 - Don't Trust Me(Peak Position #42 This Week)(Rage)-Wusha","uid":4807014,"size":89747532,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b12d193c0490d50970d216fff8f3c03c48b68510&amp;dn=3OH%213+-+Don%5C%27t+Trust+Me%28Peak+Position+%2342+This+Week%29%28Rage%29-Wusha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wushan","files":1,"time":1238238061,"description":"\n                                Don't Trust Me\n\n                               Single by 3OH!3\n\n                              from the album Want\n\n   &quot;Don't Trust Me&quot; is the second single by the electronica band 3OH!3 released in 2008 and the third track of their debut album Want. This single earned certified gold in just several months after its release.\n\n\n   &quot;Don't Trust Me&quot; was released on July 8, 2008 as the lead-off single for the band's label debut. The song received a considerable amount of airplay on radio stations near 3OH!3's hometown of Boulder, Colorado and on Sirius Satellite Radio. It has also seen playtime on the radio station &quot;KISS FM 106.1&quot; in Dallas. It has been receiving some airplay in Australia on various stations on the Austereo Network. The song is also featured on the game, Tap Tap Revenge for the iPhone and iPod Touch. 3OH!3 is number 27 on the top 50 Hits List on Yahoo!.com.\n\n\n                             A Funny Music video\n\n   The video begins with words being typed on the screen stating &quot;A global virus of catastrophic proportions has attacked the entire male population. Only two male models from Colorado survive...this is their story&quot;. The screen shifts to a shot of the band at a photo shoot, wearing Ginch Gonch underwear with scantily clad female models posing behind them. The set resembles that of a hotel. Another photo shoot takes place at a set resembling a high school wrestling match, where they are dressed in neon-colored tights and headbands. The last photo shoot is in the prehistoric era, and the band is dressed as cavemen. The video ends with a shot of a mushroom cloud, and the words &quot;Transmission terminated&quot; are typed onto the screen.\n\n                           ***Don't Trust Me.***\n\n\n                              (In DvD Quality)\n\n\n                                  Enjoy!!!","torrent":{"xt":"urn:btih:b12d193c0490d50970d216fff8f3c03c48b68510","amp;dn":"3OH%213+-+Don%5C%27t+Trust+Me%28Peak+Position+%2342+This+Week%29%28Rage%29-Wusha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b12d193c0490d50970d216fff8f3c03c48b68510","infoHashBuffer":{"type":"Buffer","data":[177,45,25,60,4,144,213,9,112,210,22,255,248,243,192,60,72,182,133,16]},"announce":[],"urlList":[]}}