{"title":"Democracy Now - 13 jan 2012","uid":6953574,"size":457603981,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b1300c41c54b11066545567d8a9b0ffb8a94ba63&amp;dn=Democracy+Now+-+13+jan+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326494782,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Jan 13, 2012\n\n- Presiding Officer Recommends Court-Martial for Manning\n- Report: U.S. Uses Secret Channel to Warn Iran Strait Closure a &quot;Red Line&quot;\n- U.S. Identifies 2 Marines in Urination Video\n- Gingrich Claims Pressure from &quot;Extraordinarily Wealthy Institutions&quot; to Drop Bain Criticism\n- Nigerian Oil Workers Set Sunday Deadline to Restore Fuel Subsidy\n- Tucson Suspends Ethnic Studies Program under Threat of Funding Cut\n- Mocking Super PACs, Colbert Enters GOP Presidential Field in South Carolina\n- Dozens Arrested in Anti-Torture Protest Outside White House\n\n\nSpecial reports\n\n- 2 Years After Devastating Earthquake, Haiti's Rebuilding Weighed Down by Legacy of Foreign Meddling\n\nOn the second anniversary of the devastating earthquake in Haiti that killed roughly 300,000 people and left more than 1.5 million homeless, we speak with Randall Robinson, author of &quot;An Unbroken Agony: Haiti, from Revolution to the Kidnapping of a President.&quot; The United Nations estimates international donors gave Haiti over $1.6 billion in relief aid since the earthquake and more than $2 billion in recovery aid over the last two years. But critics say little of the funding made it directly to the Haitian people, instead going to international non-governmental organizations and private companies involved in the relief effort. &quot;I'm not surprised that the reconstruction efforts are not going well,&quot; Robinson says, &quot;because I don't think the United States, officially, ever wanted anything to go well in Haiti.&quot;\n\n\n- &quot;Memory is the Active Agent of Collective Social Progress&quot;: Randall Robinson on His New Novel Makeda\n\n&quot;Makeda,&quot; the new novel by TransAfrica founder Randall Robinson, is set at the dawn of the civil rights era. The book follows a young man coming of age in segregated Richmond, Virginia, who discovers his roots in Africa through his blind grandmother. &quot;Sometimes when we think of slavery, we calculate the economic consequence of it,&quot; Robinson says. &quot;But we have not calculated the psychosocial consequence of it, unless we factor in the loss of memory, which was occasioned by a deliberate and systematic program imposed by those who controlled us.&quot;\n\n\n- On Eve of MLK Day, Michelle Alexander &amp; Randall Robinson on the Mass Incarceration of Black America\n\nOn this eve of Dr. Martin Luther King, Jr.'s birthday, we host a wide-ranging discussion with TransAfrica founder Randall Robinson and author Michelle Alexander about the mass incarceration of African Americans that has rolled back many achievements of the civil rights movement. Today there are more African Americans under correctional control, whether in prison or jail, on probation or on parole, than there were enslaved in 1850. And more African-American men are disenfranchised now because of felon disenfranchisement laws than in 1870. Alexander, whose book &quot;The New Jim Crow: Mass Incarceration in the Age of Colorblindness&quot; is newly released in paperback, argues that &quot;[n]othing less than a major social movement has any hope of ending mass incarceration in America or inspiring a recommitment to [Martin Luther] King's dream... My view is that this has got to be a human rights movement. It's got to be a movement for education, not incarceration; for jobs, not jails; a movement that acknowledges the basic humanity and dignity of all people, no matter who you are or what you have done.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:b1300c41c54b11066545567d8a9b0ffb8a94ba63","amp;dn":"Democracy+Now+-+13+jan+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1300c41c54b11066545567d8a9b0ffb8a94ba63","infoHashBuffer":{"type":"Buffer","data":[177,48,12,65,197,75,17,6,101,69,86,125,138,155,15,251,138,148,186,99]},"announce":[],"urlList":[]}}