{"title":"Buck-O-Nine - Twenty-Eight Teeth (1997)","uid":6907749,"size":331010619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b15ffc0f35cf525eb3eb053d25b13bf2ed9e9cd7&amp;dn=Buck-O-Nine+-+Twenty-Eight+Teeth+%281997%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1324662590,"description":"Imagine that Joe Jackson had a younger brother who grew up listening to the punk and ska music of the late '70s (i.e., the Clash, the Specials), moved to California during the skate punk scene, and formed a band with six of his slacker friends, and you've got a good mental picture of the music on Twenty-Eight Teeth. Buck-O-Nine has the three-minute, get-in-get-out punk/pop aesthetic down to a science, which makes you wonder why they haven't hit it big by now. Surely one well-placed &quot;buzzworthy&quot; clip could have put these guys on the map, except that ska-punk has always been treated as a novelty in this country, and the door was opened just wide enough to let acts like No Doubt and Rancid slip through. Although it's likely little consolation to the band, the lack of commercial success has allowed Buck-O-Nine to stave off maturity, which is a major label's way of sucking the last bit of marrow from a band's vitality. True, Twenty-Eight Teeth is a slight step toward more commercial music for the septet, but the songs move so quickly that you hardly have time to think about it. Winning tunes abound: &quot;Round Kid,&quot; &quot;Tear Jerky,&quot; &quot;Jennifer's Cold,&quot; &quot;Twenty-Eight Teeth,&quot; &quot;Record Store.&quot; Yet the instrumental &quot;Peach Fish,&quot; which is a welcome reprieve from the rest of the record, points out a deficiency in their diet. Buck-O-Nine needs to give more time to the horn section and engage in the kind of loopy interplay that made the Specials so interesting. More frequent end rhyme would also be a nice touch, as it tends to reinforce the intrinsic tightness of the compositions. Minor complaints though, for a band on the bicuspid of a breakthrough.","torrent":{"xt":"urn:btih:b15ffc0f35cf525eb3eb053d25b13bf2ed9e9cd7","amp;dn":"Buck-O-Nine+-+Twenty-Eight+Teeth+%281997%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b15ffc0f35cf525eb3eb053d25b13bf2ed9e9cd7","infoHashBuffer":{"type":"Buffer","data":[177,95,252,15,53,207,82,94,179,235,5,61,37,177,59,242,237,158,156,215]},"announce":[],"urlList":[]}}