{"title":"Decision Support Systems for Risk-Based Management of Contaminat","uid":12462187,"size":6694103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1946ff6e14a75fbfa55c5bd76e1247135c9d23c&amp;dn=Decision+Support+Systems+for+Risk-Based+Management+of+Contaminat&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1442817056,"description":"Decision Support Systems for Risk-Based Management of Contaminated Sites (Springer, 2009).pdf\n\nISBN 978-0-387-09721-3\n\nThis book, after an introduction about the environmental and socio-economic relevance of contaminated sites in Europe and the United States, and about the risk-based environmental management concepts and principles, provides an analysis of the main steps and tools for the development of decision support systems: environmental risk assessment, multi-criteria analysis, spatial analysis and geographic information system, indices and indicators definition.\n\nIt is addressed primarily to environmental risk managers and to decision makers involved in a sustainable management process for contaminated sites, including contaminated lands, river basins and coastal lagoons. Decision support systems are intended to meet their needs. They must be aware of what decision support systems and capabilities are available so that they can decide which to use and what new systems should be developed. A secondary audience is the environmental scientists who gather data and perform assessments to support decisions. They provide input to the decision support systems and often implement the systems for the managers. Other audiences include developers of decision support systems, students of environmental science and members of the public who wish to understand the assessment science that supports remedial decisions","torrent":{"xt":"urn:btih:b1946ff6e14a75fbfa55c5bd76e1247135c9d23c","amp;dn":"Decision+Support+Systems+for+Risk-Based+Management+of+Contaminat","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1946ff6e14a75fbfa55c5bd76e1247135c9d23c","infoHashBuffer":{"type":"Buffer","data":[177,148,111,246,225,74,117,251,250,85,197,189,118,225,36,113,53,201,210,60]},"announce":[],"urlList":[]}}