{"title":"Tremors 2: Aftershocks(1996)DVDRip.AC3(ENG)-DROCK","uid":6798441,"size":735758338,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1e686ba2c836f2e34de52db30c30f6c9547b6d0&amp;dn=Tremors+2%3A+Aftershocks%281996%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320558293,"description":"The Graboids are back in this sequel to the campy comedy horror hit that finds luckless Earl Basset (Fred Ward) and survivalist Burt Gummer (Michael Gross) teaming up to destroy the monsters that are wrecking havoc in the Mexican oil fields. It\\\\\\'s been a good few years since Earl and Burt saved the town of Perfection, Nevada from the strange pre-Cambrian predators, and these days Earl is doing his best to find success as an ostrich farmer. Trouble is, none of Earl\\\\\\'s birds want to breed, and it looks as if the farm is about to go under. Just when it seems that things couldn\\\\\\'t get any worse for this monster-slaying cowboy, a pair of visitors arrives with a rather unusual proposition. According to the strangers, the Graboids have recently resurfaced in Sonora, Mexico, and they\\\\\\'re currently getting fat on a steady diet of frightened oil field workers. Local businessman Carlos Ortega is willing to pay $50,000 a head for each worm killed, but Earl isn\\\\\\'t so sure he wants to put himself in harm\\\\\\'s way like that again. Still, Earl knows that he\\\\\\'s the right man for the job, and after a bit of goading from ambitious cabbie Grady Hoover (Christopher Gartin) the pair are loading up their weapons and heading for the border. Upon arriving in Sonora, Earl quickly warms up to beautiful geologist Kate White (Helen Shaver), but the Graboid population has grown faster than suspected so in order to be successful this group will need the kind of firepower that only Burt Gummer can supply. Ever since Burt\\\\\\'s wife walked out on him and the threat of World War III went away, the lonely survivalist has lost all direction in life. This is Burt\\\\\\'s chance to prove that he\\\\\\'s not just a useless middle aged man. But what the humans have failed to realize is that the Graboids have evolved to become deadlier than ever before, and they\\\\\\'re not staying underground anymore.\n\nRipped with Handbrake.\n\nLength: 1 Hour 40 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:b1e686ba2c836f2e34de52db30c30f6c9547b6d0","amp;dn":"Tremors+2%3A+Aftershocks%281996%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e686ba2c836f2e34de52db30c30f6c9547b6d0","infoHashBuffer":{"type":"Buffer","data":[177,230,134,186,44,131,111,46,52,222,82,219,48,195,15,108,149,71,182,208]},"announce":[],"urlList":[]}}