{"title":"BBC Absolute Zero 1of2 The Conquest of Cold 2007 DVBC XviD MP3","uid":4227173,"size":781015676,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b25296af990fd0b55ec1ac9a91e1f2527e766887&amp;dn=BBC+Absolute+Zero+1of2+The+Conquest+of+Cold+2007+DVBC+XviD+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"circlensess","files":1,"time":1212883690,"description":"This two-part scientific detective tale tells the story of a remarkable group of pioneers who wanted to reach the ultimate extreme: absolute zero, a place so cold that the physical world as we know it doesn&amp;#039;t exist, electricity flows without resistance, fluids defy gravity and the speed of light can be reduced to 38 miles per hour.\n\nEach film features a strange cast of eccentric characters, including: Clarence Birds Eye; Frederic &amp;#039;Ice King&amp;#039; Tudor, who founded an empire harvesting ice; and James Dewar, who almost drove himself crazy by trying to liquefy hydrogen.\n\nAbsolute zero became the Holy Grail of temperature physicists and is considered the gateway to many new technologies, such as nano-construction, neurological networks and quantum computing. The possibilities, it seems, are limitless.\n\nPart 1: Conquest of Cold\nChronicles the major discoveries leading towards the mastery of cold, beginning with King James I&amp;#039;s court magician, Cornelius Drebbel, who managed to air condition the largest interior space in the British Isles in 1620. Other stories will include the first &quot;natural philosopher,&quot; Robert Boyle, a founder of the Royal Society in Great Britain; the Grand Duke Ferdinand II de Medici&amp;#039;s involvement in the creation of the first thermometer; the establishment of the laws of thermodynamics by three young scientists, Sadi Carnot, James Joule and William Thomson; and Michael Faraday&amp;#039;s critical achievement in liquefying several other gases which set the stage for the commercial application of cold to refrigeration and air conditioning.\n\nTechnical Specs:\nVideo Codec: XVID \nVideo Bitrate: 1623 kbps \nVideo Resolution: 384x672 (height x width) \nVideo Aspect Ratio: 4x7 (1:1,75) \nAudio Codec: MPEG-1 Layer 3 (MP3) &lt;0x0055&gt; \nAudio BitRate: 130 kbps \nAudio Streams: 1 \nRunTime Per Part: 59 min 2,12 s (88553 Frames) \nPart Size: 744,83 MB\n\nSource: www mvgroup org\n","torrent":{"xt":"urn:btih:b25296af990fd0b55ec1ac9a91e1f2527e766887","amp;dn":"BBC+Absolute+Zero+1of2+The+Conquest+of+Cold+2007+DVBC+XviD+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b25296af990fd0b55ec1ac9a91e1f2527e766887","infoHashBuffer":{"type":"Buffer","data":[178,82,150,175,153,15,208,181,94,193,172,154,145,225,242,82,126,118,104,135]},"announce":[],"urlList":[]}}