{"title":"Dave Matthews Band - Away from the World [24 bit FLAC] vinyl","uid":8346729,"size":1176498365,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2b6ce0cac1c4ab2fae84be1344d42bc59aa1ad4&amp;dn=Dave+Matthews+Band+-+Away+from+the+World+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"24.96","files":-1,"time":1365226740,"description":"  Dave Matthews Band - Away from the World (2012) [24 bit FLAC] vinyl\n\n  Released: 2012\n  Source: 543527 / UK\n  Genre: Pop/Rock\n  Style: Alternative\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Broken Things\n  A2. Belly Belly Nice\n  A3. Mercy\n  B1. Guacho\n  B2. Sweet\n  B3. The Riff\n  C1. Belly Full\n  C2. If Only\n  C3. Rooftop\n  D1. Snow Outside\n  D2. Drunken Soldier\n\n  Getting back to the basics after a semi-extended break, Dave Matthews Band reunites with producer Steve Lillywhite -- the man who helmed their big major-label hits of the '90s -- for Away from the World, 2012's long-gestating sequel to 2009's Big Whiskey and the GrooGrux King. This marks the first time Lillywhite has worked with DMB since 1998's Before These Crowded Streets, and there's no denying he's the best producer for the band, articulating their elasticity with clarity and reigning in their excesses. Which isn't to say Away from the World is streamlined, as it hardly is. It has frayed ends and odd shifts, moments of great exuberance countered with quivering sensitivity, tightly written pop songs giving way to mini-epics, love songs balanced with ribald paeans to dripping peaches and full bellies. It's a little of everything that the Dave Matthews Band does, condensed to a relatively tight 53 minutes, Lillywhite giving the inherent digressions crispness and warmth, just like he did on Under the Table and Dreaming and Crash, but for as much as this recalls the sound of prime '90s DMB, Away from the World is clearly the work of a veteran band, one not so concerned with hits, one that likes to live within the well-etched world they've created. Sure, a few of these songs could conceivably cross over beyond the DMB diehards -- &quot;If Only&quot; is underpinned by some seductive soul groove, &quot;Rooftop&quot; carries a big pop hook, while the sex romp &quot;Belly Belly Nice&quot; evokes memories of &quot;Ants Marching&quot; -- but there is no real attempt to broaden their audience, nor is there the self-conscious stretching that marked some of Matthews' 2000s albums. Matthews is quite content where he is, writing songs about his family, wife, the world, and life as he approaches middle age, happy to consolidate DMB's strengths without quite seeming settled. Consequently, Away from the World is a bit of a rare thing: a return to form lacking an ounce of nostalgia.","torrent":{"xt":"urn:btih:b2b6ce0cac1c4ab2fae84be1344d42bc59aa1ad4","amp;dn":"Dave+Matthews+Band+-+Away+from+the+World+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2b6ce0cac1c4ab2fae84be1344d42bc59aa1ad4","infoHashBuffer":{"type":"Buffer","data":[178,182,206,12,172,28,74,178,250,232,75,225,52,77,66,188,89,170,26,212]},"announce":[],"urlList":[]}}