{"title":"The Wailers - Burnin' [24 bit FLAC] vinyl","uid":8113508,"size":572559155,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b2fbc1fd1a7af1e1e767bb8622f4a667bb1e2c98&amp;dn=The+Wailers+-+Burnin%27+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"24.96","files":-1,"time":1360244259,"description":"The Wailers' fourth album overall, Burnin', was their second for Island Records, released only six months after its predecessor, Catch a Fire. Given that speed, it's not surprising that several tracks -- &quot;Put It On,&quot; &quot;Small Axe,&quot; and &quot;Duppy Conqueror&quot; -- are re-recordings of songs dating back a few years. But they fit in seamlessly with the newer material, matching its religious militancy and anthemic style. The confrontational nature of the group's message is apparent immediately in the opening track, &quot;Get Up, Stand Up,&quot; as stirring a song as any that emerged from the American Civil Rights movement a decade before. The Wailers are explicit in their call to violence, a complete reversal from their own 1960s &quot;Simmer Down&quot; philosophy. Here, on &quot;Burnin' and Lootin',&quot; they take issue with fellow Jamaican Jimmy Cliff's song of the previous year, &quot;Many Rivers to Cross,&quot; asking impatiently, &quot;How many rivers do we have to cross/Before we can talk to the boss?&quot; &quot;I Shot the Sheriff,&quot; the album's most celebrated song, which became a number one hit in the hands of Eric Clapton in 1974, claims self-defense, admits consequences (&quot;If I am guilty I will pay&quot;), and emphasizes the isolated nature of the killing (&quot;I didn't shoot no deputy&quot;), but its central image is violent. Such songs illuminated the desperation of poor Jamaican life, but they also looked forward to religious salvation, their themes accentuated by the compelling rhythms and the alternating vocals of the three singers. Bob Marley was a first among equals, of course, and after this album his partners, Peter Tosh and Bunny Wailer, quit the group, which thereafter was renamed Bob Marley and the Wailers. The three bonus tracks on the 2001 reissue are all by Tosh and Wailer, though recorded at the album's sessions, suggesting the source of their frustration.","torrent":{"xt":"urn:btih:b2fbc1fd1a7af1e1e767bb8622f4a667bb1e2c98","amp;dn":"The+Wailers+-+Burnin%27+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2fbc1fd1a7af1e1e767bb8622f4a667bb1e2c98","infoHashBuffer":{"type":"Buffer","data":[178,251,193,253,26,122,241,225,231,103,187,134,34,244,166,103,187,30,44,152]},"announce":[],"urlList":[]}}