{"title":"Rookie Blue S2D2 (HDTV DD5.1 NL Subs) Hornigold TBS","uid":6634093,"size":4488141886,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b3178c52b6fa4d1f535835d192f0264a34eee00c&amp;dn=Rookie+Blue+S2D2+%28HDTV+DD5.1+NL+Subs%29+Hornigold+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hornigold","files":-1,"time":1314480780,"description":"Rookie Blue S2D2\n\nA group of young, rookie police officers must learn to adapt to their jobs and meet the expectations of their friends, families and co-workers.\n\n05. Stung\nA local car dealership is the backdrop for a Division 15 sting operation to crack down on suspects with outstanding warrants. However, when one of the captured criminals tries to bargain for a lighter sentence by offering insider information to Dov and Chris, it puts them in peril in a booby-trapped meth house. Meanwhile, Jo convinces Luke to help her on a high-stakes surveillance job. Trapped together in a hotel room, the two detectives finally have it out over their past, raising the question of whether they are really finished.\n06. In Plain view\nIndications are that the East Jameson gang was involved in the murder of a police informant, so solving the case will be difficult. The pressure is on when Superintendent Elaine Peck sets up at the station. Elsewhere, Andy is paired with Detective Rosati who unintentionally makes Andy privy to a secret that involves Luke. Stressed out with her mother at the station, Gail is tasked with protecting an eight-year-old boy who\\'s the only witness to the crime.\n07. The One that got away\nDetectives Callahan and Rosati are at odds over how to correlate and interpret the facts of two vicious crimes. Luke feels strongly that the latest woman attacked on her watch is connected to an unsolved rookie\\'s murder, but his erratic behavior gets him kicked off the case. Andy may be in serious trouble when Luke urges her to follow through with his hunch on the crimes.\n08. Monster\nGail and Traci apprehend a man who mysteriously collapses at the station which in turn places Division 15 under quarantine. Andy and Swarek are after a brutal bank robber and his partner but it will take some out-of-the-box thinking to solve this crime. Dov goes out on a first date with the bomb tech who saved his life. \n\nCountry of origin: Canada\nDuration: approxemately 60 minutes per episode\nCreated/ Directed by: Tassie Cameron, Morwyn Brebner, Ellen Vanstone\nCast: Missy Peregrym, Gregory Smith and Enuka Okuma\nFile extension: Video_TS folder\nAudio: English\nSubtitles: Dutch custom by Chillywitch. Thanks to you we can watch this and other series. Keep up the good work and subs free forever!\nCategory: Series\nSource: HDTV\nMenu: Yes, custom\nExtras: No\nGenre: Crime ~ Drama\nWeblink: http://www.imdb.com/title/tt1442065/\nYouTube: \n\nVideo and audio information:\n~~~~~~~~~~~~~~~~~~~~~~\nFormat            : MPEG-PS at 3 403 Kbps\nLength            : 1 005 MiB for 41mn 17s 376ms\n\nVideo #0          : MPEG Video at 2 951 Kbps\nAspect            : 720 x 576 (1.778) at 24.000 fps\n\nAudio #0          : AC-3 at 384 Kbps\nInfos             : 6 channels, 48.0 KHz\n\nKom ook eens kijken op ons gezellige forum: &lt;a href=&quot; http://black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://black-sam.org&lt;/a&gt;","torrent":{"xt":"urn:btih:b3178c52b6fa4d1f535835d192f0264a34eee00c","amp;dn":"Rookie+Blue+S2D2+%28HDTV+DD5.1+NL+Subs%29+Hornigold+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3178c52b6fa4d1f535835d192f0264a34eee00c","infoHashBuffer":{"type":"Buffer","data":[179,23,140,82,182,250,77,31,83,88,53,209,146,240,38,74,52,238,224,12]},"announce":[],"urlList":[]}}