{"title":"Active Webcam 11.5 (incl medicijn)Collected By Jeffrey","uid":12936806,"size":14282412,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b368abc105d432b84c41469d7f54045d06c8872d&amp;dn=Active+Webcam+11.5+%28incl+medicijn%29Collected+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gljeffrey45","files":1,"time":1449593545,"description":"Active Webcam 11.5 (incl medicijn)Collected By Jeffrey\r\n\r\nActive WebCam software captures images up to 30 frames per second from any video device including USB, web cameras, TV-boards, camcorders, and from network IP cameras.\r\n\r\nThis camera software performs simultaneous recording and broadcasting from unlimited number of cameras.\r\nYou can broadcast live audio and video using the following methods:\r\nStream Video and Audio through Web Server - you can watch video from surveillance computer even if this computer completely protected by firewall. Also this service provides high frame-rate broadcasting to the unlimited auditory because broadcasting is performed from our web server which has high speed broadband connection.\r\n\r\nHTTP Server - web camera software runs own HTTP server that all users, connected to your computer, can watch your cameras and play back recorded video files.\r\n\r\nFTP Upload - the program uploads images to your web site using FTP protocol. Your viewers point Internet browsers to your web site and watch captured video.\r\n\r\nThe captured video can be viewed using any Internet browser.\r\nKey Features:\r\n\r\n\r\nWorks with all USB and Parallel Port cameras, Windows compatible Capture Devices and Framegrabbers, Pico 2000, TV-boards, and with Network IP Cameras from famous manufacturers like Toshiba, Logitech, Microsoft, Lenovo, Creative and Philips.\r\nBroadcasts live MPEG-4 video and MP3 audio up to 30 frames per second.\r\nMultiple cameras support. Simultaneous recording and broadcasting from unlimited number of cameras.\r\nDynamic IP Service, that gives a permanent internet address to your web camera whenever IP of your computer changes.\r\nTime stamps captured video.\r\nBroadcasts audio.\r\nSupports Encrypted Transmission.\r\nRecords password protected video clips.\r\nPerforms Live Recording that allows rewind and playback captured content at any time.\r\nHas features to control camera's Pan, Tilt, and Zoom.\r\nHelps you to create web page for your web camera.\r\nRecords video when a motion is detected.\r\nAllows to view recorded video remotely.\r\nSends e-mail and SMS when motion detected.\r\nRuns a program when a motion is detected.\r\nAllows to define the active area for motion detection.\r\nCreates thumbnails from captured images.\r\nHas a comprehensive scheduler.\r\nChecks the available space on hard drive and stops recording if there is no available space.\r\nUser name and password to control access to your camera and recorded videos from Internet.\r\nHas feature to limit number of camera viewers.\r\nStealth mode makes the program completely invisible that it doesn't display any icon in the sys tool tray and it is not presented in the task bar tray.\r\nPassword protection from unauthorized usage.\r\nAbility to run the program as Windows service that the program starts automatically at system boot and executes even when no user is logged on to the system.\r\n\r\nMet medicijn !\r\nGetest op een windows 10 machine 64bits en werkt prima, lees de NFO !\r\n\r\n\r\nBeste gebruikers,\r\nde torrents worden geüpload met een server, en voor de omschrijving ben ik dus afhankelijk van wat ik zelf  binnen krijg aan info.\r\nIk kan dus niet alles wat ik upload nalopen op fouten in de omschrijving.\r\nWaardeer je mijn uploads,laat dan even een commentaartje achter.\r\nTorrents uploaden is puur hobby voor mij.\r\n\r\nVeel plezier met de door jouw gedownloade torrent","torrent":{"xt":"urn:btih:b368abc105d432b84c41469d7f54045d06c8872d","amp;dn":"Active+Webcam+11.5+%28incl+medicijn%29Collected+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b368abc105d432b84c41469d7f54045d06c8872d","infoHashBuffer":{"type":"Buffer","data":[179,104,171,193,5,212,50,184,76,65,70,157,127,84,4,93,6,200,135,45]},"announce":[],"urlList":[]}}