{"title":"Ben-Hur (1925)","uid":4085092,"size":1467998857,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b3c234bab843fb64e22499947f05503995bfaf36&amp;dn=Ben-Hur+%281925%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"megalilo","files":3,"time":1205768578,"description":"Ben-Hur: A Tale of the Christ\n\nBen-Hur was a 1925 silent film directed by Fred Niblo. It was a blockbuster hit for newly merged Metro-Goldwyn-Mayer. This was the second film based on the novel Ben-Hur by Lew Wallace.\n\nBen-Hur is a wealthy Jew and boyhood friend of the powerful Roman, Messala. When an accident leads to Ben-Hur&amp;#039;s arrest, Messala, who has become corrupt and arrogant, makes sure Ben-Hur and his family are jailed and separated.\n\nCosting between 4 and 6 million dollars, Ben-Hur is the most expensive silent film ever made.\n\nBen-Hur was a big success as a novel, and also as a stage play. Stage productions had been running for twenty-five years. In 1922, two years after the play&amp;#039;s last tour, the Goldwyn company purchased the film rights to Ben-Hur. The play&amp;#039;s producer, Abraham Erlanger, put a heavy price on the screen rights. Erlanger was persuaded to accept a generous profit participation deal and total approval over every detail of the production.\n\nShooting began in Italy in 1923, starting two years of difficulties, accidents, and eventually a move back to Hollywood. Additional recastings (including Ramon Navarro as Ben-Hur) and a change of director helped skyrocket the production&amp;#039;s budget. The studio&amp;#039;s publicity department was shameless, advertising the film with lines like: &quot;The Picture Every Christian Ought to See!&quot; Although audiences flocked to Ben-Hur after its premiere in 1925 and the picture grossed nine million dollars, its huge expenses and the deal with Erlanger made it a loser for MGM. MGM was unable to regain its $4,000,000 investment.\n\nIMDB: 8.2/10\n &lt;a href=&quot;\nhttp://imdb.com/title/tt0016641/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imdb.com/title/tt0016641/&lt;/a&gt;","torrent":{"xt":"urn:btih:b3c234bab843fb64e22499947f05503995bfaf36","amp;dn":"Ben-Hur+%281925%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c234bab843fb64e22499947f05503995bfaf36","infoHashBuffer":{"type":"Buffer","data":[179,194,52,186,184,67,251,100,226,36,153,148,127,5,80,57,149,191,175,54]},"announce":[],"urlList":[]}}