{"title":"Busted - Wendy Ruderman and Barbara Laker - Audiobook MP3","uid":11497837,"size":199816687,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b3c95a5de4d41cdd836988339e97cf20b037da30&amp;dn=Busted+-+Wendy+Ruderman+and+Barbara+Laker+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1416269199,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nBusted: A Tale of Corruption and Betrayal in the City of Brotherly Love\n\nWritten by: Wendy Ruderman, Barbara Laker\nNarrated by: Rachel Fulginiti\nLength: 6 hrs and 55 mins\nUnabridged Audiobook\nRelease Date:11-18-14\n\nAlthough Busted reads like a thriller, the breathtaking story it tells - of two journalists' quest to unmask corrupt police officers and a warped justice system, the reporting of which culminated in a Pulitzer Prize - is absolutely true. One afternoon in late 2008, a man walks into the offices of the local tabloid the Philadelphia Daily News and asks to speak with reporter Wendy Ruderman. An imminent casualty of the foundering print industry, the paper is on the brink of bankruptcy, and its anxious staff members are plagued with dwindling resources. But what Benny Martinez tells Wendy and her colleague Barbara Laker is too shocking to ignore; his career as a confidential informant for a member of the Philadelphia Police Department's narcotics squad has drawn him into a horrifying web of corruption, and now he is afraid for his life.\n\nThe decision they make that day to believe Benny's saga will lead the two journalists to uncover a truth darker than they could have imagined.\n\nBusted is Ruderman and Laker's riveting account of their explosive investigation into the acts committed by rogue members of the narcotics squad.\n\nThe remarkable lengths Ruderman and Laker go to for the story - chasing down witnesses on the city's grimmest streets, sifting through archive boxes and hours of surveillance tape for crucial clues, and coaxing reluctant victims to come forward - put their determination to balance motherhood with the career they love to the ultimate test. But when they produce a devastating series of articles that blows the lid off the scandal - prompting civil lawsuits against the city and the reexamination of hundreds of convictions (although none of the officers have been charged or convicted of any crime) - they not only win the fight for justice; they also win a Pulitzer Prize for Investigative Reporting, an unthinkable achievement for two city reporters at a beleaguered regional paper","torrent":{"xt":"urn:btih:b3c95a5de4d41cdd836988339e97cf20b037da30","amp;dn":"Busted+-+Wendy+Ruderman+and+Barbara+Laker+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3c95a5de4d41cdd836988339e97cf20b037da30","infoHashBuffer":{"type":"Buffer","data":[179,201,90,93,228,212,28,221,131,105,136,51,158,151,207,32,176,55,218,48]},"announce":[],"urlList":[]}}