{"title":"Sexual Secrets - Nik Douglas","uid":11999337,"size":19561991,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b48de615b217860c2c297db1d1bafb6800e2d6a2&amp;dn=Sexual+Secrets+-+Nik+Douglas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1433723212,"description":"Sexual Secrets is the definitive guide to sex and mysticism, revealing the wisdom of the sages of India, Nepal, Tibet, China, and Japan whose teachings on sexuality unveil how physical love can be the pathway to spiritual liberation. Containing more than 600 illustrations--the most comprehensive collection of images expressing the erotic sentiment--and with more than one million copies sold in more than 19 languages, Sexual Secrets unlocks for everyone the experience of ecstasy once sealed in the ancient texts and art of the East. \n\nIn celebration of its 20th year in print, Sexual Secrets has been completely revised and redesigned and includes 200 color illustrations to complement Penny Slinger's unsurpassed black-and-white illustrations, which evoke all the major cultures of the East. Working from contemporary models and from ancient pieces originally commissioned by kings and emperors, Slinger blends images of the West with the sentiments of the East to further enhance the experience of the text and to help in the transmission of the secrets--a celebration of creative sexuality","torrent":{"xt":"urn:btih:b48de615b217860c2c297db1d1bafb6800e2d6a2","amp;dn":"Sexual+Secrets+-+Nik+Douglas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b48de615b217860c2c297db1d1bafb6800e2d6a2","infoHashBuffer":{"type":"Buffer","data":[180,141,230,21,178,23,134,12,44,41,125,177,209,186,251,104,0,226,214,162]},"announce":[],"urlList":[]}}