{"title":"Vertical Drop Heroes HD v1.0.3a","uid":10650214,"size":30646944,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b523b1a44010c9f47afb9644b49b1b0c1f04367e&amp;dn=Vertical+Drop+Heroes+HD+v1.0.3a&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1406597176,"description":"Vertical Drop Heroes HD v1.0.3a\n\n\nInstall &amp; play!\n\n\nVertical Drop Heroes is a procedural platformer RPG hybrid with roguelike elements, where your hero adventures through randomly generated stages. Armed with a variety of skills and traits, you must use your cunning and reflexes to survive the dangers of each stage, until you face the final boss and uncover the truth behind the game! \n\nFEATURES\n\n- Randomly generated stages, enemies and bosses, resulting in a very replayable game\n- Artwork, coding and animation done by one person (me) in that unique Nerdook style\n- Split screen, local co-op, as well as local network coop!\n- Destructible terrain and multiple uses for each skill gives you plenty of options to approach the different situations generated\n- Tons of skills, abilities, traits and powers that you can unlock in the game, creating a different hero each time\n- Unique combat system where proper planning is more important than quick reflexes\n- Persistent upgrades allow you to carry forward progress between games, with a choice between increasingly expensive persistent upgrades or generally cheaper temporary upgrades\n- Every enemy and boss has been designed to provide challenge and variety ","torrent":{"xt":"urn:btih:b523b1a44010c9f47afb9644b49b1b0c1f04367e","amp;dn":"Vertical+Drop+Heroes+HD+v1.0.3a","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b523b1a44010c9f47afb9644b49b1b0c1f04367e","infoHashBuffer":{"type":"Buffer","data":[181,35,177,164,64,16,201,244,122,251,150,68,180,155,27,12,31,4,54,126]},"announce":[],"urlList":[]}}