{"title":"John Bayless - The Beatles as if JS Bach had composed them","uid":4217701,"size":32341590,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b596373f51896d60d2830d590afff6b9d8176c69&amp;dn=John+Bayless+-+The+Beatles+as+if+JS+Bach+had+composed+them&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":16,"time":1212430954,"description":"Bach, Bayless, Beatles\nJohn Bayless\n &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jcfwxq9jldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:jcfwxq9jldhe&lt;/a&gt;\n\n \n \n       1   Imagine  Lennon  3:18  \n       2   A Hard Day&amp;#039;s Night  Lennon, McCartney  3:09  \n       3   Let It Be  Lennon, McCartney  4:12  \n       4   Penny Lane  Lennon, McCartney  3:20  \n       5   Lucy in the Sky With Diamonds  Lennon, McCartney  2:08  \n       6   With a Little Help from My Friends  Lennon, McCartney  3:07  \n       7   Yesterday  Lennon, McCartney  2:24  \n       8   Michelle  Lennon, McCartney  3:49  \n       9   And I Love Her  Lennon, McCartney  3:00  \n       10   Eleanor Rigby  Lennon, McCartney  4:02  \n       11   Good Day Sunshine/Daytripper  Lennon, McCartney  3:25  \n       12   Good Night  Lennon, McCartney  2:44  \n       13   I Want to Hold Your Hand  Lennon, McCartney  3:00  \n       14   Lady Madonna  Lennon, McCartney  2:56  \n  \n\nBiography by Joseph Stevenson \nJohn Bayless, a pianist, is an intriguing crossover artist who blends classical training and piano technique with popular and film music in dashing and imaginative improvisations.\n\nJohn Bayless started playing the piano when he was four, receiving lessons from his mother. She taught him the standard teaching methods and music including Bach, Mozart, Chopin, Rachmaninov, and Gershwin. As soon as he was old enough, he says, he was drawn to the piano whenever he had heard or emotionally experienced anything, and expressed these impressions by improvising. \n\nOne of his primary influences was the movies. His town on the West Texas Plains was typical for its time, with a drive-in movie where the family went every Friday &quot;regardless of rain, dust storms, tornadoes, whatever,&quot; as he recalls. Along with the chili-cheese hamburgers, doughnuts, and popcorn, he ingested the music of film scores and was soon rushing over the piano afterwards to recreate the music of Mancini, Rota, Steiner, Rozsa, Herrmann, and Williams.\n\nHe won a scholarship to the Aspen School of Music at fifteen, and at seventeen went to Juilliard in New York to study piano with Adele Marcus. She recognized his unusual ability at improvisation (an art long in decline among classical musicians) and encouraged it. He was invited to participate as a composer in New York University&amp;#039;s Masters Degree Musical Theatre Program, studying with Leonard Bernstein, Betty Comden, and Adolph Green. \n\nHis first recording, &quot;Happy Birthday Bach,&quot; was released in 1985 on the Pro Arte label. He has primarily recorded on Angel. His &quot;Bach Meets the Beatles&quot; and its follow-up, &quot;Bach on Abbey Road&quot; were hits, the first of them being one of Billboard&amp;#039;s Top Ten crossover albums of the 1980s. &quot;The Puccini Album ? Arias for Piano&quot; was at the top of the classical crossover chart for eighteen weeks. Other hits have been a set of variations on songs from Bernstein&amp;#039;s West Side Story and a set of classical film scores.\n\nBayless tours widely, playing around fifty concerts a year. He frequently appears at Pops concerts, and since the mid-1990s also appears often in Europe. As a composer, he has been commissioned to write for the Newport Music Festival, the University of Maryland International Piano Competition, and the Metropolitan Museum of Arts, the latter for a score to a film about its Lila Acheson Wallace Exhibition of 20th Century American Art. \n \n","torrent":{"xt":"urn:btih:b596373f51896d60d2830d590afff6b9d8176c69","amp;dn":"John+Bayless+-+The+Beatles+as+if+JS+Bach+had+composed+them","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b596373f51896d60d2830d590afff6b9d8176c69","infoHashBuffer":{"type":"Buffer","data":[181,150,55,63,81,137,109,96,210,131,13,89,10,255,246,185,216,23,108,105]},"announce":[],"urlList":[]}}