{"title":"White Plains - My Baby Loves Lovin' (1970-1974) [CD 1993]","uid":4875623,"size":105285230,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b5bdeb54109ddc366ae32ef91e1f1062f807e44d&amp;dn=White+Plains+-+My+Baby+Loves+Lovin%5C%27+%281970-1974%29+%5BCD+1993%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":26,"time":1241112494,"description":"White Plains - My Baby Loves Lovin' (1970-1974) [CD 1993]\nCD (1993) To Mp3 192 mbit/s\nIncluded: Front Cover and this Info\n\nBiography\tby Tim Sendra  allmusic.com\nThe British group White Plains had a big hit single in 1970. &quot;My Baby Loves Lovin&quot; was a bubblegum classic that features the ubiquitous vocals of Tony Burrows and a bouncy, happy, and decidedly British pop sound. The group formed when the the Flowerpot Men, best known for the dippy, bubble-psych hit &quot;Let's Go to San Francisco,&quot; decided a name change and a stylistic change were in order. Burrows was in the last incarnation of the Flowerpot Men and he carried over into the initial White Plains lineup; as did pianist Pete Nelson, bassist Robin Shaw, and Ricky Wolff, who was proficient on guitars, keyboards, flute, and saxophone. The group soon recruited drummer Roger Hills and lead guitarist Robin Box, both of whom had played backing Peter &amp; Gordon and Paul Jones.\n\nOn October 26, 1969, the band recorded four tracks from which &quot;My Baby Loves Lovin'&quot; was picked as the single. Released on January 9th of 1970 on Deram, the single zoomed up the charts in the U.K., eventually landing in the Top Ten. It also hit big in the U.S., reaching number 13 on the Hot 100. Burrows never was a real member of the group, he only sang lead at that initial session (which was actually intended as a Flowerpot Men session until the brains behind the group decided on the switch). The band carried on as a five-piece, releasing three more singles in 1970 and eventually a self-titled album. The album sold respectively in the U.K. but only reached number 166 on the U.S. charts after a skimpy four-week run. The album as well as all their singles were produced by the prolific duo of Roger Greenaway and Roger Cook. They also wrote most of the songs. They guided the sound of White Plains away from the trippy harmony pop of the Flowerpot Men towards a more adult and softly rocking sound. Their output was neatly split between light-hearted and chugging, kiddie pop tunes like &quot;My Baby Loves Lovin'&quot; and &quot;Sunny Honey Girl&quot;; and mainstream pop songs like &quot;You've Got Your Troubles&quot; and &quot;Young Birds Fly,&quot; which are bathed in strings and masses of choir-like vocals that wrap around the emotional, Neil Diamond-esque lead vocals.\n\nThe group kept plugging away, releasing three singles in 1971 and a sophomore album, When You Are a King, none of which did much on the charts. The next three years found them losing a member, Ricky Wolff was replaced by organist Ron Renolyds, and releasing more singles (two in 1972, three in 1973, and one in 1974); including the cowbell driven &quot;Ecstasy,&quot; which is notable for being the rare track written by Roger Cook without Roger Greenaway. However, the band was never able to recapture the success of their first single and in 1974 White Plains left Deram, and in 1976 recorded one last single, &quot;Summer Nights,&quot; and stopped recording. After some time apart, most of the band regrouped and began touring the oldies circuit. \n\nTracklist:\n01. I've Got You On My Mind (1970)\n02. When Tomorrow Comes Tomorrow (1970)\n03. Taffeta Rose (1970)\n04. (I Remember) Summer Morning (1970)\n05. To Love You (1970)\n06. In A Moment Of Madness (1970)\n07. My Baby Loves Lovin' (1970)\n08. Today I Killed A Man I Didn't Know (1970)\n09. You've Got Your Troubles (1970)\n10. Show Me Your Hand (1970)\n11. Young Birds Fly (1970)\n12. Sunny, Honey Girl (1970)\n13. Lovin' You Baby (1970)\n14. Julie Do Ya Love Me (1970)\n15. Every Little Move She Makes (1971)\n16. When You Are A King (1971)\n17. Gonna Miss Her Mississippi (1971)\n18. Carolina's Comin' Home (1971)\n19. I Can't Stop (1972)\n20. Dad You Saved The World (1972)\n21. Step Into A Dream (1973)\n22. Does Anybody Know Where My Baby Is? (1973)\n23. Julie Anne (1973)\n24. Ecstacy (1974)","torrent":{"xt":"urn:btih:b5bdeb54109ddc366ae32ef91e1f1062f807e44d","amp;dn":"White+Plains+-+My+Baby+Loves+Lovin%5C%27+%281970-1974%29+%5BCD+1993%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5bdeb54109ddc366ae32ef91e1f1062f807e44d","infoHashBuffer":{"type":"Buffer","data":[181,189,235,84,16,157,220,54,106,227,46,249,30,31,16,98,248,7,228,77]},"announce":[],"urlList":[]}}