{"title":"Malwarebytes Anti-Malware Premium 2.2.1.1043 Final Multilingual","uid":13912933,"size":22827594,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b66809713dc1be3f92fda233fea05518b10487c0&amp;dn=Malwarebytes+Anti-Malware+Premium+2.2.1.1043+Final+Multilingual&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1458318659,"description":"Malwarebytes Anti-Malware Premium 2.2.1.1043 Final Multilingual + license\r\n\r\nMalwarebytes' Anti-Malware is considered to be the next step in the detection and removal of malware. We compiled a number of new technologies that are designed to quickly detect, destroy, and prevent malware. Malwarebytes' Anti-Malware can detect and remove malware that even the most well-known Anti-Virus and Anti-Malware applications on the market today cannot.\r\n\r\nKey Features\r\n\r\n- Light speed quick scanning.\r\n- Ability to perform full scans for all drives.\r\n- Malwarebytes' Anti-Malware Protection Module. (requires registration)\r\n- Database updates released daily.\r\n- Quarantine to hold threats and restore them at your convenience.\r\n- Ignore list for both the scanner and Protection Module.\r\n- Freeware Settings to enhance your Malwarebytes' Anti-Malware performance.\r\n- A small list of extra utilities to help remove malware manually.\r\n- Multi-lingual support.\r\n- Works together with other anti-malware utilities.\r\n- Command line support for quick scanning.\r\n- Context menu integration to scan files on demand.\r\n\r\nWhat's new\r\n\r\nImprovements:\r\nContext Menu scanning option is now enabled by default. Note if you had this option disabled previously and want to retain that setting, you must disable again manually this one time only. Future updates will retain the setting properly\r\nImproved renewal experience for those who purchased in retail store so that the original license key is retained post-renewal instead of requiring that a new key be entered and activated\r\nImproved End of Trial experience so it is clear that trial has expired and real-time protection is no longer available\r\nAdded additional license checks to ensure subscription details are updated as quickly as possible after a renewal is processed\r\nUpdated company and product logos with new logo\r\nFor Premium subscription licenses, removed Renew button from My Account screen to avoid confusion over license term\r\n\r\nIssues Fixed:\r\nFixed security vulnerability to ensure database updates are downloaded over SSL connections only\r\nFixed crash that occurred if Dell Backup and Recovery software was installed on same system\r\nFixed issue where scheduled scan did not honor weekly recurrence properly\r\nFixed issue where license expiration notices were incorrectly displaying multiple times in rapid succession\r\nFixed issue where the Scheduler would continue to run in certain cases after a trial had expired\r\nFixed issue where the update progress bar on the Dashboard would appear to hang and would never complete\r\n\r\nSystem requirements\r\n\r\nWindows 10 (32/64-bit)\r\nWindows 8.1 (32/64-bit)\r\nWindows 8 (32/64-bit)\r\nWindows 7 (32/64-bit)\r\nWindows Vista (Service Pack 1 or later, 32/64-bit)\r\nWindows XP (Service Pack 2 or later, 32-bit only)\r\n\r\nHomepage https://www.malwarebytes.org/antimalware/","torrent":{"xt":"urn:btih:b66809713dc1be3f92fda233fea05518b10487c0","amp;dn":"Malwarebytes+Anti-Malware+Premium+2.2.1.1043+Final+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b66809713dc1be3f92fda233fea05518b10487c0","infoHashBuffer":{"type":"Buffer","data":[182,104,9,113,61,193,190,63,146,253,162,51,254,160,85,24,177,4,135,192]},"announce":[],"urlList":[]}}