{"title":"Kabbalah - A Very Short Introduction - Joseph Dan [Non-Fiction] ","uid":8859496,"size":8173471,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b682f237200a41f7026a7e2dfb8f4b7a4ea03a90&amp;dn=Kabbalah+-+A+Very+Short+Introduction+-+Joseph+Dan+%5BNon-Fiction%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":5,"time":1377739150,"description":"In Kabbalah: A Very Short Introduction, Joseph Dan, one of the world's leading authorities on Jewish mysticism, offers a concise and highly accurate look at the history and character of the various systems developed by the adherents of the Kabbalah.\n\nDan sheds light on the many misconceptions about what Kabbalah is and isn't--including its connections to magic, astronomy, alchemy, and numerology--and he illuminates the relationship between Kaballah and Christianity on the one hand and New Age religion on the other. The book provides fascinating historical background, ranging from the mystical groups that flourished in ancient Judaism in the East, and the medieval schools of Kabbalah in Northern Spain and Southern France, to the widening growth of Kabbalah through the school of Isaac Luria of Safed in the sixteenth century, to the most potent and influential modern Jewish religious movement, Hasidism, and its use of kabbalistic language in its preaching. The book examines the key ancient texts of this tradition, including the Sefer Yezira or &quot;Book of Creation,&quot; The Book of Bahir, and the Zohar. Dan explains Midrash, the classical Jewish exegesis of scriptures, which assumes an infinity of meanings for every biblical verse, and he concludes with a brief survey of scholarship in the field and a list of books for further reading.\n\nEmbraced by celebrities and integrated in many contemporary spiritual phenomena, Kabbalah has reaped a wealth of attention in the press. But many critics argue that the form of Kabbalah practiced in Hollywood is more New Age pabulum than authentic tradition. Can there be a positive role for the Kabbalah in the contemporary quest for spirituality?\n\nIn Kabbalah, Joseph Dan debunks the myths surrounding modern Kabbalistic practice, offering an engaging and dependable account of this traditional Jewish religious phenomenon and its impact outside of Judaism. ","torrent":{"xt":"urn:btih:b682f237200a41f7026a7e2dfb8f4b7a4ea03a90","amp;dn":"Kabbalah+-+A+Very+Short+Introduction+-+Joseph+Dan+%5BNon-Fiction%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b682f237200a41f7026a7e2dfb8f4b7a4ea03a90","infoHashBuffer":{"type":"Buffer","data":[182,130,242,55,32,10,65,247,2,106,126,45,251,143,75,122,78,160,58,144]},"announce":[],"urlList":[]}}