{"title":"Coast to Coast AM December 27 2012","uid":7966569,"size":56646717,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b78730507c3651310f24c698c44b389e5c3bb39c&amp;dn=Coast+to+Coast+AM+December+27+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1356700550,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t12-27-12\nHost: \tGeorge Noory\nGuests: \tMicah Hanks, Mike Adams\n\nWriter and researcher Micah Hanks spoke about UFOs, a variety of unexplained aspects of cultural phenomena and human history, as well as the prospects of our technological future as a species influenced by science. He explained that he considers himself a &quot;skeptic,&quot; in the sense that he approaches these topics without a preconception toward belief or disbelief. In his latest book, The UFO Singularity, he examines the idea that the technology behind unexplained craft may surpass human intelligence, even if the UFOs do not originate from extraterrestrial sources. Discussing the historical aspects of ufology, he observed that the subject has gone from being treated as a possible danger and national security threat, to dismissed as a serious scientific subject.\n\nA pivotal period for ufology was just after World War II, with many sightings of discs and flying saucers. At the time, there was a lot of paranoia that the UFOs were some form of terrestrial technology, perhaps secretly created the Russians, he said. Also, advancements in radar during the War, may have increased our ability to detect UFOs, he continued. Hanks recounted his investigation of a UFO sighting that took place in Locust Grove, Georgia in 1973, when a craft hovered near a power sub-station.\n\nAddressing the concept of transhumanism, he noted that in the coming decades we'll have advanced science and innovation that will in a sense allow us to take evolution into our own hands. &quot;Humankind may rapidly begin to change...and we may not be the same humanity that we know today,&quot; he said, adding that many people are uncomfortable with this notion. 'Aliens' aboard UFOs could actually be time travelers-- they could represent what humans will look like many centuries from now, he posited. Hanks also talked about how artificial intelligence (AI) could evolve, with one AI technology creating an intelligence of its own that is even smarter. This process could keep replicating until the AIs literally become unfathomable to humans, he remarked.\nFacebook Purging\n\nFirst hour guest, Mike Adams, editor of NaturalNews.com, reported on a recent Facebook account purging, as well as freedom issues. He said his Facebook account was suspended after he posted a quote from Gandhi, and then later he learned this was part of a massive political purge by the social network, with such people as the Architects &amp; Engineers for 9-11 Truth, writers forand whistleblower Amber Lyon all having their accounts deactivated or suspended from Facebook. We're also seeing assaults on the environment with contaminants and pharmaceuticals in the water supply, as well as on the 2nd Amendment with efforts to curtail gun rights, he added.\n\nNew segment guests: Gerald Celente, Dr. Peter Breggin\nWebsite(s):\n\n   \n    naturalnews.com\n    healthranger.com\n\nBook(s):\n\n    Magic, Mysticism and the Molecule\n    The UFO Singularity\n    Natural Health Solutions\n\n","torrent":{"xt":"urn:btih:b78730507c3651310f24c698c44b389e5c3bb39c","amp;dn":"Coast+to+Coast+AM+December+27+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b78730507c3651310f24c698c44b389e5c3bb39c","infoHashBuffer":{"type":"Buffer","data":[183,135,48,80,124,54,81,49,15,36,198,152,196,75,56,158,92,59,179,156]},"announce":[],"urlList":[]}}