{"title":"A HistÃƒÂ³ria do PetrÃƒÂ³leo ( The Epic of Black Gold )","uid":5300579,"size":1201705792,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b78d54c26d51750bd8688ecbc54500ccc19c08d7&amp;dn=A+Hist%C3%83%C2%B3ria+do+Petr%C3%83%C2%B3leo+%28+The+Epic+of+Black+Gold+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"justleo","files":4,"time":1264206983,"description":"More than the black gold, oil has been a landmark and revolutionized the way in which humanity sees the world. The most important - and non-renewable - energy source of the current era of development is the theme of The Story of Oil, especially from The History Channel. The four episodes of the series, explains the status that this liquid has to routine and the world economy. See the synopsis:\n\nThe Golden Age of the Great Company: discusses how the discovery of the use of combustion of liquid was used in Pennsylvania in 1859, and discusses the importance of the founders of this story - Americans John Rockefeller, who ran the Standard Oil Company, and Henry Ford, the pioneer of popular cars.\n\nOil Nationalism: shows the relationship of oil to the post-war years and the economic expansion of the industrialized countries at the time. The reason that led Venezuela and Saudi Arabia to push forward the creation of the Organization of Petroleum Exporting Countries (OPEC), at the height of the industrial leap in 1960, is also featured in the episode.\n\nThe Oil Weapon: examines the nationalization of oil industries in three more radical members of OPEC (Algeria, Libya and Iraq), from the years 1970, breaking with the trend in the imperialist world. In the decade following the war between Iran and Iraq has caused the second energy crisis.\n\nThe Oil Depletion: the Gulf War puts the spotlight on the delicate situation of the oil market at the possibility of a new energy crisis. Moreover, the episode highlights the ghost of resource depletion and the search for alternative sources of energy.","torrent":{"xt":"urn:btih:b78d54c26d51750bd8688ecbc54500ccc19c08d7","amp;dn":"A+Hist%C3%83%C2%B3ria+do+Petr%C3%83%C2%B3leo+%28+The+Epic+of+Black+Gold+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b78d54c26d51750bd8688ecbc54500ccc19c08d7","infoHashBuffer":{"type":"Buffer","data":[183,141,84,194,109,81,117,11,216,104,142,203,197,69,0,204,193,156,8,215]},"announce":[],"urlList":[]}}