{"title":"Fascism: The Bloody Ideology of Darwinism","uid":11715948,"size":16766349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7c13a24446306304cb706292c0e94b3634f4276&amp;dn=Fascism%3A+The+Bloody+Ideology+of+Darwinism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1424583745,"description":"Fascism is known as an ideology that was born and flourished in the 20th century. It spread rapidly across the world in the wake of World War I, with fascist regimes coming to power in Germany and Italy in particular, but also in such countries as Greece, Spain and Japan, where the people suffered greatly from the oppressive and violent methods employed by their governments. Against this oppression and violence, they could do little more than cower before it. The fascist dictator and his administration heading such systems, where brute force, aggression, bloodshed and violence were the rule of the day, sent waves of terror throughout the society with their secret police and fascist militia, paralyzing the people with fear. Furthermore, fascist administration was implemented in almost all levels of society, from education to culture, religion to art, the governmental structure to the military system, and from the policing organizations to peoples' private lives. Ultimately, World War II, initiated by fascists, was one of the gravest calamities in the history of mankind, leaving as many as 55 million dead.However, fascism is not an ideology found only in history books. Although today there are no states that call themselves fascist or who practice it openly, there are, nevertheless, in many countries in the world, governments, political groups and parties who follow fascistic policies. Though the names and tactics have changed, they continue to inflict similar suffering on their people. There is also a possibility that the coming deterioration of social conditions could lead to further growth in the support for fascism. For that reason, fascism is a continuing threat to humanity","torrent":{"xt":"urn:btih:b7c13a24446306304cb706292c0e94b3634f4276","amp;dn":"Fascism%3A+The+Bloody+Ideology+of+Darwinism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c13a24446306304cb706292c0e94b3634f4276","infoHashBuffer":{"type":"Buffer","data":[183,193,58,36,68,99,6,48,76,183,6,41,44,14,148,179,99,79,66,118]},"announce":[],"urlList":[]}}