{"title":"Scissors Cut Paper Wrap Stone  by Ian McDonald {dwg}","uid":11676773,"size":3874829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7ed60dfdb17cf6b700dc26bcdca6f4f42b46974&amp;dn=Scissors+Cut+Paper+Wrap+Stone++by+Ian+McDonald+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1422904756,"description":"Ethan Ring is a former graphic design student with a dark and powerful secret. As an undergraduate, he and some classmates developed the ultimate in high-concept visual art: computerized images capable of bypassing rational thought and controlling the mind of the perceiver, whether for good or ill. When the reigning intelligence agency gets wind of Ethan's handiwork, he is forced into its service via the most potent of the images being tattooed on the palms of his hands. Now on a spiritual pilgrimage through twenty-first-century Japan, a guilt-ridden Ethan grapples with the responsibility his power implies and determines to use it for the greatest good by ridding the country of its ubiquitous crime syndicate. A past winner of sf's Campbell Award for best new writer, McDonald now ranks among the genre's leading stylists. In this brief but surprisingly satisfying tale, the full range of his versatile talent is on display as he merges Zen philosophy with cyberspace performance art in a high-tech contemplation of good and evil. A rare combination of suspenseful storytelling and thought-provoking ideas","torrent":{"xt":"urn:btih:b7ed60dfdb17cf6b700dc26bcdca6f4f42b46974","amp;dn":"Scissors+Cut+Paper+Wrap+Stone++by+Ian+McDonald+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7ed60dfdb17cf6b700dc26bcdca6f4f42b46974","infoHashBuffer":{"type":"Buffer","data":[183,237,96,223,219,23,207,107,112,13,194,107,205,202,111,79,66,180,105,116]},"announce":[],"urlList":[]}}