{"title":"Alice Hoffman - Skylight Confessions","uid":4942698,"size":781409,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b89ef0d520bd8126516adabc353f86cbfa8cf283&amp;dn=Alice+Hoffman+-+Skylight+Confessions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1244519106,"description":"Among the many pleasures of &quot;Skylight Confessions&quot; is a sense of continuous corner-turning, a chain of surprises. As in fairy tales, the narrating voice is often remote, giving us summaries of the action, so that it feels as if we see the characters through the wrong end of a telescope. But then, at rhythmic intervals, the sudden intimacy of a scene delivers them to us in vivid three-dimensional reality. Also as in fairy tales, the setting -- the material world of objects, landscape, weather -- packs considerable symbolic weight. There are the Moody family's glass house (reminiscent of the one designed by Philip Johnson, located in the same state), &quot;made of a thousand windows&quot; ; the pearls given to Arlyn by her window-washer lover and handed down to Blanca, &quot;a sign that someone had once loved her&quot; ; the limes that appear on both sides of the Atlantic; water; wings; and stones. All these things are beautifully concrete; yet at the same time, they convey in a continuous stream the thematic and emotional concerns of the novel. &quot;The entire room was washed out by darkness, shadow upon shadow, so that a person had to squint to see anything. There was only one bit of color, a dark blue feather on the floor, the color of the sky when it's broken in half and the core of the universe can be seen.&quot; Ultimately, &quot;Skylight Confessions&quot; is not about fate versus free will, or even about a paradoxical conflation of the two. It's about the unresolvable contradictions that lie at the heart of life.","torrent":{"xt":"urn:btih:b89ef0d520bd8126516adabc353f86cbfa8cf283","amp;dn":"Alice+Hoffman+-+Skylight+Confessions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b89ef0d520bd8126516adabc353f86cbfa8cf283","infoHashBuffer":{"type":"Buffer","data":[184,158,240,213,32,189,129,38,81,106,218,188,53,63,134,203,250,140,242,131]},"announce":[],"urlList":[]}}