{"title":"Steamboat Bill, Jr. (1928)","uid":4639080,"size":486464628,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b9d06975fcb55a5fcea6f1edaa83bb049762517f&amp;dn=Steamboat+Bill%2C+Jr.+%281928%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Willams","files":10,"time":1231656779,"description":"Steamboat Bill Jr. (1928)\n\n\nSteamboat Bill Jr. (1928) is a feature-length comedy silent film featuring Buster Keaton. Released by United Artists, the film is the last product of Keaton's independent production team and set of gag writers. It was not a box-office success and proved to be the last picture Keaton would make for United Artists. Keaton would end up moving to MGM where he would make one last film with his trademark style, The Cameraman, before all of his creative control was taken away by the studio.\n\nThe director was Charles Reisner, the credited writer was Carl Harbaugh (although Keaton wrote the film and publicly called Harbaugh useless but &quot;on the payroll&quot;), and also featured Ernest Torrence, Marion Byron, and Tom Lewis.\n\nThe story concerns a young man straight out of college making good as a Mississippi steamboat captain, trying to follow in his father's footsteps, and falling in love with the daughter of John James King (Tom McGuire) who is his father's business rival.\n\nIMDB: 7.9/10\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0019421/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0019421/&lt;/a&gt;\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\nIf we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\n\n*************************************************************************************","torrent":{"xt":"urn:btih:b9d06975fcb55a5fcea6f1edaa83bb049762517f","amp;dn":"Steamboat+Bill%2C+Jr.+%281928%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9d06975fcb55a5fcea6f1edaa83bb049762517f","infoHashBuffer":{"type":"Buffer","data":[185,208,105,117,252,181,90,95,206,166,241,237,170,131,187,4,151,98,81,127]},"announce":[],"urlList":[]}}