{"title":"The Powerhouse - Steve LeVine - Audiobook MP3","uid":11693677,"size":311924624,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba403522dc324e03ca1faceb6a9a69dc9aef824f&amp;dn=The+Powerhouse+-+Steve+LeVine+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":10,"time":1423627378,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Powerhouse: Inside the Invention of a Battery to Save the World\n\nWritten by: Steve LeVine\nNarrated by: Mike Chamberlain\nLength: 10 hrs and 48 mins\nUnabridged Audiobook\nRelease Date:02-05-15\n\nA Soul of the New Machine for our time, a gripping account of invention, commerce, and duplicity in the age of technology\nA worldwide race is on to perfect the next engine of economic growth, the advanced lithium-ion battery. It will power the electric car, relieve global warming, and catapult the winner into a new era of economic and political mastery. Can the United States win?\nSteve LeVine was granted unprecedented access to a secret federal laboratory outside Chicago, where a group of geniuses is trying to solve this next monumental task of physics. But these scientists - almost all foreign born - are not alone. With so much at stake, researchers in Japan, South Korea, and China are in the same pursuit. The drama intensifies when a Silicon Valley start-up licenses the federal laboratory's signature invention with the aim of a blockbuster sale to the world's biggest carmakers.\nThe Powerhouse is a real-time, two-year thrilling account of big invention, big commercialization, and big deception. It exposes the layers of competition and ambition, aspiration and disappointment behind this great turning point in the history of technology","torrent":{"xt":"urn:btih:ba403522dc324e03ca1faceb6a9a69dc9aef824f","amp;dn":"The+Powerhouse+-+Steve+LeVine+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba403522dc324e03ca1faceb6a9a69dc9aef824f","infoHashBuffer":{"type":"Buffer","data":[186,64,53,34,220,50,78,3,202,31,172,235,106,154,105,220,154,239,130,79]},"announce":[],"urlList":[]}}