{"title":"Helmut Schmidt - Ausser Dienst: Eine Bilanz - HÃƒÂ¶rbuch","uid":4494698,"size":378541914,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ba672c1d9a6f0715c410f2fe903e4836893ff868&amp;dn=Helmut+Schmidt+-+Ausser+Dienst%3A+Eine+Bilanz+-+H%C3%83%C2%B6rbuch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"knoedelfee","files":53,"time":1226143596,"description":"Helmut Schmidt - Ausser Dienst: Eine Bilanz\n\nÃ‚Â»Wenn es um Prinzipien der Politik und der Moral geht oder um das eigene Gewissen, dann ist man niemals ausser Dienst.Ã‚Â« - Die Bilanz eines grossen Staatsmannes.\n\nIn seinem Buch ueber die Zeit nach dem Ausscheiden aus dem Kanzleramt beschreibt Helmut Schmidt die umwaelzenden historischen Entwicklungen seit dem Ende des Kalten Kriegs, er macht sich Gedanken ueber die gegenwaertige Politik und die Zukunft Deutschlands, und er spricht ueber sehr Persoenliches: ueber praegende Kriegserfahrungen, ueber eigene Fehler und Versaeumnisse, seinen Glauben und das Lebensende.\n\nHelmut Schmidt zaehlt zu den grossen Figuren der deutschen Politik, ueber die Parteigrenzen hinweg verkoerpert er fuer viele Deutsche den idealen Staatsmann schlechthin. 25 Jahre nach dem Ende seiner Amtszeit als Bundeskanzler zieht er nun Bilanz - und er aeussert sich gewohnt deutlich zu zentralen Fragen unserer Zeit. So geisselt er die globalen Verwerfungen des Raubtierkapitalismus und er appelliert an die Moral der Eliten in unserem Land. Welchen Leitbildern soll man folgen? Kann man aus der Geschichte lernen? Wie erwirbt man politische Klugheit? Immer wieder kreisen die Gedanken des Autors um das schwierige Selbstverstaendnis der Deutschen, um ihre oft unheilvolle Rolle in der Geschichte und ihre Zukunft innerhalb der Europaeischen Union. Eingestreut sind aber auch hoechst private Reflexionen und Bekenntnisse. Helmut Schmidts Bilanz ist ein lebendiges Buch voller Gedanken und Erinnerungen, sorgfaeltiger Analysen und kleiner Anekdoten, ein Buch, das als die Summe eines reichen Politikerlebens gelten kann. \n\n\n6 Cds\n128 kbit mp3\n361 Mbyte","torrent":{"xt":"urn:btih:ba672c1d9a6f0715c410f2fe903e4836893ff868","amp;dn":"Helmut+Schmidt+-+Ausser+Dienst%3A+Eine+Bilanz+-+H%C3%83%C2%B6rbuch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba672c1d9a6f0715c410f2fe903e4836893ff868","infoHashBuffer":{"type":"Buffer","data":[186,103,44,29,154,111,7,21,196,16,242,254,144,62,72,54,137,63,248,104]},"announce":[],"urlList":[]}}