{"title":"The Beautiful South - Quench [1998]","uid":9460583,"size":367348844,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bc0a5ed32cf46f826c6cc107b1d01a7c34ab7f9d&amp;dn=The+Beautiful+South+-+Quench+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389345236,"description":"Review by William Ruhlmann  [-]\nIn what has become a familiar pattern, Quench, the Beautiful South's sixth regular album release (not counting the singles compilation Carry on Up the Charts), entered the British charts at number one in October 1998, following the number two success of its single, &quot;Perfect 10,&quot; while in the U.S. its release was delayed until July 1999, when it made no commercial impression at all. As usual, Paul Heaton and his comrades take a jaundiced look at the world while crooning melodically over pop, rock, and cocktail jazz tracks. The CD booklet contains only one photograph, an out-of-focus shot of a barroom, and as the album's title implies, Quench is awash in alcohol. Its most telling self-portrait may be &quot;Look What I Found in My Beer,&quot; in which Heaton views his musical career as his salvation from alcoholism and self-loathing. &quot;Look what I found in the mic,&quot; he sings, &quot;An end to screwed-up drinking and a Paul I actually like.&quot; But he often uses metaphors to get across his viewpoint, notably on such songs as &quot;The Slide,&quot; &quot;The Table,&quot; and &quot;Window Shopping for Blinds.&quot; Singer Jacqueline Abbott serves as his foil and expands the dramatic possibilities, especially on the album-closing &quot;Your Father and I,&quot; in which parents tell conflicting stories about a child's conception and birth, only to conclude, &quot;Your father and I won't tell the truth.&quot; If the Beautiful South's early work mixed biting sarcasm with pop riffs, Quench finds the group playing in less of a pop style, while Heaton's lyrics have become more bitter and self-pitying, but no less witty. Still, American recognition continues to seem unlikely for a writer who likes to make puns involving Peter Lorre and a lorry (that's a truck to us Yankees). (3/5)","torrent":{"xt":"urn:btih:bc0a5ed32cf46f826c6cc107b1d01a7c34ab7f9d","amp;dn":"The+Beautiful+South+-+Quench+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc0a5ed32cf46f826c6cc107b1d01a7c34ab7f9d","infoHashBuffer":{"type":"Buffer","data":[188,10,94,211,44,244,111,130,108,108,193,7,177,208,26,124,52,171,127,157]},"announce":[],"urlList":[]}}