{"title":"Indie Classic!: The House of Love-The House of Love1990]","uid":3539820,"size":47200927,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bc5394f14fe6189abe5bf9e73e36b1a65fad1ecb&amp;dn=Indie+Classic%21%3A+The+House+of+Love-The+House+of+Love1990%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tigerduck","files":12,"time":1160934482,"description":"&quot;Following the combination of indie success and massive hype leading up to the band&amp;#039;s first album proved to be too much for the original lineup, with Bickers leaving after a series of problems and pressures once the group signed to Fontana. Yet rarely has a fraught series of recording sessions resulted in something so flat-out stunning. The House of Love&amp;#039;s second self-titled album in a row -- third counting the German singles comp -- remains something of a high-water mark in what can loosely be termed U.K. post-punk music, acting as an effective final statement before the onslaughts of Madchester, grunge, and Brit-pop. It&amp;#039;s almost impossible to tell who is more responsible for what on the album, given its stitched-together nature, but whatever Bickers contributes matches Chadwick&amp;#039;s cool but never cold performances note for note, and the result is deep blue rapture. Starting with the snaky crawl of &quot;Hannah,&quot; sidling in over a series of echoed guitar notes, the 12-song collection does everything from revisiting past heights to scaling new ones. &quot;Shine On&quot; gets re-recorded in an arguably much more powerful performance, Evans&amp;#039; drums and Bickers pounding away out in front, while one early B-side, &quot;The Hedonist,&quot; is turned from a light acoustic number into a evocative modern blues. Another, &quot;Blind,&quot; is changed very little, its simple fragility still holding a soft sway. Everything else is new and quite often stunning, building on the combination of power and emotion from the first album perfectly. &quot;I Don&amp;#039;t Know Why I Love You&quot; remains the group&amp;#039;s definitive single, three and a half minutes of romantic angst matched by a fiery, perfectly arranged performance. &quot;Beatles and the Stones,&quot; meanwhile, far from being a nostalgia piece, refers to the bands in question as &quot;[making] it good to be alone,&quot; with a rich, melancholic acoustic performance to boot. Add in the fiery performances on songs like &quot;32nd Floor&quot; or &quot;In a Room&quot; and the result is a true lost classic.&quot;-AMG\n\nOne of the best and melodic albums ever made. Legendary!\n\nEnjoy!\nTigerducK\n\n1 \t  \tHannah \t                        Chadwick \t5:44\n2 \t  \tShine On \t                Chadwick \t \n3 \t  \tThe Beatles and the Stones \tChadwick \t4:23\n4 \t  \tShake and Crawl \t        Chadwick \t3:40\n5 \t  \tHedonist \t                Chadwick \t3:36\n6 \t  \tI Don&amp;#039;t Know Why I Love You \tChadwick \t3:30\n7 \t  \tNever \t                        Chadwick \t3:43\n8 \t  \tSomeone&amp;#039;s Got to Love You \tChadwick \t3:40\n9 \t  \tIn a Room \t                Chadwick \t4:05\n10 \t  \tBlind \t                        Chadwick \t3:44\n11 \t  \t32nd Floor \t                Chadwick \t4:05\n12 \t  \tSe Dest \t                Chadwick \t5:02\n","torrent":{"xt":"urn:btih:bc5394f14fe6189abe5bf9e73e36b1a65fad1ecb","amp;dn":"Indie+Classic%21%3A+The+House+of+Love-The+House+of+Love1990%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5394f14fe6189abe5bf9e73e36b1a65fad1ecb","infoHashBuffer":{"type":"Buffer","data":[188,83,148,241,79,230,24,154,190,91,249,231,62,54,177,166,95,173,30,203]},"announce":[],"urlList":[]}}