{"title":"DVD Catalyst 4 v4.2.6.0 Retail (1-click run)(registred)","uid":8092774,"size":70928686,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bcb707f831a3e3f22d878678530498de538a96d8&amp;dn=DVD+Catalyst+4+v4.2.6.0+Retail+%281-click+run%29%28registred%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1359758160,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes, \nNo boring installation of tool-bars in your browser,\nYou can even run this torrent from USB-Stick.\nThis makes a '1-click run' version a better version.\n\nConvert DVD to your iPod, your iPhone, Pocket PC, Zen, Zune and more in a breeze. DVD Catalyst is the most advanced, feature-rich DVD conversion tool on the market today, and besides the standard features found in similar products, it offers numerous inductry-unique features to make it as easy to use as possible. DVD Catalyst enables you to convert your own DVD collection to a format that can be played on a video-capable device that does not normally play DVDs. It creates video files from DVDs that are compatible with many different devices, including AppleÎ“Ã‡Ã–s iPod and iPhone devices, Blackberry, Pocket PC, PSP, XBOX 360, PS3, Zen and Zune. Besides converting DVDs, it can also convert video files from and to a variety of different video formats, without the need to install codecs. No additional software is required for DVD Catalyst to do itÎ“Ã‡Ã–s thing.\n\nFeatures:\n\n- Unique 1-click interface\n- Converts all DVDs and all common video files to a format that can be played on virtually any portable device, including new codec standards and releases as well as DIVX, XVID, AVI, MPEG, MPEG4, TiVo, DVR-MS (SD), TS, FLV, ISO, MDF\n- Does not need any additional software for accessing protected DVDs\n- Converts to all common video file formats, including AVC, H264, MP4, DIVX, XVID, WMV, 3GP, MPEG\n- Complete freedom on quality settings and target size\n- Multi-Device queue\n- Automatic batching\n- Multiple DVD drives, video files, video folders are all automatically queued up for conversion\n- Automatic (0 Click) conversion\n- Automatic black bar (letterbox) removal","torrent":{"xt":"urn:btih:bcb707f831a3e3f22d878678530498de538a96d8","amp;dn":"DVD+Catalyst+4+v4.2.6.0+Retail+%281-click+run%29%28registred%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcb707f831a3e3f22d878678530498de538a96d8","infoHashBuffer":{"type":"Buffer","data":[188,183,7,248,49,163,227,242,45,135,134,120,83,4,152,222,83,138,150,216]},"announce":[],"urlList":[]}}