{"title":"[-Nubiles-Casting-] Fiona Sage, Sammie Daniels [-Sammie Daniels","uid":11892581,"size":370642535,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bccda070caf0a5be3a2319cf2f2f4a7dca535f3e&amp;dn=%5B-Nubiles-Casting-%5D+Fiona+Sage%2C+Sammie+Daniels+%5B-Sammie+Daniels+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1431030919,"description":"[-Nubiles-Casting-] Fiona Sage, Sammie Daniels [-Sammie Daniels Cast Fiona Sage Ep1-] --NEW-- 07-May-2015\n\n---:More From My Torrent's Here:---    &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---   &lt;a href=&quot;\nhttp://image-tpb.com/img-554b63f54fcaa.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-554b63f54fcaa.html&lt;/a&gt; \n  &lt;a href=&quot;\nhttp://image-tpb.com/img-554b63f622cbb.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-554b63f622cbb.html&lt;/a&gt; \n\nCutie Sammie Daniels is trying her hand at interviewing the giggly Fiona Sage. Fiona proves that she has no problems getting naked when she peels off her clothes and drops her bra and panties, leaving her small tits and bald pussy open to Sammie's questioning gaze.\n\nAfter Fiona answers a few more questions about her sexual preferences, Sammie asks the male talent Cody, who is standing by, to help assess Fiona's sexuality. Cody is happy to oblige, kissing his way up Fiona's thighs until he reaches the nectar of her creamy snatch.\n\nNext Fiona shows off her cock sucking skills. She starts off tentatively at first, taking small licks at the head of Cody's cock, but soon she is going to town deep throating and licking at her manly treat. The scene before Sammie is so hot that she can't keep her clothes on; she starts working her way out of her dress as she films Fiona loving every lick of her deep throat blowjob.\n\nIn the next part of the interview Fiona lays on her back and takes Cody's dick between her legs. He's gentle to start, and soon Sammie is offering Fiona sex tips that make it hotter for both partners and easier for Cody to go fast and furious.\n\nWhen Fiona turns around to give Cody her ass for some doggy style fucking, her man pounds her pussy hard! Even though Cody pulls out and covers Fiona's back in cum, he's still rock hard and ready for more. Fiona takes advantage, riding his dick and then settling into a spooning position as Cody fucks her tight twat towards orgasmic satisfaction.\n\nWhen Sammie offers Fiona a magic wand vibrator to finish herself off, the missing piece finally falls into place! Within seconds Fiona is moaning her completion while her whole body pulses with orgasmic ecstasy. A second climax follows the first within moments, sealing the deal that this hot number is definitely Nubiles material!","torrent":{"xt":"urn:btih:bccda070caf0a5be3a2319cf2f2f4a7dca535f3e","amp;dn":"%5B-Nubiles-Casting-%5D+Fiona+Sage%2C+Sammie+Daniels+%5B-Sammie+Daniels+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bccda070caf0a5be3a2319cf2f2f4a7dca535f3e","infoHashBuffer":{"type":"Buffer","data":[188,205,160,112,202,240,165,190,58,35,25,207,47,47,74,125,202,83,95,62]},"announce":[],"urlList":[]}}