{"title":"Phil Rickman - The Bones of Avalon","uid":5956968,"size":404117790,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bce1964c71bebb2954e8eb20115bbdb9c2291842&amp;dn=Phil+Rickman+-+The+Bones+of+Avalon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"fakeplastictrousers2","files":-1,"time":1289765763,"description":"Unabridged; Written by Phil Rickman; Read by Sean Barrett; ripped by fakeplastictrousers\n\nIt is 1560. Elizabeth Tudor has been on the throne for a year, the date for her coronation having been chosen by her astrologer, Dr John Dee, at just 32 already famous throughout Europe as a mathematician and expert in the hidden arts. But neither Elizabeth nor Dee feel entirely secure. Both have known imprisonment for political reasons. The Queen is unpopular with both Roman Catholics and the new breed of puritanical protestant. Dee is regarded with suspicion in an era where the dividing line between science and sorcery is, at best, indistinct. And the assignment he's been given by the Queen's chief minister, Sir William Cecil, will blur it further: ride to the ruins of Glastonbury Abbey, bring back King Arthur's bones. The mission takes the mild, bookish Dee to the tangled roots of English magic and the Arthurian legacy so important to the Tudors. Into unexpected violence, spiritual darkness, the breathless stirring of first love...and the cold heart of a complex plot against Elizabeth.","torrent":{"xt":"urn:btih:bce1964c71bebb2954e8eb20115bbdb9c2291842","amp;dn":"Phil+Rickman+-+The+Bones+of+Avalon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bce1964c71bebb2954e8eb20115bbdb9c2291842","infoHashBuffer":{"type":"Buffer","data":[188,225,150,76,113,190,187,41,84,232,235,32,17,91,189,185,194,41,24,66]},"announce":[],"urlList":[]}}