{"title":"Physics of Materials - Yves Quere","uid":14561641,"size":51260602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be4a323db3fbfa5367b57ae3c73209fbe5b532c7&amp;dn=Physics+of+Materials+-+Yves+Quere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462744115,"description":"Physics of Materials - Yves Quere (Gordon and Breach, 1998).pdf\r\n\r\nISBN 90-5699-119-1\r\n\r\nFew areas of science are as interdisciplinary as materials science. Chemistry, physics, mechanical engineering, and mathematics each play a part within it. The role of physics is to describe the objects, effects and phenomena at different scales (micro-, meso-, and macroscopic) as precisely as possible.\r\nPhysics of Materials addresses this description at the elementary level. Based on an undergraduate level course taught at the Ecole Polytechnique, France, the main emphasis is on the conduction related phenomena (electronic properties) and the plastic behavior (ionic properties) of materials, such as metals and alloys, semiconductors, and ceramics. It assumes a basic grounding in statistical physics, quantum mechanics and elasticity but does not require prior knowledge of solid-state physics, to which it will serve as a useful introduction.\r\nThe presentation of the course is followed by several examination problems, with solutions, which cover various specific applications of the general concepts and which will enable readers to test their understanding of these concepts","torrent":{"xt":"urn:btih:be4a323db3fbfa5367b57ae3c73209fbe5b532c7","amp;dn":"Physics+of+Materials+-+Yves+Quere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be4a323db3fbfa5367b57ae3c73209fbe5b532c7","infoHashBuffer":{"type":"Buffer","data":[190,74,50,61,179,251,250,83,103,181,122,227,199,50,9,251,229,181,50,199]},"announce":[],"urlList":[]}}