{"title":"Alex Jones Show - 2012 Apr 05 TH [sebaygo1]","uid":7162982,"size":64711312,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:be70c2606c58b2cfa14f57609d9ad1983028144b&amp;dn=Alex+Jones+Show+-+2012+Apr+05+TH+%5Bsebaygo1%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sebaygo1","files":4,"time":1333678182,"description":".\n\t\t\t\t\t\t\t\nThe Alex Jones Show\nThursday, 05 April 2012\n\n\n[sebaygo1]\n\n\nShow Description\n................\n\nFrom the Infowars web site ::\n\nOn the Thursday, April 5 edition of the Alex Jones Show, Alex talks with John Perkins, author of the New York Times bestseller Confessions of an Economic Hit Man. Perkins spent the 1970s working as an economic planner for an international consulting firm. In his book he describes how the globalists force the economic hegemony of the banksters, the IMF and World Bank on victim nations in the third world. &quot;Economic hit men are highly paid professionals who cheat countries around the globe out of trillions of dollars,&quot; Perkins writes. He is also the author of The Secret History of the American Empire: The Truth About Economic Hit Men, Jackals, and How to Change the World and Hoodwinked: An Economic Hit Man Reveals Why the World Financial Markets Imploded -- and What We Need to Do to Remake Them. \n\nAlex also talks withjournalist and editor Patrick Henningsen about U.S. soldiers trafficking arms and drugs to DEA agents posing as Los Zetas.\n\n\n\n\n\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\nNot able to find a torrent of mine where or when you \nexpected it?\nCheck out my torrents blog for info about what I am\nuploading, tracker problems, etc..\n\nSome sites will not allow a blogspot URL in an \nuploaded torrent's description, so I have included \nthe blog's web address in a file included with this\ntorrent named:\nsebaygo1_TorrentsAndBlogInfo_ver2.pdf\n#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#%#\n\n\n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n \n It is my opinion that in this time it is virtually essential \n to seek information from a variety of sources, to listen to a\n spectrum of voices in order to better  understand the &quot;big \n picture.&quot; A reliance solely upon mainstream corporate media \n for news and info is a prescription for ignorance. I try to\n share information that counters the monotone of mainstream\n corporate media. \n\n NOTE: The material here is made available strictly as\n information. Do not assume my support for or endorsement \n of the contents.\n\n Think for yourself! To paraphrase the late William Cooper: \n Read everything, listen to everything, but believe nothing \n until you've researched it yourself.\n \n !! please try some of the other shows I upload too !! \n\n_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/_/\n..........\n\nfolder.jpg courtesy of commenter &quot;Nighted&quot; at the sebaygo1 blog\n..........\n","torrent":{"xt":"urn:btih:be70c2606c58b2cfa14f57609d9ad1983028144b","amp;dn":"Alex+Jones+Show+-+2012+Apr+05+TH+%5Bsebaygo1%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be70c2606c58b2cfa14f57609d9ad1983028144b","infoHashBuffer":{"type":"Buffer","data":[190,112,194,96,108,88,178,207,161,79,87,96,157,154,209,152,48,40,20,75]},"announce":[],"urlList":[]}}