{"title":"Mathematics for Equity - Na'ilah Suad Nasir, Carlos Cabana","uid":12846188,"size":2302553,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be9b35d3e5a675904b3b4dd5c26da70d634a0ac8&amp;dn=Mathematics+for+Equity+-+Na%27ilah+Suad+Nasir%2C+Carlos+Cabana&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448557974,"description":"''Mathematics for Equity provides a kaleidoscopic view, in the voices of teachers, researchers, and students themselves, of one of the nation's most ambitious and successful attempts at teaching mathematics for equity. It shows what it takes to create a climate that supports students and teachers in engaging in meaningful mathematical activity--and, alas, how vulnerable such environments are to the wrong kinds of 'accountability.' Read it and learn.''\r\n--Alan H. Schoenfeld, University of California at Berkeley\r\n\r\nIn this book, nationally renowned scholars join classroom teachers to share equity-oriented approaches that have been successful with urban high school mathematics students. Compiling for the first time major research findings and practitioner experiences from Railside High School, the volume describes the evolution of a fundamentally different conception of learners and teaching. The chapters bring together research and reflection on teacher collaboration and professional community, student outcomes and mathematics classroom culture, reform curricula and pedagogy, and ongoing teacher development.\r\n\r\nMathematics for Equity will be invaluable reading for teachers, schools, and districts interested in maintaining a focus on equity and improving student learning while making sense of the new demands of the Common Core State Standards.\r\n\r\nBook Features:\r\n\r\n• Core principles of an equity-centered mathematics program.\r\n\r\n• Examples of how to focus and organize the collaborative work of a math department to develop a shared pedagogy.\r\n\r\n• Student experiences with an equity pedagogy that focuses on building perseverance, flexibility in thinking, and deep conceptual understanding.\r\n\r\n• Connections between reconceptualizing learners and teaching, and achieving deep mathematics learning and equitable outcomes.\r\n\r\nContributors include: Jo Boaler, Ilana Seidel Horn, Judith Warren Little, and Rachel Lotan","torrent":{"xt":"urn:btih:be9b35d3e5a675904b3b4dd5c26da70d634a0ac8","amp;dn":"Mathematics+for+Equity+-+Na%27ilah+Suad+Nasir%2C+Carlos+Cabana","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be9b35d3e5a675904b3b4dd5c26da70d634a0ac8","infoHashBuffer":{"type":"Buffer","data":[190,155,53,211,229,166,117,144,75,59,77,213,194,109,167,13,99,74,10,200]},"announce":[],"urlList":[]}}