{"title":"The Imaginarium of Doctor Parnassus (2010 Bios) R5 Cust.NL 2Lion","uid":5310568,"size":4602726562,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:beed2d04773471240bbfa190d83ddc5b692ac4f8&amp;dn=The+Imaginarium+of+Doctor+Parnassus+%282010+Bios%29+R5+Cust.NL+2Lion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pioen","files":-1,"time":1264546865,"description":"The Imaginarium of Doctor Parnassus (2009) PAL \n\nAlternatieve titel: The Imaginarium of Dr. Parnassus \n\n      \nVanaf 4 februari in de bioscoop\n\n\nVerenigd Koninkrijk / Canada / Frankrijk\nMystery / Fantasy\n122 minuten\n\ngeregisseerd door Terry Gilliam\nmet Heath Ledger, Christopher Plummer en Lily Cole\n\nDe film vertelt het verhaal van Dr. Parnassus (Christopher Plummer), die met zijn theatergezelschap stad en land afreist om het publiek nog nooit vertoond vertier voor te schotelen. Zijn gave maakt het zijn publiek mogelijk om via een magische spiegel aan de realiteit van alledag te ontsnappen. Maar er rust ook een vloek op hem. Al eeuwen lang sluit hij namelijk weddenschappen af met de duivel, Mr. Nick (Tom Waits), waaraan hij o.m. zijn exclusieve onsterfelijkheid te danken heeft. Diezelfde Mr. Nick keert nu terug om een prijs voor hemzelf op te eisen, namelijk de innemende en kostbare dochter van Dr. Parnassus, Valentina (Lily Cole), op de dag dat ze zestien jaar wordt. Dr. Parnassus heeft nog een laatste weddenschap met Mr. Nick nodig om zich uit deze benarde situatie te redden.\n\nEnglish\n\nThe Imaginarium of Doctor Parnassus is a fantastical morality tale, set in the present day. It tells the story of Dr Parnassus and his extraordinary 'Imaginarium', a travelling show where members of the audience get an irresistible opportunity to choose between light and joy or darkness and gloom. Blessed with the extraordinary gift of guiding the imaginations of others, Dr Parnassus is cursed with a dark secret. Long ago he made a bet with the devil, Mr Nick, in which he won immortality. Many centuries later, on meeting his one true love, Dr Parnassus made another deal with the devil, trading his immortality for youth, on condition that when his first-born reached its 16th birthday he or she would become the property of Mr Nick. Valentina is now rapidly approaching this 'coming of age' milestone and Dr Parnassus is desperate to protect her from her impending fate. Mr Nick arrives to collect but, always keen to make a bet, renegotiates the wager. Now the winner of Valentina will be determined by whoever seduces the first five souls. Enlisting a series of wild, comical and compelling characters in his journey, Dr Parnassus promises his daughter's hand in marriage to the man that helps him win. In this captivating, explosive and wonderfully imaginative race against time, Dr Parnassus must fight to save his daughter in a never-ending landscape of surreal obstacles - and undo the mistakes of his past once and for all... \n\n\n\n\n\n******************************************\nImaginarium of Doctor Parnassus, The (2009) \n\n\n\nMovie..............: Imaginarium of Doctor Parnassus, The (2009) \ngenre..............: Mystery / Fantasy\nSource.............: The Imaginarium of Doctor Parnassus 2010 DVD R5 ENGLISH AC3-GURU \nFormat.............: DVDR\nruntime............: 122 min.\nMenu...............: Nope\nVideo..............: 1-1 untouched\nAudio..............: Eng: DD 2.0\nSubtitles..........: Vertaald door Suurtje Tokke &amp; Biteme \nControle...........: Tokke &amp; Suurtje\nBewerking+Resync...: Tokke &amp; Suurtje\n\n\n\n****************************************************************\n\n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : R5\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Fantasiefilm\nMysterie\n \nWeblink : http://www.moviemeter.nl/film/49753 \nWeblink : http://www.imdb.com/title/tt1054606\n\n*****************************************\n\nBrought to you by \n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\t\n\n","torrent":{"xt":"urn:btih:beed2d04773471240bbfa190d83ddc5b692ac4f8","amp;dn":"The+Imaginarium+of+Doctor+Parnassus+%282010+Bios%29+R5+Cust.NL+2Lion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"beed2d04773471240bbfa190d83ddc5b692ac4f8","infoHashBuffer":{"type":"Buffer","data":[190,237,45,4,119,52,113,36,11,191,161,144,216,61,220,91,105,42,196,248]},"announce":[],"urlList":[]}}