{"title":"Democracy Now - 08 nov 2011","uid":6804072,"size":457746782,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:bf568678708577c89dda80061b0ae4337d8fda3d&amp;dn=Democracy+Now+-+08+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320790985,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 08, 2011\n\n-  Syrian Troops Launch Bloody Assault in Third Largest City\n-  Italy's Prime Minister Under Pressure to Resign as Massive Economic Crisis Worsens\n-  Woman Accuses GOP Presidential Hopeful Herman Cain of Improper Touching\n-  Voting Day: Ohio to Decide on Controversial Anti-Union Legislation\n-  Architect of Arizona's Anti-Immigration Law Faces Recall\n-  Mississippi Voting on Bill to Grant Embryos Personhood\n-  New Census Data Shows a Record 49 Million Americans Living in Poverty\n-  Over 1,000 Senior Citizens Join Occupy Chicago to Oppose Social Security Cuts; About 50 Arrested\n-  Video Shows Oakland Police Shooting Man as He Films Occupy Protest\n-  French President to Obama: Israel Prime Minister Netanyahu is a &quot;Liar&quot;\n-  State Department Opens &quot;Special Review&quot; of Controversial Keystone XL Tar Sands Oil Pipeline\n\n\nSpecial reports\n\n- Israel Deports Democracy Now! Correspondent Jihan Hafiz; Most Gaza Flotilla Activists Still Detained\n\nThe Israeli government continues to detain a number of passengers seized in international waters Friday while trying to challenge the Israeli naval blockade on Gaza. The passengers were on two boats - one from Canada and the other from Ireland - as part of the &quot;Freedom Waves&quot; flotilla. Some 20 activists are believed to remain in custody after refusing to sign statements asserting they had entered Israel illegally. Flotilla organizers have accused the Israeli military of physically assaulting some of the activists and tasering at least one of them. Democracy Now! correspondent Jihan Hafiz was among those detained despite her press credentials. Hafiz had been filing daily reports for Democracy Now! from the Canadian ship named &quot;Tahrir.&quot; She spent three nights behind bars, where she was strip-searched and denied phone calls to relatives for 48 hours. She was finally deported Monday night and arrived in New York City just hours ago. Israel has not returned her equipment or footage. In a Democracy Now! exclusive, Hafiz joins us in our New York studio. &quot;All of the [Israeli] commandos on all of these boats were heavily armed... It looked like they were taking on an army of a foreign country,&quot; says Hafiz, noting the masked soldiers pointed their guns at the heads of those on board.\n\n\n- Exclusive: 5,000 Haitian Cholera Victims Sue U.N. After Deadly Epidemic Kills 6,000, Sickens 450,000\n\nA lawsuit has been filed on behalf of more than 5,000 Haitians against the United Nations over the cholera outbreak that has further devastated Haiti in the aftermath of the January 2010 earthquake. Some 450,000 Haitians have been sickened, and more than 6,000 have died, since the cholera outbreak erupted in October 2010, just over a year ago. It is widely believed the cholera was brought to Haiti by a battalion of Nepalese troops with the U.N. peacekeeping force. In a complaint to the United Nations, the attorneys for the Haitian victims also accuse the organization of reckless failure in containing the outbreak, arguing it is &quot;directly attributable to the negligence, gross negligence, recklessness and deliberate indifference&quot; for the health and lives of Haitians. &quot;Time after time, the response has been to deny the allegations. We're hoping that this is the case that's too big to fail, that the evidence against the United Nations is so overwhelming here that the U.N. will have no choice but to finally take responsibility for its malfeasance,&quot; says attorney Brian Concannon of the Institute for Justice &amp; Democracy in Haiti. &quot;What we are asking for, what our clients are asking for, is the U.N. and the international community to step up and to give Haiti the sanitation infrastructure it needs to stop the epidemic.&quot;\n\n\n- The Koch-Cain Connection: IRS Urged to Probe Ties Between Cain Campaign and Billionaire Koch Brothers\n\nThe campaign of Republican presidential hopeful Herman Cain took another hit on Monday when a fourth woman emerged to accuse him of sexual harassment in the 1990s. But the allegations of sexual harassment are not the only controversies surrounding Cain. Also on Monday, the Wisconsin-based Center for Media and Democracy filed a complaint asking the Internal Revenue Service to investigate whether one of his top aides has used tens of thousands of dollars from a tax-exempt nonprofit organization to fund Cain's political activities. Citing leaked financial records, the Center says Cain's campaign manager, Mark Block, used at least $40,000 from his group, Prosperity USA, to pay for Cain's private jets, air travel and computers when he was exploring a presidential bid. Block founded Prosperity USA just last year. The leaked records cited in the complaint also suggest extensive financial ties between Block's Prosperity USA, the Cain campaign, and the right-wing advocacy group founded by billionaire David Koch, Americans for Prosperity. Block stepped down from heading the Wisconsin arm of Americans for Prosperity to run Cain's campaign. We speak with Lisa Graves, executive director of the Center for Media and Democracy, about its request that the IRS investigate the group's tax-exempt status, and other ways Block may have been funneling money to political campaigns.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:bf568678708577c89dda80061b0ae4337d8fda3d","amp;dn":"Democracy+Now+-+08+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf568678708577c89dda80061b0ae4337d8fda3d","infoHashBuffer":{"type":"Buffer","data":[191,86,134,120,112,133,119,200,157,218,128,6,27,10,228,51,125,143,218,61]},"announce":[],"urlList":[]}}