{"title":"The Crystal City: The Tales of Alvin Maker, Volume VI","uid":9670761,"size":333984122,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bfbf4cdf64039f45b25e0f86665663eb7abad1ce&amp;dn=The+Crystal+City%3A+The+Tales+of+Alvin+Maker%2C+Volume+VI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"disk_55FL","files":27,"time":1393457167,"description":"Using the lore and the folk-magic of the men and women who settled North America, Orson Scott Card has created an alternate world where magic works, and where that magic has colored the entire history of the colonies. Charms and beseechings, hexes and potions, all have a place in the lives of the people of this world. Dowsers find water, the second sight warns of dangers to come, and a torch can read a person's future---or their heart.\nIn this world where &quot;knacks&quot; abound, Alvin, the seventh son of a seventh son, is a very special man indeed. He's a Maker; he has the knack of understanding how things are put together, how to create them, repair them, keep them whole, or tear them down. He can heal hearts as well as bones, he build a house, he can calm the waters or blow up a storm. And he can teach his knack to others, to the measure of their own talent.\n\nAlvin has been trying to avert the terrible war that his wife, Peggy, a torch of extraordinary power, has seen down the life-lines of every American. Now she has sent him down the Mizzippy to the city of New Orleans, or Nueva Barcelona as they call it under Spanish occupation. Alvin doesn't know exactly why he's there, but when he and his brother-in-law, Arthur Stuart, find lodgings with a family of abolitionists who know Peggy, he suspects he'll find out soon.\n\nBut Nueva Barcelona is about to experience a plague, and Alvin's efforts to protect his friends by keeping them healthy will create more danger than he could ever have suspected. And in saving the poor people of the city, Alvin will be put to the greatest test of his life---a test that will draw on all his power. For the time has come for him to turn to his old friend Tenskwa-Tawa, the Red Prophet who controls the lands to the west of the Mizzippy. Now Alvin must take the first steps on the road to the Crystal City that was shown to him in a vision so long ago.","torrent":{"xt":"urn:btih:bfbf4cdf64039f45b25e0f86665663eb7abad1ce","amp;dn":"The+Crystal+City%3A+The+Tales+of+Alvin+Maker%2C+Volume+VI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bfbf4cdf64039f45b25e0f86665663eb7abad1ce","infoHashBuffer":{"type":"Buffer","data":[191,191,76,223,100,3,159,69,178,94,15,134,102,86,99,235,122,186,209,206]},"announce":[],"urlList":[]}}