{"title":"David Satter - Darkness at Dawn. The Rise of the Russian Crimina","uid":10228070,"size":10947313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0138bdd9fe2d460fb1b7938ff1b37a8a919465f&amp;dn=David+Satter+-+Darkness+at+Dawn.+The+Rise+of+the+Russian+Crimina&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401111242,"description":"Description\nProduct Details\nBook Title: Darkness at Dawn: The Rise of the Russian Criminal State\t\nBook Author: David Satter\nHardcover: 336 pages\nPublisher: Yale University Press (April 10, 2003)\nLanguage: English\nISBN-10: 0300098928\nISBN-13: 978-0300098921\n\n===================================================================================\nBook Description\nPublication Date: April 10, 2003 | ISBN-10: 0300098928 | ISBN-13: 978-0300098921\nAnticipating a new dawn of freedom and democracy after the disintegration of the Soviet Union, Russians could hardly have foreseen the reality of their future a decade later: a country desperately impoverished and controlled at every level by criminals. This is the story of the 1990s reform period in Russia through the experiences of individual citizens. Recounting in detail the development of a new era of oppression, journalist David Satter conveys the staggering nature of the changes that have swept Russian life, society and ways of thinking. Through the stories of people at all levels of Russian society, Satter describes fraudulent investment schemes, massive corruption, and the intrusion of organized crime everywhere. With insights derived from more than 20 years of writing and reporting on Russia, Satter considers why the individual human being there has historically counted for so little. He also offers an analysis of how Russia's post-Soviet fate was decided when a new morality failed to fill the vast moral vacuum that communism left in its wake.\n\n===================================================================================\nReviews\n&quot;.... [A] humane and articulate attempt to record the consciousness of ordinary Russians waking up to an unrecognizable historical reality.&quot; -- Raymond Asquith, The Spectator (U.K)\n\n&quot;.... [V]ivid, impeccably researched and truly frightening.&quot; -- Martin Sieff, United Press International/Washington Times\n\n&quot;Satter has.... a reporter's eye for vivid detail and a novelist's ability to capture emotion.&quot; -- Robert Legvold, Foreign Affairs\n\n&quot;This brave engaging book should be required reading for anyone interested in the post-Soviet state.&quot; -- Newsweek\n\nDavid Satter must be commended for saying what a great many people only dare to think.&quot; -- Matthew Brzezinski, The Toronto Globe and Mail\n\n===================================================================================\nFrom the Publisher\nAlso Available by David Satter: Age of Delirium\n\n===================================================================================\nFrom the Inside Flap\n&quot;.... [D]escribes more compellingly than any abstract theorist could the consequences of nominal freedom without the rule of law.&quot; - Michael Potemra, National Review\n\n&quot;If policy makers wish to avoid getting another Russian rake in the face, they should read Darkness at Dawn.&quot; - Sean McMeekin, The Weekly Standard\n\n===================================================================================\nAbout the Author\nDavid Satter, a Moscow correspondent for major newspapers for many years, is now senior fellow at the Hudson Institute and visiting scholar at the Johns Hopkins University School of Advanced International Studies. He is the author of Age of Delirium: The Decline and Fall of the Soviet Union (ISBN 0 300 08705 5, [pound]12.95* pb.), also published by Yale University Press.\n===================================================================================","torrent":{"xt":"urn:btih:c0138bdd9fe2d460fb1b7938ff1b37a8a919465f","amp;dn":"David+Satter+-+Darkness+at+Dawn.+The+Rise+of+the+Russian+Crimina","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0138bdd9fe2d460fb1b7938ff1b37a8a919465f","infoHashBuffer":{"type":"Buffer","data":[192,19,139,221,159,226,212,96,251,27,121,56,255,27,55,168,169,25,70,95]},"announce":[],"urlList":[]}}