{"title":"Max Clifford admits to covering up Child Abuse","uid":7803494,"size":16462906,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c03ea452d1a0510341f629e2b45de6ae11d7ac15&amp;dn=Max+Clifford+admits+to+covering+up+Child+Abuse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flamesong","files":1,"time":1352341961,"description":"A covertly recorded video in which publicist and self-styled PR guru, Max Clifford states that he creates false images,  deceives people and and lies. He then goes on to admit that he had played a part in covering up the sexual abuse by Tory Minister, Alan Clark of two girls from the age of 14 who were the daughters of his mistress, stating, 'The only slightly serious side about it was he'd actually interfered with those girls from the age of fourteen.'\n\nMax Clifford is now the PR Ambassador for the charity Children In Need.\n\nDC is allegedly Dominic Carmen who it is believed uploaded this video and then removed it (or made it private) for reasons unknown once the Jimmy Savile scandal began to widen into other areas of child abuse. It is for reasons of public interest that this video has been re-uploaded. Max Clifford hs serious questions to answer.\n\nFull Transcript:\n\nMC: No problems at all as long as they're not interfering with little\nkids. Absolutely no problems. Because I know that the truth will\ndestroy them, and they don't deserve that. So I create a false image. I'm\ndeceiving people, I'm lying, for sure. But for me, it's the same kind\nof lie when you got to a dinner party, and your host says: 'Did you\nenjoy the meal?&quot;, and you think: well it was awful. You say: &quot;It was\nlovely, thank you.&quot; It's that kind of situation.'\n\nDC: Where do you get your inspiration from? Some of it's marvellous.\n\nMC: From the public.\n\nDC: Chelsea football shirt and David Mellor. The Harkness coven with Alan Clark?\n\nMC: Again, they come to me. I don't go to them. They come to me, and we go from there.\n\nDC: to persuade a judge: &quot;I should, or would, have him horsewhipped&quot; -- I thought\nthat, I always thought that was his...\n\nMC: I think that...things I get credited with. It's like Alan Clark. Wonderful piece in that was when she, Mrs Clark, started talking about &quot;below stairs&quot;. Nothing to do with me, but wonderful.\n\nDC: Straight out of Upstairs Downstairs.\n\nMC: Wonderful for me. You couldn't have written the script, to make it\neven better and inflame it. And he enjoyed the whole thing. Alan Clark\nloved the whole thing. The only thing about it, you had...they made a\nlot of money out of it. He'd used them, so they wanted to make money out\nof it, they had a moan, so they did. He enjoyed it: he sold even more\nbooks. The only slightly serious side about it was he'd actually\ninterfered with those girls from the age of fourteen.\n\nDC: That wasn't publicised was it?\n\nMC: No, It didn't come out. Because by the time the pair of them came over here,\nmost of the time they were totally pissed, and mother and daughter were fighting each other to get on this television show. Turned into a farce and a pantomime.\n\nDC: Must admit I never saw that. Must have been quite a combination.\nExtraordinary story.\n\nMC: It was. The whole thing was. And most of the things are. What's\nreally going on. It's the funniest thing, which is why it will be\nintriguing if Laurence and Gran, Birds of a Feather and all that? They're doing\na tv series, based on me.\nDC: Oh, are they?\n\nMC: Of course I can bring out the stories and the adventures, and just\nchange it around, it's all fiction...\n\nDC: Who will play you?\n\nMC: Possibly Adam Faith.\n\nDC: He's a good friend of yours, isn't he?\n\nMC: Yes, been mates since 1958. In fact, he was here earlier. That's\nall in the melting pot, it's up to them. But that could be funny. That\nthen could give me the perfect scenario to bring out the truth. People\nwouldn't know it to be the truth. You move it around, it's not a\npolitician, it's a pop star. What happened is exactly..people would\nthink: &quot; I can't believe that. No way.&quot;\nI've said: I'll never write the book, I'll write the funny stories one day. Because I don't want to harm, it's never been my nature.\n\nDC: And there's the defamation risk?\n\nMC: No, that's easy for me because I've got all the evidence. I'm the\none who's hidden it from the world. I know where everything is and\nthe proof is.\n\nDC: It's not stored in the cupboard?\n\nMC: No, it's a long, long way from here, I can promise you. You can\nsee my point. That's why I have such a good relationship with the\npeople I work with. Because ten, twenty, thirty years go by and no-one\nin the world knows. I could have retired on one of these things,\nwhether it was...whoever, any of the people.","torrent":{"xt":"urn:btih:c03ea452d1a0510341f629e2b45de6ae11d7ac15","amp;dn":"Max+Clifford+admits+to+covering+up+Child+Abuse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c03ea452d1a0510341f629e2b45de6ae11d7ac15","infoHashBuffer":{"type":"Buffer","data":[192,62,164,82,209,160,81,3,65,246,41,226,180,93,230,174,17,215,172,21]},"announce":[],"urlList":[]}}