{"title":"Tribe","uid":4671597,"size":48515302,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c061c9599cf0bea507a280cf44dce9133c62e61c&amp;dn=Tribe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"gilgamesh07","files":5,"time":1232752263,"description":"By request from the forums, this torrent contains issues 1-3 of Larry Stroman's &quot;Tribe&quot; comic.\n\nTribe was a short-lived comic book published first in 1993. Created by Todd Johnson and Larry Stroman, Tribe launched as part of Image Comics' second round of titles and with sales of over one million copies is still the largest selling African American comic produced by African American creators.[citation needed] Although Tribe had been intended as a series it was canceled due to publishing delays.\n\nAxis Comics later printed two more issues (2,3) of the series before itself going under due to financial difficulties. The final issue (0) was published by Good Comics.\n\nTribe was a comic about the adventures of a predominantly African-American and minority superhero group based out of Brooklyn, New York. During its limited run, the plot of Tribe centered on their conflicts with a conglomerate of European and Japanese techno-pirates known as &quot;Europan&quot;, which had a mysterious connection to a power-crazed, armor-clad villain known as &quot;Lord Deus&quot;. The final issue also featured an appearance by Erik Larsen's Savage Dragon, even positing an alternate origin for the character.\n\nDue to constant changes behind the scenes, with Stroman and Johnson switching companies, Tribe's release schedule was spotty, and the opening storyline seemed to meander and constantly shift focus, hinting at future twists that would never see fruition. In issue #1, Blindspot and Hannibal rescue young illusionist Alexander Collins from thugs hired by Europan, introducing him to their collective. In #2, Europan attacks both Collins #later to be known as &quot;Front&quot;# and the lab of a Tribe-associated scientist who later becomes known as &quot;Steel Pulse&quot; after his liquid metal armor is released by gunfire from the Europan cyborgs and becomes bonded to his body. Tribe also faces the faux-&quot;gangsta&quot; superpowered assassin &quot;Out Cold&quot; at Front's club. Suddenly, the bizarre &quot;Lord Deus&quot; arrives on the scene, along with the Savage Dragon, who is on duty as a police officer.\n\nIn the final published issue of Tribe from the short-lived Good Comics #confusingly numbered &quot;#0&quot;, but actually concluding the existing storyline from Image#, Tribe and the Dragon fight Lord Deus, who drops portentous hints as to his true supernatural nature and sends the Dragon back in time #thus revealing his &quot;origin&quot;#. Suddenly, team strongwoman &quot;Rosalyn&quot; transforms into a godlike armored being who proclaims she &quot;remembers&quot; her true past, implying that she is an immortal and an old enemy of Deus. Deus is defeated by Rosalyn and escapes, while the rest of Tribe is confused by her new appearance and powers.\n\nEven after leaving Image Comics, Tribe continued to drop hints and in-jokes regarding its universe's characters, as well as including the cameo from the Savage Dragon. In issue #2, Tribe tries to avoid scrutiny from the police by claiming to be the &quot;Urban Division&quot; of Youngblood.\n\nI was unable to locate issue #0 and as far as I know, it has not yet been scanned. Issue #2 was recently scanned and so I decided to put this up. Maybe if there are enough people asking after it, a scan of issue #0 will be created and find it's way to this audience.\n\nThanks to the scanners and the original sources who shall remain nameless.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:c061c9599cf0bea507a280cf44dce9133c62e61c","amp;dn":"Tribe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c061c9599cf0bea507a280cf44dce9133c62e61c","infoHashBuffer":{"type":"Buffer","data":[192,97,201,89,156,240,190,165,7,162,128,207,68,220,233,19,60,98,230,28]},"announce":[],"urlList":[]}}