{"title":"MW4 Mercs Free Release complete version (.0030 including hotfixe","uid":9771883,"size":4543609193,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c095124179241aa6f262102b2847ea8d257fbe3b&amp;dn=MW4+Mercs+Free+Release+complete+version+%28.0030+including+hotfixe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bozobub","files":3,"time":1394964066,"description":"This is a COMPLETE collection of the latest (and last) version of the Mechwarrior 4: Mercenaries Free Release from MekTek.  It includes:\n\n- All of the patches from .0028 (the last release of the full game) to .0030.\n- All of the hotfixes (only a &amp; c are necessary; b is deprecated but included for the sake of completeness).\n- The new version of the High Definition Patch that works with .0030.\n- Just about all extant MP/Instant Action map packs, including\n   + BKV pack.\n   + MWL packs 1-3.\n   + New Battlegrounds (nb/nbt) &quot;complete&quot; and league packs.\n   + SoE pack\n\n\nInstall procedure\n_________________\n\n\n1. TURN OFF ANY AV AND SET THE FOLDER MERCS WILL BE INSTALLED IN AS AN EXEPTION.  This is especially important for Norton, McAfee, and AVG.  Many AVs report several Mercs files as malware.  Don't worry, there'ye safe you can find out more in the archived section of MekTek's forum (http://www.mektek.net/forums) with a search for &quot;false positive&quot;.  This is due to encryption used by these files in the last patch, which MekTek was forced to use by M$ (the anti-cheat module also); MekTek stopped bothering to get the AV vendors to whitelist each patch, as it was a severe pain in the ass.  If you do not do this, there's a 90%+ chance your install will fail.  Check your quarantine if this happens.\n\n2. Open ONLY the 1st file you downloaded in 7Zip (it won't work properly in WinRAR or WinZIP, most likely) and extract to a convenient temporary location.  This was packaged for release to my friends, sorry about the archive.\n\n3. Rename the &quot;.mtx&quot; extension files to &quot;.rar&quot; (or &quot;.zip&quot;; it won't matter, this is just so your archive program opens them).  You can simply drag and drop each file onto your archive program, if you don't care to rename them.  I kept the original extensions so all files would be exactly as released.\n\n4. Open &quot;mechwarrior4mercenaries.all.to.51.03.01.0028.mtx&quot; in your favorite archive program.  Copy all the files within the &quot;Base&quot; folder (not the top-level &quot;Base&quot; folder itself) to the folder where you set the exception in your AV (you can safely ignore the &quot;Patch&quot; folder).  If you want to play online with GameRanger, it's a good idea to use a short path, such as &quot;C:Mercs&quot; or the like, as GameRanger has issues with the default path.\n\n5. Repeat step 4 for &quot;mechwarrior4mercenaries.51.03.01.0028.to.51.03.01.0029.mtx&quot; and then &quot;mechwarrior4mercenaries.51.03.01.0029.to.51.03.01.0030.mtx&quot;.  DO NOT do this in the wrong order!\n\n6. Apply the hotfixes in order from a to c.  It is not necessary to apply b, as it has been deprecated and rolled into c, but it won't hurt anything if you choose to anyway.  The hotfixes are especially important if you want to play the single-player campaign, or you will experience a game-stopping crash at Hesperus.\n\n7. (Optional) Install the map packs. These only apply to multiplayer and Instant Action games.  Order is unimportant, but you will need to redirect the installers to where you put Mercs; they won't autodetect the proper path.\n\n8. (Optional) Apply the High Definition Patch (HDP).  This increases texture size, as well as adding new sounds and weapon effects.  Gameplay is unchanged.  As I recall, there is a backup feature in the installer but it's not a bad idea to back up your entire Mercs folder beforehand, anyhow, just in case.  I personally prefer not to use the HDP, so YMMV.\n\n9. If using Vista or Windows 7, install the K-Lite codec pack OR add the command line switch &quot;/gosnovideo&quot; (disables the opening video) to the Target field in a shortcut you make for Mercs.  You will likely be forced to use this switch with Windows 8.  The opening video uses an ancient codec that is not included in Windows versions after XP and crashes the game if it's not present.\n\n10.  For all versions of Windows after XP, set &quot;Run this program as an administrator&quot; for &quot;MW4Mercs.exe&quot; and &quot;autoconfig_MERCS.exe&quot; under the Compatibility tab (under Properties when you right-click the files), especially if you installed to the default &quot;Program Files (x86)&quot; location.  THIS IS NECESSARY OR YOU WILL HAVE ENDLESS ISSUES!\n\n11. When you 1st run MW4Mercs.exe, it *should* automatically run &quot;autoconfig_MERCS.exe&quot; (if it doesn't, exit, run the autoconfig yourself, then try again).  *Very important note* EACH and EVERY time you run the autoconfig, you must (re)select your graphics card in the dropdown listbox on the upper right after clicking &quot;Advanced&quot;b (as well as any other desired settings), as the autoconfig often does not read the current state properly/populate the settings otherwise.  Additionally, if you have a multi-GPU setup, you generally will have to select the *last* GPU listed, although this can vary.  If one listed GPU doesn't work, try the next. Feel free, by the way, to max the settings under the &quot;Advanced&quot; button, as Mercs is not very GPU-intensive.  You should also select your default resolution here (Widescreen/HD displays *are* supported).\n\n\nImportant Notes\n_______________\n\n(In no particular order)\n\n- This release does not require the original CDs to play.\n\n- If you aren't comfortable disabling your AV during the install and making an exception for the install folder, DON'T BOTHER TO DOWNLOAD THIS GAME.  Check the MekTek forums (link above) for the reasons if you don't believe me, but there's nothing I can do about this. It IS safe, but false positives will stop you cold otherwise.  If you ignore this step, don't cry to me about your borked game.\n\n- If you use an Alienware PC, you will likely have to use the &quot;/gosnojoystick&quot; command line switch.  This is due to odd internal USB root hub handling by Alienware.  There IS a workaround for this at http://www.mektek.net/forums/topic/201129-alienware-m11x-startup-crash-fix-not-gosnovideo-or-gosnojoystick/?hl=alienware, if you want to use a joystick without using XPadder or the like, but it involves disabling the offending controller in Device Manager.  It also may not work for all Alienware PCs.\n\n- You can toggle Mercs between fullscreen and windowed mode with Alt-Enter.\n\n- This install includes the original M$ Clan and IS Mech Packs by default.  You do NOT have to install them separately (it wouldn't work anyway)!\n\n- If you decide to play online, you can play via direct IP or LAN, but most extant players use GameRanger.  Hit us up!  Be warned, however, that most of the players you'll find have been playing for 10+ years, so don't expect it to be easy at 1st; you'll be raped a good bit before you get your legs under you.  It's a good idea to play the single-player campaign all the way through 1st, although it still won't fully prepare you.  Bots ain't nothin' compared to humans...  Most of us are pretty friendly, though, and we'll be glad to help.\n\n- If you have any problems, feel free to ask here and/or on mektek.net, but DO NOT mention how you got the files openly on the forums; MekTek is under legal pressure from M$, and cannot tolerate further distribution of these files openly.  Just tell people you downloaded the files before they were removed.  You'll find me as an active member there, as well.  If you mention you found this on TPB when on mektek.net, you will NOT receive any help, be warned!  Additionally, I will pull this torrent off of TPB if this happens.\n\n- Once installed, you can simply copy your entire install to any other folder/PC and it'll work fine, AS LONG AS you run the autoconfig before trying to run the game (it'll crash otherwise; it won't autorun, either, as you're copying the info that says it ran already).  You can even have multiple copies installed at the same time with no issues.  This isn't a bad way to try out the HDP, as a matter of fact.\n\n- Joysticks generally work just fine with Mercs, but it ONLY uses the X (turn left/right), Y (torso up/down), RZ (&quot;Z Rotation&quot;, torso left/right) and Z (throttle).  Unfortunately, YOU CANNOT REDEFINE THESE AXES WITHIN MERCS, so you may very well have to externally redefine your axes (and/or analog buttons as digital) to use your joystick with Mercs.  If you use an XBox or XBox 360 controller (what I use) with your PC, XBCD will let you do this, unlike the default driver.  If you can't get your axes set up properly, the game works fine with mouse and keyboard, or even just keyboard, if you're a masochist ^^' .  You can find XBCD 2.7 at http://www.4-shared.eu/download/8aCWCNgQQWz9sRdfVfuhN5/XBCD-Installer-0-2-7.html, among other places.  Once installed, you need to change to the XBCD driver under Device Manager; ask below if you need more help on this.\n\nPfew!  I think that does it.  Hope this works for everyone!","torrent":{"xt":"urn:btih:c095124179241aa6f262102b2847ea8d257fbe3b","amp;dn":"MW4+Mercs+Free+Release+complete+version+%28.0030+including+hotfixe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c095124179241aa6f262102b2847ea8d257fbe3b","infoHashBuffer":{"type":"Buffer","data":[192,149,18,65,121,36,26,166,242,98,16,43,40,71,234,141,37,127,190,59]},"announce":[],"urlList":[]}}