{"title":"Playboy 2011 Februari Dutch","uid":6748008,"size":106419945,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c109b447255ed8ae15e2a84b4ace326910c18b43&amp;dn=Playboy+2011+Februari+Dutch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":null,"files":1,"time":1318776490,"description":"PLAYBOY JAARGANG 2011 MAAND : FEBRUARI\n\nPlayboy is een erotisch getint tijdschrift, vooral bedoeld voor heteroseksuele mannen, opgericht in 1953 door Hugh Hefner. Een playboy is iemand die zich beweegt in de jet-set, veel achter de vrouwen aanzit en meestal kortstondige verhoudingen heeft. De inhoud bestaat uit een aantal portretseries van blote vrouwen, met als klapstuk de \\\\\\\\\\\\\\'playmate van de maand\\\\\\\\\\\\\\', met daartussen ook interviews met bekende personen en politieke of culturele analyses. Het eerste nummer van het blad had Marilyn Monroe op de omslag (en op de middenpagina). Het bloot is altijd meer erotisch dan pornografisch geweest, \\\\\\\\\\\\\\'harde\\\\\\\\\\\\\\' seks (afbeeldingen van penetratie of fellatio) zal men in het blad niet vinden. De oplage is, wellicht door de gemakkelijke toegang tot seks en erotische afbeeldingen op het internet, sinds de hoogtijdagen sterk teruggelopen. In 1972 werden van een nummer meer dan 7 miljoen exemplaren verkocht. In 2005 was de oplage van de Amerikaanse uitgave nog 3 miljoen.\n \nDe Nederlandse en Belgische versies bestaan sinds mei 1983. De Nederlandse Playboy wordt uitgegeven door Sanoma Uitgevers. Voor het eerste Nederlandse nummer poseerde de destijds 36-jarige Jerney Kaagman naakt. Covergirl van dit nummer was Ellen Soeters. Er stond ook een interview met toenmalig Tweede Kamervoorzitter Dick Dolman in. Van het blad bestaat ook een \\\\\\\\\\\\\\'vrouwelijke\\\\\\\\\\\\\\' editie, namelijk Playgirl. Deze wordt niet in de Nederlandse taal uitgegeven.\n \nHet tijdschrift is ook onderwerp van wetenschappelijk onderzoek. In 2005 verscheen een artikel over de veranderingen in de lichaamsproporties van de centerfoldmodellen gedurende de laatste vijf decennia.[3] De conclusies wezen niet eenduidig op een trend naar grotere slankheid; wel werden er verschuivingen gevonden in de frequentie van vijf verschillende lichaamstypen.","torrent":{"xt":"urn:btih:c109b447255ed8ae15e2a84b4ace326910c18b43","amp;dn":"Playboy+2011+Februari+Dutch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c109b447255ed8ae15e2a84b4ace326910c18b43","infoHashBuffer":{"type":"Buffer","data":[193,9,180,71,37,94,216,174,21,226,168,75,74,206,50,105,16,193,139,67]},"announce":[],"urlList":[]}}