{"title":"Ally McBeal_ A Very Ally Christmas Featu","uid":6058090,"size":36868119,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c1fb34dc62d32c41df5ee7d4fe6397c62a0988dd&amp;dn=Ally+McBeal_+A+Very+Ally+Christmas+Featu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hellyzelnik","files":14,"time":1292992303,"description":"A Very Ally Christmas\n\nMP3 format 128kbps, 44100 sample rate, stereo\n\nAll files tagged and ready for iTunes\n\nENJOY!!!!\n\n\n1. This Christmas\n2. The Man With The Bag\n3. Please Come Home For Christmas\n4. Silver Bells\n5. Let It Snow, Let It Snow, Let It Snow\n6. Winter Wonderland - Macy Gray\n7. Run, Rudolph, Run - Jane Krakowski\n8. Santa Claus Got Stuck In My Chimney - Lisa Nicole Carson\n9. I Saw Mommy Kissing Santa Claus - Jane Krakowski\n10. Santa Baby - Calista Flockhart\n11. Have Yourself A Merry Little Christmas\n12. River - Robert Downey, Jr\n13. White Christmas - Robert Downey, Jr/Vonda Shepard\n14. What Are You Doing New Year's Eve\n\n\nOn the third installment of television series Ally McBeal soundtracks, Vonda Shepard and guests -- Macy Gray and cast members Calista Flockhart, Lisa Nicole Carson, Jane Krakowski, and Robert Downey, Jr. -- toast the Yuletide season with Ally McBeal: A Very Ally Christmas Featuring Vonda Shepard. R&amp;B, jazz, swing, and blues treatments are added to such holiday favorites as &quot;This Christmas,&quot; &quot;The Man With the Bag,&quot; and &quot;Silver Bells.&quot; But what shines through loud and clear on the set is Shepard's luscious voice. It doesn't really matter what the ingenue wraps her rich vocals around; Shepard has the ability to add a wistful sense to even the happiest songs. This is in evidence on the usually upbeat &quot;Let It Snow, Let It Snow, Let It Snow&quot; and &quot;Have Yourself a Merry Little Christmas.&quot; Shepard, backed by affecting strings and warm piano, sings both numbers with such emotion that even the most stoic person can't help but to be moved. The blues-flavored &quot;Please Come Home for Christmas,&quot; with its soulful piano and longing vocals sung by Shepard, imagines a lonely man or woman listening to the song in the confines of an office or bedroom, much like the characters do on the popular television series. Cast member Jane Krakowski, who also takes singing turns on the show, serves up a rollicking-good rendition of &quot;Run, Rudolph, Run&quot;; this siren has an album in her just aching to be recorded. And %Flockhart, backed by a sultry tenor saxophone, more than holds her own on a cutesy &quot;Santa Baby.&quot; A real surprise turn on the set, however, comes by way of Ally actor Robert Downey Jr. who performs the Joni Mitchell classic &quot;River.&quot; His voice resembles a less-raspy Joe Cocker, and has much substance and dynamic range as he masterfully hits the song's falsetto notes, falling into a whisper. The somber cello line that swims behind Downey's vocals caps off what is one of the album's most choice moments. A Very Ally Christmas Featuring Vonda Shepard offers a collection of holiday songs that are as warm as a fireplace on a cold winter's night. This set is sure to be a favorite at Holiday Office Party U.S.A. or right at home in living rooms with family and friends","torrent":{"xt":"urn:btih:c1fb34dc62d32c41df5ee7d4fe6397c62a0988dd","amp;dn":"Ally+McBeal_+A+Very+Ally+Christmas+Featu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1fb34dc62d32c41df5ee7d4fe6397c62a0988dd","infoHashBuffer":{"type":"Buffer","data":[193,251,52,220,98,211,44,65,223,94,231,212,254,99,151,198,42,9,136,221]},"announce":[],"urlList":[]}}