{"title":"American_Top_40_1981_June_13th","uid":10378086,"size":485993430,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c44c481cf3ece0f73c002ed0c7636dc540f00c76&amp;dn=American_Top_40_1981_June_13th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1403031186,"description":"&quot;Every week we count down the most popular songs in the nation from American Falls, Idaho, to American Fork, Utah; from Americus, Georgia, to American River, California. And now, at number eight on American Top 40, here is 'America' by Neil Diamond.&quot;\n\n\nAs I share this file, it is with a sad spirit that I report the passing of Casey Kasem (April 27, 1932 - June 15, 2014). He wasn't just another disc jockey or famous voice, he was an &quot;on the seen&quot; historian. For a few hours each week and for nineteen years he chronicled the musical evolution of America. He gave us a detailed &quot;play by play&quot; of our favorite artists, bands, producers, and record labels.\n\nFor a few hours each weekend, he was a traveling companion to those on the road, company for those who found themselves alone, and a comfort for those stationed overseas but longing for home. He played our long-distance dedications, answered our questions concerning chart records and oddities, and remembered all the number one songs of the 60's and 70's. He reminded us of our roots, and made each new song seem special in its own right.\n\nIf there's a rock 'n' roll heaven where everybody's got a song to sing and everyone's a star, they just welcomed a legend who can tell them how those songs are doing on the heavenly music scene.\n\nNow, as Casey would say, &quot;on with the countdown.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown there is a trio of country firsts. Rosanne Cash has her first top 40 hit with &quot;Seven Year Ache&quot; (at number 36), Dottie West has her first big hit on the pop chart, &quot;What Are We Doin' In Love&quot; (at number 51 with Kenny Rogers), and there is the first top 40 hit for a country band that took its name from the first US town to build a nuclear power plant.\n\n&quot;I Don't Need You&quot; by Kenny Rogers debuts in the hot 100 all the way up in the number 33 spot, and the highest debut of the week in the Top 40 is &quot;Hearts&quot; (at number 24) by Marty Balin.\n\nThere is another installment of &quot;I didn't know he ever hit the chart!&quot; Casey plays a bit of &quot;Stand By Me&quot; as recorded by Cassius Marcellus Clay, later known as Muhammad Ali.\t \n\n&quot;Watching The Wheels&quot; by the recently departed John Lennon is at number 25. As a RocketMan Extra, I have included the acoustic demo just in case you've never heard it.\n\nA listener wants to know how many songs in chart history have had the double distinction of hitting #1 on the pop chart and winning the Academy Award for best song. Casey reports the number as twelve, but says only one failed to make the chart after its release, later received an Oscar, and then made it to number one.\n\nLW#1: Bette Davis Eyes - Kim Carnes\n40:    Stronger Than Before - Carole Bayer Sager\n39:    I Can Take Care Of Myself - Billy Vera &amp; The Beaters\n38:    Sweet Baby - Stanley Clarke &amp; George Duke        \n37:    Gemini Dream - The Moody Blues     \n36:    Seven Year Ache - Rosanne Cash     \n35:    Time - The Alan Parsons Project    \n34:    Boy From New York City - Manhatten Project\n33:    I Don't Need You - Kenny Rogers\n32:    Say What - Jesse Winchester\n31:    Fool In Love With You - Jim Photoglo\nARCHIVES: Soul &amp; Inspiration - The Righteous Brothers\n30:    Still Right Here In My Heart - Pure Prairie League\n29:    Modern Girl - Sheena Easton    \n28:    Elvira - The Oak Ridge Boys\n27:    Theme from &quot;Greatest American Hero&quot; - Joey Scarbury\n26:    Winning - Santana\n25:    Watching The Wheels - John Lennon\nLDD: Just Remember I Love You - Firefall\n24:    Hearts - Marty Balin\n23:    Nobody Wins - Elton John\n22:    Angel Of The Morning - Juice Newton\n21:    Is It You - Lee Ritenour\nARCHIVES: Good Lovin' - The Young Rascals\n20:    Jessie's Girl - Rick Springfield\n19:    The Waiting - Tom Petty &amp; The Heartbreakers\n18:    Too Much Time On My Hands - Styx\n17:    You Make My Dreams - Daryl Hall &amp; John Oates\n16:    How 'Bout Us - Champaign\n15:    What Are We Doin' In Love - Dottie West\n14:    The One That You Love - Air Supply\n13:    I Love You - The Climax Blues Band\n12:    This Little Girl - Gary U.S. Bonds\n11:    Just The Two Of Us - Grover Washington Jr. &amp; Bill Withers\n10:    Sweetheart - Frankie &amp; The Knockouts\nARCHIVES: Monday Monday - The Mamas &amp; The Papas\n9:    Take It On The Run - REO Speedwagon\n8:    America - Neil Diamond\nLDD: Hey Jude - The Beatles\n7:    All Those Years Ago - George Harrison\n6:    Living Inside Myself - Gino Vanelli\n5:    A Woman Needs Love - Ray Parker Jr &amp; Raydio\n4:    Being With You - Smokey Robinson\n3:    Sukiyaki - A Taste Of Honey\n2:    Medley - Stars On 45\n1:    Bette Davis Eyes - Kim Carnes","torrent":{"xt":"urn:btih:c44c481cf3ece0f73c002ed0c7636dc540f00c76","amp;dn":"American_Top_40_1981_June_13th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44c481cf3ece0f73c002ed0c7636dc540f00c76","infoHashBuffer":{"type":"Buffer","data":[196,76,72,28,243,236,224,247,60,0,46,208,199,99,109,197,64,240,12,118]},"announce":[],"urlList":[]}}