{"title":"Project IGI : I'm Going In [Cider Port]","uid":7341159,"size":109142234,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:c47afaac46e81b7b0c3c238b32e7273105cf0df9&amp;dn=Project+IGI+%3A+I%27m+Going+In+%5BCider+Port%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iAPC","files":-1,"time":1339203227,"description":"Intro:\n-----\nProject IGI is a strictly single-player game with 14 missions that are often large and complex, but they're divided into smaller, more manageable objectives. Unfortunately, there's no way to save your game during a mission, and even on the lowest difficulty setting, some missions can be quite hard, and they will inevitably require you to restart from scratch a number of times before you achieve success. Since you'll typically be infiltrating military installations, you'll run into swarms of guards, many of whom stand waiting in towers with their sniper rifles. Death awaits at every corner. The abundance of guards is necessary because the game's enemy artificial intelligence is spotty if not downright poor, as enemies sometimes stand obliviously when you kill one of their comrades, who is only a few feet in front of them. Also, the game sometimes cheats by making guards appear out of thin air or from buildings that you've already cleared.\n\nInstructions:\n------------\n1) Download torrent.\n2) Extract the downloaded file using Stuff Expander (StuffIt Delux) or a 7z extractor of your choice.\n3) Double click the extracted IGI.app and enjoy!!\n\nKnown issues:\n------------\n- No known issues concerning the game performance. Everything must work fine.\n- I apologize for not being able to change the screen resolution and for not being able to run the game in fullscreen. If someone can help me with that I'll be glad.\n\nMY BANDWIDTH IS VERY CRAPY. I CAN'T SEED FOR 10 AT TIME, PLEASE CONSIDER SEEDING THIS TORRENT TO KEEP IT UP. MASS SEEDERS PLEASE HELP! REPEAT, MASS SEEDERS HELP. DOWNLOAD AND SEED IF YOU LIKE THIS GAME AND IF YOU'RE USING A MAC.\nI'M NOT GOING TO SEED IT FOREVER AS LONG AS MY BANDWIDTH IS STRONGLY WEEK.\n\nMisc:\n----\n- To extract the 7z you can find StuffIt Delux here: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/7047946/StuffIt_Deluxe_v._15.0.4_(2011)_with_Core_Keygen&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/7047946/StuffIt_Deluxe_v._15.0.4_(2011)_with_Core_Keygen&lt;/a&gt;\n- Other utilities can be found here: &lt;a href=&quot;\nhttp://www.7-zip.org/download.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.7-zip.org/download.html&lt;/a&gt;\n\n- Compatible with Leopard and Snow Leopard and most obviously not compatible with Lion.\n\n- This is my first torrent so hope you like it! Please comment if you have anything concerning this torrent.","torrent":{"xt":"urn:btih:c47afaac46e81b7b0c3c238b32e7273105cf0df9","amp;dn":"Project+IGI+%3A+I%27m+Going+In+%5BCider+Port%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c47afaac46e81b7b0c3c238b32e7273105cf0df9","infoHashBuffer":{"type":"Buffer","data":[196,122,250,172,70,232,27,123,12,60,35,139,50,231,39,49,5,207,13,249]},"announce":[],"urlList":[]}}