{"title":"Meridian","uid":6667878,"size":489786254,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:c5092a906d5aeaf06d09353aaf7bc0274c5e2249&amp;dn=Meridian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jakcreed","files":44,"time":1315761422,"description":"Meridian complete from Crossgen.  This is actually the series that got me into Crossgen. I read a good portion of the series when it first came out. The series itself is hard to explain so I will let wikipedia do it for me:\nMeridian, the series' namesake, is one of many island city-states upon the world of Demetria. At some point in the world's history, a great natural cataclysm threw massive chunks of earth into the sky, creating the current system of floating islands. The islands, as well as the airships crucial to trade and transport, defy gravity due to the mysterious properties of a certain 'ore' which is not named. Each island is headed by a Minister, who has more or less monarchic power over their respective island, and while many communities still survive on the surface, contact and trade between the surface and the islands is rare.\n\nThe main character of the series is Sephie, the daughter of Turos, the Minister of Meridian. Her father dies at the beginning of the series, and Sephie becomes Minister of Meridian, acquiring at the same time a mysterious Sigil, a mark upon her forehead, which grants her an array of powers. Gradually, she learns to use it to allow her to fly, to heal others, to repair things, and in a handful of other ways. However, her uncle Ilahn, Minister of Cadador, another of the floating island city-states, has a Sigil as well, which allows him to destroy things and teleport. He attempts to use his powers, and his significant political influence, to seize Meridian from Sephie's control, and to create an economic and industrial empire, demanding tribute from other islands, if not conquering them outright.","torrent":{"xt":"urn:btih:c5092a906d5aeaf06d09353aaf7bc0274c5e2249","amp;dn":"Meridian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5092a906d5aeaf06d09353aaf7bc0274c5e2249","infoHashBuffer":{"type":"Buffer","data":[197,9,42,144,109,90,234,240,109,9,53,58,175,123,192,39,76,94,34,73]},"announce":[],"urlList":[]}}