{"title":"Dean Koontz - 1988 Lightning (by tucky man)","uid":4631146,"size":559967250,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c5d9db3d0d032f915e1c43f6ed0d3cc876660c99&amp;dn=Dean+Koontz+-+1988+Lightning+%28by+tucky+man%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"m26us","files":-1,"time":1231392906,"description":"Laura Shane leads a troubled life: she is orphaned, nearly molested twice and loses one of her closest friends in a tragic accident, all before her 13th birthday. Even worse events would have befallen Laura if not for the mysterious guardian angel who periodically appears with a bolt of lightning to miraculously rescue her. The &quot;angel,&quot; Stefan, is in fact a time traveler who rides the &quot;lightning road&quot; through time to follow Laura throughout her adult life; unfortunately, Stefan himself is being chased through time by a pack of equally mysterious villains, and their pursuit of Stefan and Laura spans the second half of the novel. The secret of the lightning road provides an intriguing mystery early on, but once it is revealed midway through the book as a complicated hybrid of borrowed science-fiction and political-thriller conceits, the narrative runs out of ideas. In the lightning road, Koontz has created the kind of sci-fi puzzle whose convoluted logic must be explained at every turn, and the momentum of the central, fairly standard chase suffers thereby. The drama of an innocent bystander forced by events to run for his or her life is familiar to Koontz readers, but this time he leaves out a vital ingredient; while his evil predators are often his most interesting characters (as in this year's Watchers, or the earlier Whispers), the villains of Lightning tend toward cliches. The reader senses that the author got too caught up in the trick of the lightning, and inadvertently stole the thunder from the rest of this potentially intriguing tale.","torrent":{"xt":"urn:btih:c5d9db3d0d032f915e1c43f6ed0d3cc876660c99","amp;dn":"Dean+Koontz+-+1988+Lightning+%28by+tucky+man%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5d9db3d0d032f915e1c43f6ed0d3cc876660c99","infoHashBuffer":{"type":"Buffer","data":[197,217,219,61,13,3,47,145,94,28,67,246,237,13,60,200,118,102,12,153]},"announce":[],"urlList":[]}}