{"title":"Frank Zappa - Guitar Disc 2 (1988) [FLAC]","uid":4640102,"size":446034927,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c60fb3e4c0ee5e62a22fbe5cd3ca28bc8d96fdf5&amp;dn=Frank+Zappa+-+Guitar+Disc+2+%281988%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"storoa","files":18,"time":1231688584,"description":"Review\tby Lindsay Planer\n\nReleased in 1988, Guitar may be the most important and ironically one of the least-known entries in Frank Zappa's voluminous discography -- which spans over seven-dozen LPs as of this writing. His proficiencies as a composer and instrumentalist have long been lauded. However, anthologies of this nature provide an outlet for the remarkable breadth and depth of Zappa's manual dexterity and improvisational scope, which can now be enjoyed on a myriad of levels. The casual enthusiast can revel in the seemingly endless personas and sounds summoned from the soloist and band alike. Devotees of the artist and/or instrument are presented with example upon example of Zappa's ability to create masterworks on the fly and often in the context of larger pieces. For example, &quot;Which One Is It?&quot; is an extraction from &quot;The Black Page&quot; in Munich, Germany, on June 26, 1982. Compare it to the likes of &quot;Move It or Park It,&quot; which was likewise lifted from &quot;The Black Page&quot; two weeks earlier in Frankfurt, Germany, on June 11, 1982. Caveat emptor to those following the liner notes, as they are wrought with inaccurate dates. Interestingly, whenGuitar was prepped for CD, several of the mixes were altered. So, the original two-LP set -- despite containing 13 fewer cuts -- is preferred by some. That minutia aside, simply listening to Zappa as a primary player is always a treat for inclined parties and there are a few exceptional selections scattered throughout. &quot;For Duane&quot; -- a nod to fellow stringman Duane Allman -- is made all the more poignant for having been played before a (kinda) hometown crowd in Atlanta, GA, November 25, 1984. Other standouts include a pair of Joe's Garage-related cuts: &quot;Outside Now&quot; -- dating back to March of 1979 -- and the emotional immediacy infused into &quot;Watermelon in Easter Hay,&quot; the latter taken from a Jones Beach show on August 16, 1984. On the whole, Guitar joins the Shut Up 'N Play Yer Guitar trilogy as a key component in unraveling the endless enigma of Frank Zappa as a major fretmeister.\t","torrent":{"xt":"urn:btih:c60fb3e4c0ee5e62a22fbe5cd3ca28bc8d96fdf5","amp;dn":"Frank+Zappa+-+Guitar+Disc+2+%281988%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c60fb3e4c0ee5e62a22fbe5cd3ca28bc8d96fdf5","infoHashBuffer":{"type":"Buffer","data":[198,15,179,228,192,238,94,98,162,47,190,92,211,202,40,188,141,150,253,245]},"announce":[],"urlList":[]}}