{"title":"Liza Minnelli Live From Radio City Music Hall","uid":6987111,"size":1234579502,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c6974af81a943887c78a4dc0c790852162b99fa3&amp;dn=Liza+Minnelli+Live+From+Radio+City+Music+Hall&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"johnefp","files":-1,"time":1327604045,"description":"Liza May Minnelli (born March 12, 1946) is an American actress and singer. She is the daughter of singer and actress Judy Garland and film director Vincente Minnelli.\n\nAlready established as a nightclub singer and musical theatre actress, she first attracted critical acclaim for her dramatic performances in the movies The Sterile Cuckoo (1969), and Tell Me That You Love Me, Junie Moon (1970); Minnelli then rose to international stardom for her appearance as Sally Bowles in the 1972 film version of the Broadway musical Cabaret, for which she won the Academy Award for Best Actress. She later made a great star turn in, Arthur (1981), co-starring with Dudley Moore (in the title role), and the great Sir John Gielgud, who won the Academy Award for Best Supporting Actor as Arthur's snobbish but loveable butler.\n\nWhile film projects such as Lucky Lady, A Matter of Time and New York, New York were less favorably received than her stage roles, Minnelli became one of the most versatile, highly regarded and best-selling entertainers in television, beginning with Liza with a Z in 1972, and on stage in the Broadway productions of Flora the Red Menace, The Act and The Rink. Minnelli also toured internationally and did shows such as Liza Minnelli: At Carnegie Hall, Frank, Liza &amp; Sammy: The Ultimate Event, and Liza Live from Radio City Music Hall.\n\nShe starred in Liza's Back in 2002. She had guest appearances in the sitcom Arrested Development and had a small role in the movie The OH in Ohio, while continuing to tour internationally. In 2008/09, she performed the Broadway show Liza's at The Palace...! which earned a Tony Award for Best Special Theatrical Event.[1]\n\nMinnelli has won a total of three Tony Awards awards, including a Special Tony Award.[2] She has also won an Oscar, an Emmy Award, two Golden Globes and a Grammy Legend Award for her contributions and influence in the recording field, along with many other honors and awards. She is one of the few entertainers who have won an Oscar, Emmy, Grammy, and Tony Award.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0296724/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0296724/&lt;/a&gt;","torrent":{"xt":"urn:btih:c6974af81a943887c78a4dc0c790852162b99fa3","amp;dn":"Liza+Minnelli+Live+From+Radio+City+Music+Hall","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6974af81a943887c78a4dc0c790852162b99fa3","infoHashBuffer":{"type":"Buffer","data":[198,151,74,248,26,148,56,135,199,138,77,192,199,144,133,33,98,185,159,163]},"announce":[],"urlList":[]}}