{"title":"Star Wars Galactic Battlegrounds Clone Campaigns Portable - [Esp","uid":6391911,"size":299001663,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c85b669eaf997ecddcd8734db9dcd39a3f083f94&amp;dn=Star+Wars+Galactic+Battlegrounds+Clone+Campaigns+Portable+-+%5BEsp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"missSparky914","files":2,"time":1305380139,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;Star Wars Galactic Battlegrounds Clone Campaigns 1 Click.exe&quot;\n3.Enjoy.\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\nStar Wars: Galactic Battlegrounds is a real-time strategy computer game set in the Star Wars universe.\n\nPlayers have a choice of factions and campaigns. The factions in the original game include the Wookiees, Royal Naboo, the Trade Federation, the Empire, the Rebels, and the Gungans. There are two campaigns in the game centered on the Wookiee race, and one campaign each for the Gungans, the Trade Federation, the Galactic Empire, and the Rebel Alliance. An expansion pack, Clone Campaigns, was released in 2002, adding two new factions and campaigns. Later that year, both Galactic Battlegrounds and Clone Campaigns were released in a box set, Star Wars: Galactic Battlegrounds Saga. No sequels have been made, although other Star Wars themed RTSes have been made such as Star Wars: Empire at War.\n\nThe games were built on the Genie engine, the same one used in Age of Empires, and Age of Empires II. Online play is mainly played through GameRanger, maintaining a small base of users. Mainstream online play was considerably damaged after Zone.com, the main site for online play, closed down all CD-ROM games on June 19, 2006 due to financial problems. Microsoft has suggested that the game be played now on GameSpy or GameRanger.[1]\n\nThe game features the voices of Tom Kane and Charles Martinet; Jake Lloyd reprised the role of Anakin Skywalker.\n\nMINIMUM PC REQUIREMENTS\n\nWindows 95/98/ME/2000/XP\nPentium II or Athlon 233MHz\n32MB RAM\n2MB PCI or AGP Graphics Card\nDirectX-compatible 16-bit Sound Card\n4X CD-ROM Drive\nKeyboard\nMouse\nDirectX 8.0a\nInstallation of Star Wars: Galactic Battlegrounds\nRECOMMENDED\n64MB RAM\n4MB Graphics Card\n\n","torrent":{"xt":"urn:btih:c85b669eaf997ecddcd8734db9dcd39a3f083f94","amp;dn":"Star+Wars+Galactic+Battlegrounds+Clone+Campaigns+Portable+-+%5BEsp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c85b669eaf997ecddcd8734db9dcd39a3f083f94","infoHashBuffer":{"type":"Buffer","data":[200,91,102,158,175,153,126,205,220,216,115,77,185,220,211,154,63,8,63,148]},"announce":[],"urlList":[]}}