{"title":"Around the World in 80 Dinners (mAnaV)","uid":4777320,"size":4713354,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8a059722c7b1b3e20c3a845991c94772a1641e5&amp;dn=Around+the+World+in+80+Dinners+%28mAnaV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"msbisht","files":-1,"time":1237255772,"description":"Around the World in 80 Dinners by Bill Jamison, Cheryl Alters Jamison \n\nAfter years of painstaking planning, veteran cookbook authors Cheryl and Bill Jamison (Smoke &amp; Spice, American Home Cooking, The Big Book of Outdoor Cooking and Entertaining) used all their frequent flier miles on a three-month global culinary tour, chronicled in this charming travelogue. Beginning in Bali, the couple traveled to 10 different countries during the fall of 2005, sampling the local cuisine and taking in the sights. Narrating as &quot;we,&quot; the Jamisons bring readers along as they dig into succulent jumbo crab at a hole in the wall in Singapore, dine on a luxurious wood and rattan houseboat in India and tour wineries in Australia; unfortunately, the spell is occasionally broken by awkward lapses into third person. That aside, the Jamisons make for informative and inquisitive travel guides, seeking out lesser-known establishments that capture the feel of each country. Though they occasionally splurge on an upscale meal, the majority of their dining experiences are well within the budgets of most travelers. Those interested in replicating legs of their journey will find the book a welcome resource, including information on lodging, dining destinations and not-to-be-missed cultural experiences (like the Carmen Miranda Museum in Brazil). For the sedentary, the Jamisons have thoughtfully included a native recipe from each stop.\n\n\nPlz Seed...\n\nThnXX...\n\nmAnaV...\n\n\n","torrent":{"xt":"urn:btih:c8a059722c7b1b3e20c3a845991c94772a1641e5","amp;dn":"Around+the+World+in+80+Dinners+%28mAnaV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8a059722c7b1b3e20c3a845991c94772a1641e5","infoHashBuffer":{"type":"Buffer","data":[200,160,89,114,44,123,27,62,32,195,168,69,153,28,148,119,42,22,65,229]},"announce":[],"urlList":[]}}