{"title":"Fascism: Past, Present, Future","uid":11715941,"size":13432180,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8eb5fbde0c13e165e32d67f0dc72f06c9d998fc&amp;dn=Fascism%3A+Past%2C+Present%2C+Future&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1424583319,"description":"Mussolini's march on Rome; Hitler's speeches before waves of goose-stepping storm troopers; the horrors of the Holocaust; burning crosses and neo-Nazi skinhead hooligans. Few words are as evocative, and even fewer ideologies as pernicious, as fascism. And yet, the world continues to witness the success of political parties in countries such as Italy, France, Austria, Russia, and elsewhere resembling in various ways historical fascism. Why, despite its past, are people still attracted to fascism? Will it ever again be a major political force in the world? Where in the world is it most likely to erupt next? In Fascism: Past, Present, and Future, renowned historian Walter Laqueur illuminates the fascist phenomenon, from the emergence of Hitler and Mussolini, to Vladimir Zhirinovsky and his cohorts, to fascism's not so distant future. Laqueur describes how fascism's early achievements-the rise of Germany and Italy as leading powers in Europe, a reputation for being concerned about the fate of common people, the creation of more leisure for workers-won many converts. But what successes early fascist parties can claim, Laqueur points out, are certainly overwhelmed by its disasters: Hitler may have built the Autobahnen, but he also launched the war that destroyed them. Nevertheless, despite the Axis defeat, fascism was not forgotten: Laqueur tellingly uncovers contemporary adaptations of fascist tactics and strategies in the French ultra-nationalist Le Pen, the rise of skinheads and right-wing extremism, and Holocaust denial. He shows how single issues-such as immigrants and, more remarkably, the environment-have proven fruitful rallying points for neo-fascist protest movements. But he also reveals that European fascism has failed to attract broad and sustained support","torrent":{"xt":"urn:btih:c8eb5fbde0c13e165e32d67f0dc72f06c9d998fc","amp;dn":"Fascism%3A+Past%2C+Present%2C+Future","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8eb5fbde0c13e165e32d67f0dc72f06c9d998fc","infoHashBuffer":{"type":"Buffer","data":[200,235,95,189,224,193,62,22,94,50,214,127,13,199,47,6,201,217,152,252]},"announce":[],"urlList":[]}}