{"title":"Bionic Commando [dvd-dl - multi9 [Tntvillage.]","uid":5294697,"size":7522743251,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c8fe7b3bf6d44685636589de970e5aaef215678b&amp;dn=Bionic+Commando+%5Bdvd-dl+-+multi9+%5BTntvillage.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"maxmalu6601","files":2,"time":1264016495,"description":"BIONIC COMMANDO\n\n1DVD-DL - genere azione/avventure - Multi9 (Italiano compreso)\n\n.::.Recensione.::.\nIl 2009 sembra essere un anno particolarmente florido per Capcom che non si risparmia nel riproporre sul mercato i suoi maggiori IP, e visto il grande successo di titoli come Street Fighter e Resident Evil ÃƒÂ¨ evidente che questa politica stia portando ottimi risultati per la casa nipponica. Anche stavolta a godere di un nuovo episodio ÃƒÂ¨ un brand che rappresenta una vera e propria perla del passato, quel Bionic Commando che di recente si ÃƒÂ¨ giÃƒÂ  fatto vedere sulle nostre console grazie ad un remake dell'originale e indimenticabile capitolo disponibile sulle piattaforme di digital delivery di Microsoft e Sony.\nIl titolo in questione perÃƒÂ² rappresenta a tutti gli effetti un nuovo capitolo che ci trasporta alcuni anni dopo gli eventi del gioco originale in un futuro dove i soldati bionici sono diventati uno scomodo retaggio del passato, ed in virtÃƒÂ¹ di questo il governo ÃƒÂ¨ intenzionato a liberarsene per sempre. I risultati di questa politica, oltre a creare diversi scontri tra i sostenitori e i detrattori dei bionici, portano alla fuga di molti supersoldati che scampano in questo modo alla cosiddetta &quot;epurazione&quot;.\nLe ragioni di tanta intolleranza vanno ricercate nella diffusa inabilitÃƒÂ  mentale e alla crescente aggressivitÃƒÂ  che presentano i soldati equipaggiati di protesi bioniche, ragioni che hanno spinto le alte sfere ad abbandonare il progetto portando all'arresto e in casi estremi all'eliminazione dei biotici rimasti in patria, come accade nel caso del protagonista del gioco che, privato del suo arto meccanico, viene rinchiuso in cella con false accuse solo per aver eseguito gli ordini a lui impartiti. Le sorti del nostro eroe perÃƒÂ² sono destinate a cambiare nel momento in cui un gruppo terroristico distrugge con un attacco nucleare una cittÃƒÂ  e ne occupa il suolo devastato, da questo istante i servigi e le abilitÃƒÂ  del soldato tornano a essere utili ed ÃƒÂ¨ da qui che iniziano le avventure del gioco.\n\nDegrado urbano\nBuona parte del gioco si svolge proprio tra le macerie della cittadina devastata e occupata dalla sola presenza delle forze terroriste, ma ci sono anche varie escursioni in ambienti extraurbani, sempre molto convincenti nella realizzazione. Questi si rivelano un ottimo teatro dove dar sfogo alle peculiari abilitÃƒÂ  offerte dal braccio bionico del protagonista che, quasi come fosse un primate, puÃƒÂ² sfruttare ogni sporgenza e appiglio per raggiungere ogni luogo dell'area esplorabile, dalle cime dei decadenti grattacieli fino a delle gole profonde che si snodano nel sottosuolo. A fronte di una cosÃƒÂ¬ ampia libertÃƒÂ  di movimento non fa da contraltare un'altrettanto generosa ampiezza delle aree che, sebbene l'orizzonte ci proponga un'intera cittÃƒÂ  ammirabile, si limitano a una concatenazione continua di macrostanze delimitate da ostacoli insormontabili o da banchi di radiazioni mortali e unite da dei caricamenti piuttosto invasivi visto anche l'ampio numero di volte in cui dobbiamo cambiare zona nel corso del gioco.\nNon c'ÃƒÂ¨ alcuna componente freeroaming quindi, cosa che lascia un po' d'amaro in bocca viste che le ambientazioni proposte parrebbero prestarsi splendidamente ad un approccio simile. Se mettiamo da parte perÃƒÂ² questo aspetto, ÃƒÂ¨ perÃƒÂ² indubbio come la realizzazione di tutti gli ambienti sia stata curata abilmente dai designer Capcom che hanno realizzato un'infrastruttura che si presta ottimamente alle numerose soluzioni di gameplay che un gioco dinamico come Bionic Commando propone.\n\nRampino o pistola?\nIl vero protagonista di Bionic Commando ÃƒÂ¨ senza dubbio il braccio bionico e il suo relativo e famosissimo rampino che offre al giocatore una vasta gamma di mosse utili sia nell'esplorazione sia in situazioni piÃƒÂ¹ concitate, rivelandosi una altrettanto efficace arma offensiva grazie al ricorso di varie mosse speciali sbloccabili nel corso del gioco. Grazie all'uso di questo versatile arto, siamo in grado di scalare ogni tipo di superficie, dondolarci come dei moderni Tarzan ad ogni sporgenza e salvarci da un salto andato male, il tutto con l'utilizzo di un solo tasto, che gestisce il rampino in modo intuitivo e funzionale. Grazie a questo si vanno ad affrontare anche delle sessioni spiccatamente platform che offrono un piacevole diversivo ai combattimenti oltre a presentare un discreto livello di sfida. L'altra faccia del gameplay di Bionic Commando risiede negli scontri con i nemici, anche quest'ultimi posso essere affrontati sia sfruttando il rampino, ad esempio per afferrare i nemici o per scagliagli contro oggetti e parti di scenario, sia mediate l'utilizzo di armi da fuoco, ottenibili tramite il supporto della base operativa che saltuariamente ci offre nuovi strumenti di morte da poter usare contro le forze d'occupazione. Di questi due modi diversi di affrontare gli scontri, quello che ci ha convinto di meno ÃƒÂ¨ senza dubbio quello piÃƒÂ¹ marcatamente shooter: affidarsi all'uso di armi da fuoco non offre la stessa soddisfazione di usare l'arto bionico e le sue mosse, per quanto sia spesso necessario ricorrere ad armi convenzionali.\nIl feeling con le armi ÃƒÂ¨ approssimativo e non ha la stessa profonditÃƒÂ  riscontrata su altri titoli piÃƒÂ¹ tradizionali, le sparatorie si rivelano monotone quando affrontate contro la fanteria nemica, che non vanta una IA molto sviluppata oltre ad offrire una sfida impegnativa solo quando i nemici si presentano in gruppi numerosi. Molto diversa ÃƒÂ¨ la situazione quando abbiamo di fronte a noi vari tipi di mech, queste macchine vanno affrontate ricorrendo a un approccio piÃƒÂ¹ ragionato in base ai punti deboli dell'avversario, cosÃƒÂ¬ che lo scontro assume una profonditÃƒÂ  e un livello di sfida molto piÃƒÂ¹ alto. La stessa profonditÃƒÂ  si ritrova amplificata negli scontri con i boss che risultano senza dubbio la parte piÃƒÂ¹ riuscita del pacchetto.\n\nBionic Commando presenta una struttura particolare per quanto riguarda gli obiettivi che ricorda in parte quella presentata dall'Orange Box di Valve. Infatti gli obiettivi di Bionic Commando sono molto numerosi e, di conseguenza, poco remunerativi. La maggior parte dei punti sbloccabili fanno riferimento alle numerose sfide che man mano si rendono disponibili nel gioco, perlo piÃƒÂ¹ relative all'uso delle armi e del rampino.\nTecnica biotica\n\nBionic Commando vanta, come giÃƒÂ  detto, un level design di tutto rispetto, unito a una realizzazione tecnica piÃƒÂ¹ che soddisfacente soprattutto per quanto riguarda la modellazione del protagonista e degli ambienti, quest'ultimi accarezzati da un ottimo sistema d'illuminazione dinamica. Capita di trovarsi di fronte ad alcune texture sottotono, in particolare negli ambienti interni, ma l'impatto complessivo regala degli scorci paesaggistici godibili soprattutto considerato l'ampio orizzonte visivo delle aree. Piuttosto dozzinale ÃƒÂ¨ invece la modellazione dei nemici, anche qui maggior cura ÃƒÂ¨ stata riposta nei mech che vantano un dettaglio e una ricerca che si avvicina di piÃƒÂ¹ agli standard odierni. Menzione speciale per la colonna sonora composta per la maggior parte da pezzi rearrangiati provenienti dal primo Bionic Commando, per la gioia dei giocatori di vecchia data che hanno giÃƒÂ  apprezzato a suo tempo certe indimenticabili sonoritÃƒÂ . Ma Capcom ha pensato ai nostalgici nel corso di tutto lo sviluppo del gioco, infarcendolo di numerose citazioni che richiamano in piÃƒÂ¹ di un'occasione il gioco originale, oltre che offrendo numerosi riferimenti, sotto forma di documenti da raccogliere, agli eventi che uniscono questo nuovo capitolo al suo illustre predecessore.\n\nIstruzioni per l'installazione\nMontare il file immagine; installare il gioco; sostituire il file bionic_commando originale con quello contenuto nella cura.\n\nRequisiti di sistema minimi\nSistema Operativo: Windows XP SP2 / Windows Vista (non ÃƒÂ¨ necessario aver installato alcun Service Pack di Vista)\nCPU: IntelÃ‚Â® CoreTM2 Duo 2.4 GHz oppure AMD AthlonTM X2 5200+ 2.6 GHz\nRAM: 1.5GB\nScheda Video: DirectXÃ‚Â®9.0c con Shader3.0 e 512MB di memoria\nAudio: compatibile DirectSound e DirectX 9\nDisco Fisso: 8GB di spazio libero\nLettore DVD: compatibile DVD9 (DVD Dual-Layer)\nMonitor: risoluzione di 800x600\nController: mouse e tastiera (ottimizzato per joypad Xbox 360)\nMultiplayer: connessione internet richiesta per gioco online.\n\nRequisiti di sistema consigliati\nSistema Operativo:\nWindows XP SP2 / Windows Vista (non ÃƒÂ¨ necessario aver installato alcun Service Pack di Vista)\nCPU: Intel Core 2 Quad 2.4 Ghz oppure AMD Phenom 9500 Quad Core o superiore\nRAM: 2GB o superiore\nScheda Video: DirectXÃ‚Â®10.0 con Shader4.0 e 512MB di memoria o superiore\nAudio: compatibile DirectSound e DirectX 9\nDisco Fisso: 8GB di spazio libero\nLettore DVD: compatibile DVD9 (DVD Dual-Layer)\nMonitor: risoluzione di 1280x700 o superiore\nController: mouse e tastiera (ottimizzato per joypad Xbox 360)\nMultiplayer: connessione internet richiesta per gioco online.\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:c8fe7b3bf6d44685636589de970e5aaef215678b","amp;dn":"Bionic+Commando+%5Bdvd-dl+-+multi9+%5BTntvillage.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8fe7b3bf6d44685636589de970e5aaef215678b","infoHashBuffer":{"type":"Buffer","data":[200,254,123,59,246,212,70,133,99,101,137,222,151,14,90,174,242,21,103,139]},"announce":[],"urlList":[]}}