{"title":"Encyclopedia of Educational Psychology - (Malestrom)","uid":4819558,"size":19746023,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c91c771a8eaa4ca0c6593789fef31be3c17773e5&amp;dn=Encyclopedia+of+Educational+Psychology+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238708202,"description":" &lt;a href=&quot;http://www.image-upload.net/images/79k0xhehj6s5fe6th1l9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/79k0xhehj6s5fe6th1l9.jpg&lt;/a&gt;\n\nPublisher: Sage Publications, Inc; 1 edition (January 17, 2008)\nLanguage: English\nISBN-10: 1412916887\nISBN-13: 978-1412916882\n\nReview\n&quot;Editor Salkind (psychology &amp; research in education, Univ. of Kansas; Introduction to Theories of Human Development) here synthesizes expert-written contributions centering on the complex field of educational psychology and drawing on a range of disciplines: anthropology, psychology, sociology, education, public health, counseling, history, and philosophy. Advancing Salkind's seminal three-volume Encyclopedia of Human Development (Sage, 2005) and broader in scope than Barry J. Zimmerman and Dale H. Schunk's Educational Psychology: A Century of Contributions (Lawrence Erlbaum, 2002), which reads like a who's who in the field, this two-volume set succeeds in its stated aim of opening up the discipline of educational psychology to a wide general audience. The 275 topically organized entries and a reader's guide comprising 19 key themes (e.g., classroom achievement, language development, research methods and statistics) combine with See also references, further readings, and an extensive index to create a framework from which to educate and elucidate fundamental information on this important topic. BOTTOM LINE This comprehensive, informative, cross-disciplinary, and authoritative encyclopedia supports a holistic approach to preschool to adult education and would make a welcome addition to any undergraduate collection.&quot;\n-Library Journal (Marianne E. Giltrud Library Journal )\n\nProduct Description\n&quot;This comprehensive, informative, cross-disciplinary, and authoritative encyclopedia supports a holistic approach to preschool to adult education and would make a welcome addition to any undergraduate collection.&quot;\n-Library Journal\n\nEducational Psychology is a special field of endeavor since it strives to apply what we know about many different disciplines to the broad process of education. In the most general terms, you can expect to find topics in this area that fall into the categories of human learning and development (across the life span), motivation, measurement and statistics, and curriculum and teaching. There are few comprehensive overviews of the field of educational psychology, and the purpose of this two-volume Encyclopedia is to share this information in a way that is, above all, informative without being overly technical or intimidating.\n\nWith more than 275 contributions, the Encyclopedia of Educational Psychology opens up the broad discipline of educational psychology to a wide and general audience. Written by experts in each area, the entries in this far-reaching resource provide an overview and an explanation of the major topics in the field of human development. While the Encyclopedia includes some technical topics related to educational psychology, for the most part, it focuses on those topics that evoke the interest of the everyday reader.\n\nKey Features\n*Addresses topics that are of particular interest to the general public such as vouchers, Head Start, divorce, learning communities and charter schools\n*Shares subjects that are rich, diverse, and deserving of closer inspection with an educated reader who may be uninformed about educational psychology\n*Draws from a variety of disciplines including psychology, anthropology, education, sociology, public health, school psychology, counseling, history, and philosophy\n*Presents many different topics all tied together by the theme of how the individual can best function in an educational setting, from pre-school through adult education\n\nKey Themes\n*Classroom Achievement\n*Classroom Management\n*Cognitive Development\n*Ethnicity, Race, and Culture\n*Families\n*Gender and Gender Development\n*Health and Well-Being\n*Human Development\n*Intelligence and Intellectual Development\n*Language Development\n*Learning and Memory\n*Organizations\n*Peers and Peer Influences\n*Public Policy\n*Research Methods and Statistics\n*Social Development\n*Teaching\n*Testing, Measurement, and Evaluation\n*Theory\n\nThis practical Encyclopedia brings the field of educational psychology to the everyday person making it a welcome addition to any academic or public library. (20080515)","torrent":{"xt":"urn:btih:c91c771a8eaa4ca0c6593789fef31be3c17773e5","amp;dn":"Encyclopedia+of+Educational+Psychology+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c91c771a8eaa4ca0c6593789fef31be3c17773e5","infoHashBuffer":{"type":"Buffer","data":[201,28,119,26,142,170,76,160,198,89,55,137,254,243,27,227,193,119,115,229]},"announce":[],"urlList":[]}}