{"title":"Coast to Coast AM June 24, 2013 - UFOs &amp; Cryptozoology","uid":8636265,"size":56602850,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c91f0d8711a2f6db99acc016282ecb92407f1281&amp;dn=Coast+to+Coast+AM+June+24%2C+2013+-+UFOs+%26amp%3B+Cryptozoology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pyramid91","files":5,"time":1372755781,"description":"MP3 version wins!\nCourtesy of Coast to Coast Am's wonderful  &quot;Coast Insider&quot; service!\nShow description:\n\nDate:\n06-24-13\nHost:\nGeorge Noory\nGuests:\nStan  Gordon,                   Jerome  Corsi\nParanormal investigator Stan Gordon shared case histories of UFO and cryptozoological phenomena that have taken place in Pennsylvania. Some have called the 1965 Kecksburg incident, &quot;the Roswell of the East,&quot; in which an acorn-shaped object crashed into the woods but the public was told it was a meteor and nothing was found. According to Gordon, there was a secret government retrieval process and numerous witnesses to this. There've been rumors of alleged bodies found in the area, and a witness, Myron, who was making a delivery to the Wright-Patterson AFB warehouse where the Kecksburg object was scaffolded, said he saw a small body covered by a white sheet on a work table. All he could see was the left hand hanging down which had three index fingers with lizard-like skin, Gordon recounted. \nOne of the biggest outbreaks of Bigfoot sightings in history took place in the years 1973-74 in southwestern Pennsylvania, Gordon reported, including many close-up daylight incidents. There were also cases where UFO sightings seemed to be connected to these creatures, such as when a woman saw an aerial boomerang-shaped object, and smelled a sulfur-like odor. Later that night, she heard gun shots, and found out that her neighbor had fired on a large hairy bipedal creature that was approaching his dog. Audio recordings of Bigfoot from this era have been described as sounding similar to a woman screaming, a baby crying, or even like someone with asthma with belabored breathing, he detailed. \nGordon also shared updates on strange winged entities seen in PA, one of which appeared to be around 9 ft. tall, with a pointed head, dark skin, a muscular body, four finger-like claws on each hand, and wings folded into its back. Recent sightings include the 'Creature of Mud Creek Road,' reported in November, 2012, in which a werewolf-like entity that had long talon-like claws, was observed crawling low to the ground, and a very large flying creature that resembled a &quot;dragon&quot; seen flying in Fayette County after a whooshing sound came from overhead. He also touched on curious encounters people have had with small unexplained flying spheres.  \nEdward Snowden Update\nFirst hour guest, author and columnist Jerome Corsi offered commentary on the latest developments in the Edward Snowden case. Snowden currently reported to be in Russia, is trying to evade extradition back to the US. Being harbored in a country where he doesn't even speak the language, such as Russia, China, or Ecuador, he could be pressured to reveal more secrets about the US, if he has them, Corsi remarked, adding that in this case, it's a very fine line between hero and traitor. \nNews segment guest: William Henry\nWebsite(s):\n stangordon.info\n wnd.com/author/jcorsi\nVideo(s):\n Kecksburg: The Untold Story\nBook(s):\n Silent Invasion: The Pennsylvania UFO-Bigfoot Casebook \n Really Mysterious Pennsylvania\n","torrent":{"xt":"urn:btih:c91f0d8711a2f6db99acc016282ecb92407f1281","amp;dn":"Coast+to+Coast+AM+June+24%2C+2013+-+UFOs+%26amp%3B+Cryptozoology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c91f0d8711a2f6db99acc016282ecb92407f1281","infoHashBuffer":{"type":"Buffer","data":[201,31,13,135,17,162,246,219,153,172,192,22,40,46,203,146,64,127,18,129]},"announce":[],"urlList":[]}}