{"title":"Navy Medicine in Vietnam: Oral Histories From Dien Bien Ph t","uid":11740520,"size":5290655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca295a266d7575a1be00ba5af46e7b47f3d2c3f8&amp;dn=Navy+Medicine+in+Vietnam%3A+Oral+Histories+From+Dien+Bien+Ph+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425784593,"description":"The book chronicles the Navy Medical Department's participation in Vietnam, beginning with the Navy's rescue of the French survivors of the Battle of Dien Bien Phu in 1954 and ending with the Navy's rescue of Vietnamese refugees fleeing the fall of South Vietnam in 1975.\n\nWhen American involvement reached its peak in 1968, the 750-bed Naval Support Activity Hospital Danang (NSAH) was in full operation, and two hospital ships--the USS Repose and the USS Sanctuary--cruised offshore. Whether the situation called for saving the lives of injured sailors aboard a burning aircraft carrier or treating a critically wounded Marine for shock in the rubble-strewn streets of Hue, Navy medical personnel were in Vietnam from the beginning of American involvement to the very end, saving thousands of lives.\n\nThis book tells the story of the Navy Medical Department's involvement through stark and gripping first-person accounts by patients and the Navy physicians, dentists, nurses, and hospital corpsmen who treated them. More than 50 historic photos document their work","torrent":{"xt":"urn:btih:ca295a266d7575a1be00ba5af46e7b47f3d2c3f8","amp;dn":"Navy+Medicine+in+Vietnam%3A+Oral+Histories+From+Dien+Bien+Ph+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca295a266d7575a1be00ba5af46e7b47f3d2c3f8","infoHashBuffer":{"type":"Buffer","data":[202,41,90,38,109,117,117,161,190,0,186,90,244,110,123,71,243,210,195,248]},"announce":[],"urlList":[]}}