{"title":"Director 8 and Lingo Bible","uid":6616934,"size":5650422,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca2bac2b56eb325c06faada969f21d6e60f0e8fe&amp;dn=Director+8+and+Lingo+Bible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1313830967,"description":"Director 8 and Lingo Bible\nJohn R. Nyquist (Author), Robert Martin (Author)\n\nPaperback: 1044 pages\nPublisher: Wiley (July 27, 2000)\nLanguage: English\nISBN-10: 0764534866\nISBN-13: 978-0764534867\n\nProduct Description:\nUnlike other books on Director, this book serves as a practical guide for all aspects of using the program from start to finish. This book is the ideal start for beginners just learning how to use the program. Intermediate users can also benefit by learning shortcuts, advanced tips and Lingo basics. Advanced users who can take advantage of Director's improved power and speed by with this book's more in-depth guide to Lingo, techniques for better project management, shortcuts for title development, and more advanced techniques for developing titles to play over the Internet quickly and efficiently using Shockwave technology. A 16-page color insert features real projects created by professionals who use the product, with tips from the developer on how they used Director to create the project. Unlike competitive books, the Director 8 and Lingo Bible has balanced coverage of both Mac and Windows versions, as Mac is no longer the default platform for Director. The bonus CD contains real-life working examples and exercises from the book along with utilities and other shareware extras for use with Director 8.\n\nFrom the Publisher:\nInside you'll find complete coverage of Director 8 and Lingo:\nGet up to speed on Director's newest features and improved interface\nMaster the fundamentals of Director movies -- cast members, sprites, and scores\nImplement shortcuts for title development\nCreate powerful interactive presentations\nIncorporate digital audio and video into your projects\nOutput your files to Shockwave, Java, and other media\nCreate custom sprites, behaviors, and 3-D interfaces using Lingo\nUnderstand the opportunities and constraints of Web delivery","torrent":{"xt":"urn:btih:ca2bac2b56eb325c06faada969f21d6e60f0e8fe","amp;dn":"Director+8+and+Lingo+Bible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca2bac2b56eb325c06faada969f21d6e60f0e8fe","infoHashBuffer":{"type":"Buffer","data":[202,43,172,43,86,235,50,92,6,250,173,169,105,242,29,110,96,240,232,254]},"announce":[],"urlList":[]}}