{"title":"60 Minutes MH370","uid":15467114,"size":558689818,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca58abf92c7eb333341ef5257f8071dceb4581ea&amp;dn=60+Minutes+MH370&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AboveandBeyond7","files":2,"time":1470107654,"description":"60 minutes MH370 Special investigation part 1 \r\nMp4 1080p 1920x1080 aac 125kbps 265mb 11mins59 long,  Aviation experts frequently remind us that flying on modern jet planes is the safest form of transport. However those assertions are meaningless while the fate of Malaysian Airlines flight MH370 remains unknown. It’s more than two years since the Boeing 777 disappeared off the face of the earth. An exhaustive and expensive search in the southern Indian Ocean has failed to turn up anything. It’s due to end soon, which has further distressed the grieving families of the 239 passengers and crew who are presumed dead. Frustration at the lack of clues has led to significant reassessment about MH370, and as Ross Coulthart discovers in this 60 Minutes investigation, there’s now growing evidence that authorities have been ignoring more credible theories about what might have brought the jet down, \r\n\r\n\r\n\r\n60 minutes MH370 Special investigation part 2 \r\nMp4 1080p 1920x1080 aac 125kbps 268mb 11mins47 long, Aviation experts frequently remind us that flying on modern jet planes is the safest form of transport. However those assertions are meaningless while the fate of Malaysian Airlines flight MH370 remains unknown. It’s more than two years since the Boeing 777 disappeared off the face of the earth. An exhaustive and expensive search in the southern Indian Ocean has failed to turn up anything. It’s due to end soon, which has further distressed the grieving families of the 239 passengers and crew who are presumed dead. Frustration at the lack of clues has led to significant reassessment about MH370, and as Ross Coulthart discovers in this 60 Minutes investigation, there’s now growing evidence that authorities have been ignoring more credible theories about what might have brought the jet down","torrent":{"xt":"urn:btih:ca58abf92c7eb333341ef5257f8071dceb4581ea","amp;dn":"60+Minutes+MH370","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca58abf92c7eb333341ef5257f8071dceb4581ea","infoHashBuffer":{"type":"Buffer","data":[202,88,171,249,44,126,179,51,52,30,245,37,127,128,113,220,235,69,129,234]},"announce":[],"urlList":[]}}