{"title":"The Norm Chronicles: Stories and Numbers About Danger (2013)","uid":8634980,"size":2874585,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ca68e23dfb6c4cd46eb85beb336dbcece226948c&amp;dn=The+Norm+Chronicles%3A+Stories+and+Numbers+About+Danger+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1372721035,"description":"Meet Norm. He's 31, 5'9&quot;, just over 13 stone, and works a 39 hour week. He likes a drink, doesn't do enough exercise and occasionally treats himself to a bar of chocolate (milk). He's a pretty average kind of guy. In fact, he is the average guy in this clever and unusual take on statistical risk, chance, and how these two factors affect our everyday choices. Watch as Norm (who, like all average specimens, feels himself to be uniquely special), and his friends careful Prudence and reckless Kelvin, turns to statistics to help him in life's endless series of choices - should I fly or take the train? Have a baby? Another drink? Or another sausage? Do a charity skydive or get a lift on a motorbike?Because chance and risk aren't just about numbers - it's about what we believe, who we trust and how we feel about the world around us. What we do, or don't do, has as much do with gut instinct as hard facts, with enjoyment as understanding. If you've ever wondered what the statistics in tabloid scare stories really mean, how dangerous horse-riding is compared to class-A drugs, or what governs coincidence, you will find it all here.From a world expert in risk and the bestselling author of The Tiger That Isn't (and creator of BBC Radio 4's More or Less), this is a commonsense (and wildly entertaining) guide to personal risk and decoding the statistics that represent it.\n\n2013\nepub","torrent":{"xt":"urn:btih:ca68e23dfb6c4cd46eb85beb336dbcece226948c","amp;dn":"The+Norm+Chronicles%3A+Stories+and+Numbers+About+Danger+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca68e23dfb6c4cd46eb85beb336dbcece226948c","infoHashBuffer":{"type":"Buffer","data":[202,104,226,61,251,108,76,212,110,184,91,235,51,109,188,236,226,38,148,140]},"announce":[],"urlList":[]}}