{"title":"Blues America - BBC docs.","uid":9537130,"size":8801247191,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ca7b2a48781d05cd3e32daf8c5882c943ad97743&amp;dn=Blues+America+-+BBC+docs.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"winiwini","files":26,"time":1390953610,"description":"\nWoke up this Morning\nEpisode 1 of 2\nDuration: 1 hour \n\nBlues is usually described as the sound of racial suffering and feeling sad, but this documentary \nargues that the blues began as a form of black pop music. First appearing in the Southern states \nof the USA around 1900, blues created by the poorest people in the richest nation on earth took America by storm. \nThe film look at the early years of the blues to discover how Bessie Smith, Blind Lemon Jefferson and \nCharlie Patton used the latest media to bring their music to the public. With contributions from Keith Richards, \nTaj Mahal and Chuck D.\n\n\n\n\nBright Lights, Big CitY\nEpisode 2 of 2\nDuration: 1 hour \n\nAfter 1945, artists like Muddy Waters, Howlin' Wolf and John Lee Hooker rooted the blues firmly in the city, \nwhere it contributed to the musical desegregation of America by spawning rock'n' roll. As the blues \nconquered the world and the music moved from black to white audiences, arguments developed about what was \nthe real authentic blues. Robert Johnson returned from the dead to sell more records than any other blues artist. \nBy the 21st century, the blues not only retained the earthiness of its roots but was also being celebrated \nin the White House. With contributions from Keith Richards, Bonnie Raitt, Seasick Steve and Buddy Guy.\n\n\n\n\nBlues on Later with Jools Holland\nBBC2 Broadcast\nDecember 2013\n\nA compilation of performances by many of the greatest blues artists to have appeared on the show and \nHootenanny specials since 1992. Acts featured include BB King, Bo Diddley, Eric Clapton, Seasick Steve, \nZZ Top and Buddy Guy.","torrent":{"xt":"urn:btih:ca7b2a48781d05cd3e32daf8c5882c943ad97743","amp;dn":"Blues+America+-+BBC+docs.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca7b2a48781d05cd3e32daf8c5882c943ad97743","infoHashBuffer":{"type":"Buffer","data":[202,123,42,72,120,29,5,205,62,50,218,248,197,136,44,148,58,217,119,67]},"announce":[],"urlList":[]}}