{"title":"KINGDOMS (Update 26.10.15)","uid":12663145,"size":463589929,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cbae7dd76e234f3e33e09a33a56b974f8448f2b1&amp;dn=KINGDOMS+%28Update+26.10.15%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1446328188,"description":"About This Game\r\nKINGDOMS is a procedural medieval RPG in a randomly generated open world. The main feature of KINGDOMS is a smart AI system that completely controls NPC behavior. As the player, you can fully interact with this massive world and become any person you want to be.\r\n\r\nMAIN FEATURES\r\n\r\n&gt;&gt;DYNAMIC WORLD\r\nDuring the game, the world changes constantly: settlements appear, new houses, taverns, and shops are built. NPCs decide for themselves what to build next and how their settlement should be developed; and of course this living world reacts to any players' actions.\r\n\r\n&gt;&gt;LIVING AI\r\nEach npc has his own life goal and acts depending on this goal. Every NPC is unique - temper, motivation, reputation, skills and many other parameters affect NPC behavior. Even when NPCs have the same goal, this goal can be reached in different ways depending on situation.\r\n\r\n&gt;&gt;FREEDOM\r\nYou can do anything you want, you can go anywhere you want. Explore caves and ruins, fight wild animals and bandits, trade with other characters, open shops, taverns or manufactories, create settlements or even whole kingdoms and manage them or just help other people. It’s up to you!\r\n\r\n&gt;&gt;DYNAMIC COMBAT\r\nAs with all other aspects of KINGDOMS, we want to make combat as realistic as possible. The movement of your sword depends on mouse movement. Our goal is to make combat intuitive and give you a challenge. One perfect strike can be the final one.\r\n\r\n&gt;&gt;K-EDITOR\r\nOur mods editor, K-Editor, allows you to make any kind of modifications from new items to global mods. World, quests, AI, items, creatures - All can be changed or modified","torrent":{"xt":"urn:btih:cbae7dd76e234f3e33e09a33a56b974f8448f2b1","amp;dn":"KINGDOMS+%28Update+26.10.15%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbae7dd76e234f3e33e09a33a56b974f8448f2b1","infoHashBuffer":{"type":"Buffer","data":[203,174,125,215,110,35,79,62,51,224,154,51,165,107,151,79,132,72,242,177]},"announce":[],"urlList":[]}}