{"title":"The Dark Knight - iPhone","uid":4580204,"size":650909731,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:cc2c0db5c1b4b7be0412d9ee7afa567f3ad87697&amp;dn=The+Dark+Knight+-+iPhone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aced6","files":1,"time":1229392047,"description":"&quot;The Dark Knight&quot; for the iPhone / iPod Touch\n\nConverted with XViD4PSP 5.0\n_____________________________________________\n\nLength:  2:25:57\nYear:    2008\nRating:  PG-13\nGenre:   Action &amp; Adventure\nSize:    635,655 KB\n\nSummary: \n\nIn Gotham City, the Joker robs a mob-owned bank with his accomplices, whom he tricks into killing each other. That night, Batman interrupts a meeting between the Chechen, a Gotham mobster, and the Scarecrow, but suffers wounds from the Chechen's dogs, allowing the Chechen to escape and prompting Batman to re-design his batsuit. Batman and Lieutenant James Gordon contemplate including new district attorney Harvey Dent in their plan to eradicate the mob, as he could be the public hero Batman cannot be. However, Batman wonders if Dent can be trusted. Bruce runs into Rachel Dawes and Dent, who are dating, and after talking to Dent he realizes he is sincere and decides to host a fundraiser for him.\n\nNotes:\n\nThe Dark Knight is a 2008 American superhero film directed and co-written by Christopher Nolan. Based on the DC Comics character Batman, the film is part of Nolan's Batman film series and a sequel to 2005's Batman Begins. Christian Bale reprises the lead role. The film follows Bruce Wayne/Batman (Bale), District Attorney Harvey Dent (Aaron Eckhart), Assistant D.A. Rachel Dawes (Maggie Gyllenhaal), and Police Commissioner James Gordon (Gary Oldman) and their struggles and journey in combating the new threat of the Joker (Heath Ledger). The Joker's identity is left a mystery in the film, while Two-Face's transformation from heroic district attorney to disfigured killer is presented entirely. Nolan's inspiration for the film was the Joker's comic book debut in 1940, and the 1996 series The Long Halloween, which retold Two-Face's origin. The Dark Knight was filmed primarily in Chicago, as well as in several other locations in the United States, the United Kingdom, and Hong Kong. Nolan used an IMAX camera to film some sequences, including the Joker's first appearance in the film.\n\nOn January 22, 2008, after he had completed filming The Dark Knight, Heath Ledger died of a sleeping pill overdose, leading to intense attention from the press and more people showing interest in the film. Warner Bros. had created a viral marketing campaign for The Dark Knight, developing promotional websites and trailers highlighting screen shots of Ledger as the Joker, but after Ledger's death, the studio refocused its promotional campaign.[2][3] The film was released on July 16, 2008 in Australia, on July 18, 2008 in North America, and on July 24, 2008 in the United Kingdom. Prior to its box office debut in North America, record numbers of advance tickets were sold for The Dark Knight. It was greeted with positive reviews upon release,[4] and became only the second film to earn more than $500 million at the United States box office, setting numerous other records in the process.\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:cc2c0db5c1b4b7be0412d9ee7afa567f3ad87697","amp;dn":"The+Dark+Knight+-+iPhone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc2c0db5c1b4b7be0412d9ee7afa567f3ad87697","infoHashBuffer":{"type":"Buffer","data":[204,44,13,181,193,180,183,190,4,18,217,238,122,250,86,127,58,216,118,151]},"announce":[],"urlList":[]}}