{"title":"T.A.T.U. Remixes [dub;dnb;covers]","uid":7440491,"size":196377460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cdf259ed62126638a6298b0ba654d2b0146c4219&amp;dn=T.A.T.U.+Remixes+%5Bdub%3Bdnb%3Bcovers%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"horrorhound","files":31,"time":1342205829,"description":"\nzombiRG Presents: TATU Remixes\n\n31 tracks\nmp3\none hour forty seven minutes full running time\n187MB\n\nThese are hard to find dubstep,drum and bass, covers, and duets of taty a russian technopop band. They have now split up to do separate things and taty is no longer a band. Taty was a Russian dance music duo composed of Lena Katina and Yulia Volkova (alternative spelling: Julia Volkova). Formed on May 31, 1999 by Ivan Shapovalov, the group signed a deal with independent label Neoformat, then later signed with Universal Music Russia, and finally with Interscope Records in 2001.\nt.A.T.u. gained mainstream recognition when they released their first English single &quot;All the Things She Said&quot;, which topped the charts in the United Kingdom, Australia, New Zealand, Italy, Switzerland and other European countries. The music video stirred much controversy, showing the girls kissing and caressing each other in soaking wet school uniforms.\nThe group's English-language album 200 km/h in the Wrong Lane was the group's best-selling album. t.A.T.u. became the first group ever to get the IFPI Europe platinum award for the same album in two different languages.\nThe group represented Russia in the Eurovision Song Contest in Riga, Latvia, with the song &quot;Ne Ver', Ne Boysia&quot;, where they placed third. In mid-2005, the group released the single &quot;All About Us&quot;, which was another successful hit worldwide. In October 2005, the group released their second English album, &quot;Dangerous and Moving&quot;, and their second Russian-language album &quot;Lyudi Invalidy&quot;. Then in 2006, the group released their first and only official compilation, &quot;The Best of t.A.T.u.&quot;, and announced they had left their record label, Universal Music. The group released their third Russian album &quot;Vesyolye Ulybki&quot; in 2008 and the English counterpart &quot;Waste Management&quot; in December 2009 worldwide digitally.\nOn March 2011, the group announced on their website that t.A.T.u. had split up, as both Yulia and Lena are pursuing solo careers. Throughout their career, the group sold almost 10 million copies worldwide, making t.A.T.u. the best-selling group in Russian music history. The group also received an MTV Legend award, citing their 10-year history together. As of 2011, Yulia is signed to Gala Records and goes by the more Western adaptation of her name, &quot;Julia Volkova&quot;.\ntaty - russian spelling\nTATU - english\nplease seed and enjoy more mixes coming soon\ncome see us in irc at #zombiRG","torrent":{"xt":"urn:btih:cdf259ed62126638a6298b0ba654d2b0146c4219","amp;dn":"T.A.T.U.+Remixes+%5Bdub%3Bdnb%3Bcovers%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdf259ed62126638a6298b0ba654d2b0146c4219","infoHashBuffer":{"type":"Buffer","data":[205,242,89,237,98,18,102,56,166,41,139,11,166,84,210,176,20,108,66,25]},"announce":[],"urlList":[]}}