{"title":"Computer Networks Third Edition: A Systems Approach","uid":5739628,"size":10947627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ceb6afe72b7572d6951018c1cc404c443fba5c94&amp;dn=Computer+Networks+Third+Edition%3A+A+Systems+Approach&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"odain191","files":1,"time":1280954295,"description":" Computer Networks, Third Edition: A Systems Approach\nPublisher: Morgan Kaufmann | ISBN: 155860832X | edition 2003 | PDF | 838 pages | 10,4 mb\n\nComputer Networks: A Systems Approach, designed for an advanced college-level course in network design and operation, provides the network applications programmer with detailed information about how networks do their thing. While Computer Networks is neither a user manual nor a technical reference, it provides an in-depth background on how network architectures and protocols work.\nIn the beginning, Larry Peterson and Bruce Davie discuss why networks are important and talk about where networks may go in the long term. The authors then move right into a discussion of protocols. There's a fascinating section--complete with plenty of C code--in which the authors actually develop a network protocol called A Simple Protocol (ASP). They compare switching and packet networks and emphasize tunneling protocols. In the internetworking chapter, you'll learn practically all there is to know about Internet Protocol (IP). The concluding chapters talk about traffic management, congestion reduction, and high-speed networking technologies. ","torrent":{"xt":"urn:btih:ceb6afe72b7572d6951018c1cc404c443fba5c94","amp;dn":"Computer+Networks+Third+Edition%3A+A+Systems+Approach","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb6afe72b7572d6951018c1cc404c443fba5c94","infoHashBuffer":{"type":"Buffer","data":[206,182,175,231,43,117,114,214,149,16,24,193,204,64,76,68,63,186,92,148]},"announce":[],"urlList":[]}}