{"title":"Allschwil Posse - Mitleid plus extra special super dooper bonus","uid":4692077,"size":139932293,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:cf34e16bd75f3921aeaf495bf2d5f07868a95a98&amp;dn=Allschwil+Posse+-+Mitleid+plus+extra+special+super+dooper+bonus+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ritxard","files":22,"time":1233428130,"description":"320 KBit/s mp3 Lame, CD Rip, uploaded by a proud fan Of the Grasshopper Club ZÃƒÂ¼rich\n\nKaixo, Hello, Sali ZÃƒÂ¤mÃƒÂ¤ !\n\nHere is another great classic from my mother's CD collection. Until now a hard-to-find classic. Bonie Collar from  Zurich along together with his homie Booby Rough'n'R from Berne. They're really the biggest Bad Ass Ghetto Pimps that Basylandia ever has seen ( and heard of course).\nI only can say that &quot;Fraue ÃƒÂ¼ber Zwanzig schmekkÃƒÂ¤ ranzig&quot; do you understand &quot;Kanarievogelfigger&quot; ??\n\nIf you don't understand swiss dialect or your from the Outland(swiss expression for foreign country)like Basel, it could be that you consider this Album as not very funny. But don't let this bother you. The two fellows who are behind this album/project are very expirienced musicians. Some of the beatz really kick ass, even if you don't understand what they were rapping about. \n\nSo biggie up and respect to my mother and the allmighty Jah who created her and those Allschwil Posse guys. Enjoy!  \n\nPlease don't be upsetted if the download may take a while: I can only upload with a speed of about 50 KBit/s.  Blame Euskaltel and or the basque and especially the spanish government for it !!!!!\n\nHave also a look on other torrents I've posted and feel free to place a comment or a feedback. I would be very glad about. Eskerrik asko ! Thank you!\n\n---------------------------------------------------------------------------------------------------\nAupa Athletik! Beti zurekin!\n\nBerne is the capital of Switzerland. It has seven times the size of the graveyard of Naples, but it's only half as funny. (Luciano di Crescenco)","torrent":{"xt":"urn:btih:cf34e16bd75f3921aeaf495bf2d5f07868a95a98","amp;dn":"Allschwil+Posse+-+Mitleid+plus+extra+special+super+dooper+bonus+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf34e16bd75f3921aeaf495bf2d5f07868a95a98","infoHashBuffer":{"type":"Buffer","data":[207,52,225,107,215,95,57,33,174,175,73,91,242,213,240,120,104,169,90,152]},"announce":[],"urlList":[]}}