{"title":"Dreams of Other Worlds -Impey/Henry- PDF_(K-Slender)","uid":9037929,"size":13026672,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d0248dd8a773d7ce458de6e817c0c25e0d17e992&amp;dn=Dreams+of+Other+Worlds+-Impey%2FHenry-+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"K-Slender","files":3,"time":1381550292,"description":"Publisher: Princeton University Press (September 8, 2013)\nLanguage: English\nISBN-10: 0691147531\nISBN-13: 978-0691147536\n\n\nDreams of Other Worlds describes the unmanned space missions that have opened new windows on distant worlds. Spanning four decades of dramatic advances in astronomy and planetary science, this book tells the story of eleven iconic exploratory missions and how they have fundamentally transformed our scientific and cultural perspectives on the universe and our place in it.\n\nThe journey begins with the Viking and Mars Exploration Rover missions to Mars, which paint a startling picture of a planet at the cusp of habitability. It then moves into the realm of the gas giants with the Voyager probes and Cassini's ongoing exploration of the moons of Saturn. The Stardust probe's dramatic round-trip encounter with a comet is brought vividly to life, as are the SOHO and Hipparcos missions to study the Sun and Milky Way. This stunningly illustrated book also explores how our view of the universe has been brought into sharp focus by NASA's great observatories--Spitzer, Chandra, and Hubble--and how the WMAP mission has provided rare glimpses of the dawn of creation.\n\nDreams of Other Worlds reveals how these unmanned exploratory missions have redefined what it means to be the temporary tenants of a small planet in a vast cosmos. ","torrent":{"xt":"urn:btih:d0248dd8a773d7ce458de6e817c0c25e0d17e992","amp;dn":"Dreams+of+Other+Worlds+-Impey%2FHenry-+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0248dd8a773d7ce458de6e817c0c25e0d17e992","infoHashBuffer":{"type":"Buffer","data":[208,36,141,216,167,115,215,206,69,141,230,232,23,192,194,94,13,23,233,146]},"announce":[],"urlList":[]}}