{"title":"Democracy Now - 01 mar 2012","uid":7069797,"size":450547877,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d03d83f26013b8c304d0cf89bf25faca2b4ac0f0&amp;dn=Democracy+Now+-+01+mar+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1330620922,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Mar 01, 2012\n\n- 12 Killed in Major Storms Through Midwest, South\n- North Korea to Halt Nuclear Tests in Return for U.S. Aid\n- 2 NATO Soldiers Shot Dead in Latest Afghan Attack\n- U.N. Human Rights Council Condemns Syria Crackdown\n- Egypt Lifts Travel Ban on Foreign NGO Workers\n- Haiti: Thousands Mark 8th Anniversary of Aristide Coup\n- Israel Raids Palestinian TV Stations\n- WikiLeaks: DHS Monitored Occupy Wall Street\n- NJ Gov. Slams NYPD for Muslim Spying\n- Montana Judge Admits Sending &quot;Racist&quot; Email About Obama\n- James Murdoch Out as News International Chair\n- Judge Blocks Day Laborer Rule in Arizona Immigration Law\n- Anti-Drone Activists Sentenced for Air Base Protest\n- Limbaugh Calls Student Birth Control Activist a &quot;Slut&quot;\n\n\nSpecial reports\n\n- Occupy Education: Teachers, Students Resist School Closings, Privatizations, Layoffs and Rankings\n\nAs students across the country stage a national day of action to defend public education, we look at the nation's largest school systems - Chicago and New York City - and the push to preserve quality public education amidst new efforts to privatize schools and rate teachers based on test scores. In Chicago, the city's unelected school board voted last week to shut down seven schools and fire all of the teachers at 10 other schools. In New York City, many educators are criticizing Mayor Michael Bloomberg's administration after the release of the names of 18,000 city teachers, along with a ranking system that claims to quantify each teacher's impact on the reading and math scores of their pupils on statewide tests. &quot;The danger is that if teachers and schools are held accountable just for relatively narrow measures of what it is students are doing in class, that will become what drives the education system,&quot; says Columbia University's Aaron Pallas, who studies the efficiency of teacher-evaluation systems. &quot;The effects of school closings in [New York City] is one of the great untold stories today,&quot; says Democracy Now! education correspondent Jaisal Noor. &quot;The bedrock of these communities [has been] neighborhood schools and now they're being destroyed.&quot; Karen Lewis, president of the Chicago Teachers Union says, &quot;When you have a CEO in charge of a school system as opposed to a superintendent - a real educator - what ends up happening is that they literally have no clue how to run the schools.&quot; Lewis recounts a meeting where she says Chicago Mayor Rahm Emanuel told her that, &quot;25 percent of these kids are never going to amount to anything.&quot;\n\n\n- Chicago Residents Win Closure of Toxic Coal-Fired Power Plants After Health Ailments Spark Campaign\n\nChicago has announced an agreement to close two of the nation's oldest and dirtiest coal plants. For more than a decade, residents near the Fisk and Crawford coal-fired power plants have complained of the pollution, saying the mercury and carcinogenic particulate matter aggravates asthma and, potentially other illnesses. &quot;In my community, the people were afraid,&quot; says Leila Mendez, who lives near the Fisk coal plant and first got involved in community activism after experiencing health ailments. &quot;They felt they did not have a voice, but we proved that we do have a voice when we unite.&quot; Plans to close the two facilities follow the passage in December of stricter federal mercury and air toxics standards regulations, which give the facilities up to four years to clean up or close down, and has led other companies to opt to shutter its power plants.\n\n\n- David Cay Johnston: &quot;Romney's Tax Plan is George W. Bush on Steroids&quot;\n\nAs presidential hopeful Mitt Romney campaigns ahead of next week's Super Tuesday primary vote, we look at the winners and losers under his proposed tax plan. Romney has vowed tax breaks for all Americans, but a recent analysis by the Tax Policy Center found his plan would mostly benefit the wealthy - while raising taxes on the poorest 125 million Americans. &quot;All the Republicans have the same basic strategy. Reduce taxes on people who are already wealthy, and take away tax benefits for poor people, particularly who are striving to get out of their poverty, and restrict tax benefits for people who are workers in the middle class,&quot; says David Cay Johnston, a Pulitzer Prize-winning journalist who writes about taxes issues for Reuters. Cay Johnston is the author of &quot;Free Lunch: How the Wealthiest Americans Enrich Themselves at Government Expense (and Stick You With the Bill).&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d03d83f26013b8c304d0cf89bf25faca2b4ac0f0","amp;dn":"Democracy+Now+-+01+mar+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03d83f26013b8c304d0cf89bf25faca2b4ac0f0","infoHashBuffer":{"type":"Buffer","data":[208,61,131,242,96,19,184,195,4,208,207,137,191,37,250,202,43,74,192,240]},"announce":[],"urlList":[]}}