{"title":"YokoKimThurston - YokoKimThurston (2012) [EAC FLAC,CUE][A.C.U.M.","uid":8505194,"size":313843102,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d2000e28df0eee8f7e5e8218c36c71444ae4c34d&amp;dn=YokoKimThurston+-+YokoKimThurston+%282012%29+%5BEAC+FLAC%2CCUE%5D%5BA.C.U.M.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PittaSk8","files":6,"time":1369403577,"description":"YokoKimThurston - YokoKimThurston (2012) [EAC FLAC,CUE][A.C.U.M.]\n &lt;a href=&quot;\nhttp://imageshack.us/a/img41/7664/yktcover.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img41/7664/yktcover.jpg&lt;/a&gt;\n\nLike many valuable artists, Yoko Ono has long been a polarizing force, equally famous and controversial in circles of art and music. YokoKimThurston is a collaborative effort between Ono and two of Sonic Youth's lead creative forces, Kim Gordon and Thurston Moore. Though the trio worked together before this album, it marks the continuation of Gordon and Moore's creative work together following the end of their 27-year-long marriage earlier in 2012. The six pieces on YokoKimThurston are almost all extended meditations, but they seek out different realms of the avant-garde spectrum to inhabit. Tracks like &quot;I Missed You Listening&quot; and &quot;Let's Get There&quot; blend the dark guitar noise experimentation of the Sonic Youth contributors with Ono's tortured vocalizations. &quot;Running the Risk&quot; begins with a spoken word poetry collage from the voices of all three performers, eventually introducing caustic clean guitar sounds as Ono continues to offer Fluxus-styled word fragments and wordless vocal noises, eventually joined by Gordon. The atmosphere is dark and foreboding throughout most of the album's tracks. The trio explores the cross section of minimal guitar ambience, vocal improvisation, and poetry on &quot;I Never Told You, Did I?,&quot; ending up in a badlands somewhere between the Halloween-themed moodiness of Sonic Youth's Bad Moon Rising and Ono's work on albums like Fly. The mood is loose and improvisatory for most of the set, and offers less to latch on sonically than it does a tense but somehow reassuring mood. The album's strongest point comes in &quot;Mirror Mirror,&quot; as Fahey-esque acoustic guitar drones provide a pastoral backdrop for Ono's letter to herself and Gordon's reverberated grunts. The dark sprawl of &quot;Early in the Morning&quot; recalls ESP-Disk artist Patty Waters' extended and horrified take on &quot;Black Is the Color of My True Love's Hair&quot; with Ono's pained syllables being dragged over Moore's damaged guitar scratches. The pieces are unquestionably noisy avant-garde excursions into raw sound, and thusly won't appeal to even most Sonic Youth fans, but those fans are used to this kind of atonal sidetracking from the band. This type of collaboration runs the risk of very quickly becoming an excuse for like-minded peers to hang out and jam slightly, but YokoKimThurston feels more focused and risk-taking than some weekend distraction between friends. Sonic Youth have never shied away from releasing indulgent noise jams in the name of art for art's sake, but this album ranks above the best of their non-rock experimentation, and adds a new dimension, with both Gordon and Moore stepping back to serve as supporting noisemakers for Ono's one-of-a-kind voice.\n\nFonte: http://www.allmusic.com/album/yokokimthurston-mw0002411258\n\nScheda tecnica :\n\nGruppo : YokoKimThurston\n\nAlbum : YokoKimThurston\n\nAnno : 2012\n\nGenere : minimalista\n\nEtichetta : http://chimeramusic.com/\n\nBand :\n\nKim Gordon / Thurston Moore / Yoko Ono\n\nSongs :\n\n1 - I Missed You Listening\n2 - Running the Risk\n3 - I Never Told You, Did I?\n4 - Mirror Mirror\n5 - Let's Get There\n6 - Early in the Morning\n &lt;a href=&quot;\nhttp://i196.photobucket.com/albums/aa19/maxneb/seedordie5wmwe5.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i196.photobucket.com/albums/aa19/maxneb/seedordie5wmwe5.gif&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d2000e28df0eee8f7e5e8218c36c71444ae4c34d","amp;dn":"YokoKimThurston+-+YokoKimThurston+%282012%29+%5BEAC+FLAC%2CCUE%5D%5BA.C.U.M.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2000e28df0eee8f7e5e8218c36c71444ae4c34d","infoHashBuffer":{"type":"Buffer","data":[210,0,14,40,223,14,238,143,126,94,130,24,195,108,113,68,74,228,195,77]},"announce":[],"urlList":[]}}