{"title":"The Soul of the World (2014) {=IMPAVIDUS=}","uid":11429990,"size":1390222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d22bcd6157a720bbf2107e3d6ad8e63fc204a280&amp;dn=+The+Soul+of+the+World+%282014%29+%7B%3DIMPAVIDUS%3D%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sunghabib","files":-1,"time":1415713763,"description":"Book Description:\n\nIn The Soul of the World, renowned philosopher Roger Scruton defends the experience of the sacred against today's fashionable forms of atheism. He argues that our personal relationships, moral intuitions, and aesthetic judgments hint at a transcendent dimension that cannot be understood through the lens of science alone. To be fully alive--and to understand what we are--is to acknowledge the reality of sacred things. Rather than an argument for the existence of God, or a defense of the truth of religion, the book is an extended reflection on why a sense of the sacred is essential to human life--and what the final loss of the sacred would mean. In short, the book addresses the most important question of modernity: what is left of our aspirations after science has delivered its verdict about what we are?\n\nDrawing on art, architecture, music, and literature, Scruton suggests that the highest forms of human experience and expression tell the story of our religious need, and of our quest for the being who might answer it, and that this search for the sacred endows the world with a soul. Evolution cannot explain our conception of the sacred; neuroscience is irrelevant to our interpersonal relationships, which provide a model for our posture toward God; and scientific understanding has nothing to say about the experience of beauty, which provides a God's-eye perspective on reality.\n\nUltimately, a world without the sacred would be a completely different world--one in which we humans are not truly at home. Yet despite the shrinking place for the sacred in today's world, Scruton says, the paths to transcendence remain open.\n\nProduct Details:\n\nePub: 201 pages\nPublisher: Princeton University Press (April 6, 2014)\nLanguage: English\nISBN-10: 0691161577\nISBN-13: 978-0691161570\nAmazon Link:\n\n------------------------------------------------\nSeed - Share - Enjoy - Give me Thumbs Up","torrent":{"xt":"urn:btih:d22bcd6157a720bbf2107e3d6ad8e63fc204a280","amp;dn":"+The+Soul+of+the+World+%282014%29+%7B%3DIMPAVIDUS%3D%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d22bcd6157a720bbf2107e3d6ad8e63fc204a280","infoHashBuffer":{"type":"Buffer","data":[210,43,205,97,87,167,32,187,242,16,126,61,106,216,230,63,194,4,162,128]},"announce":[],"urlList":[]}}