{"title":"The Stephen King Audiobook Collection","uid":6710376,"size":60062909478,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d2badd18f36508800a48abac254ff83ba6a77bdd&amp;dn=The+Stephen+King+Audiobook+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":2239,"time":1317331036,"description":"-------------Complete Stephen King Audio Collection v4.0-------------\nFor years there have been dozens of copies of Stephen King's audio books floating around on the internet -- many of them broken. Over the past two years, I have collected the complete UNABRIDGED fictional works of King. I have released several versions and updates and present the newest full up-to-date torrent here. I have processed everything in the following ways:\n\n1. Checked for completeness. Many of the common copies on the internet which appear complete are missing large sections of audio. Notable examples include Firestarter, Gerald's Game, Cell, and many short stories. I have finally obtained complete copies of all books. :)\n\n2. Equalized volume. Many audio books, especially ones digitized from cassette tapes, have crazily varying volumes. I have equalized volumes so there shouldn't be any sudden jumps.\n\n3. FULLY CHAPTERIZED. This took many weeks. Each audio book was compiled into a single file (deleting bits like &quot;this concludes disc 2, please insert disc 3&quot;) and then separated into Parts and Chapters as defined by the original books. I find this to be the best way to enjoy audiobooks and it is perfect for iPods. There are a few books (Cujo, Dolores Claiborne, The Shawshank Redemption, etc.) in which King included no parts, chapters, or numbers to separate.\n\n4. Dehissed and noise-cleaned. When needed, I performed low pass filters and deleted pops in the audio.\n\n5. Encoded all books to a uniform MP3 96kbps 44.1kHz.\n\n6. ID3 Tagged. All audio book files have been fully ID3 tagged including full COVER ART. I have used the first edition covers for all books.\n\nAnd so we have this 55gb monster of a King torrent. There are 9 new audiobooks and many fixes in this torrent since the 3.0 release! It is still about 99.99% complete. The only problem is I've still not found a clean copy of the short story &quot;The Mist&quot;. I have presented two versions but they are not clean. Every other recording should be complete and high quality.\n\nI did not intend to put out another full version release so soon, but I got such excellent feedback from Version 3.0 that I was able to FIX and ADD a good number of recordings as can easily be seen in the version history below. Those who have DLed previous versions should be able to seed most of the torrent, but there will be upgraded parts. I hope the many of you will help me seed this with the data you have as my max UL is not stellar. :)\n\nPlease leave any comments, questions, or suggestions you might have as they are HIGHLY APPRECIATED! :)\n\nEnjoy!\n--CL8\n\n\n\n\n-------------Included in this torrent-------------\n1974 - Carrie (read by Sissy Spacek)\n1975 - 'Salem's Lot (read by Ron McLarty)\n1977 - Rage\n1977 - The Shining (read by Campbell Scott)\n1978 - Night Shift (20 short stories)\n1978 - The Stand\n1979 - The Dead Zone (read by Lorelei King)\n1979 - The Long Walk (read by Kirby Heybourne)\n1980 - Firestarter (read by Dennis Boutsikaris)\n1981 - Cujo (read by Lorna Raver)\n1981 - Danse Macabre (Nonfiction - read by William Dufris)\n1981 - Roadwork (read by G. Valmont Thomas)\n1982 - Different Seasons (4 novellas - read by Frank Muller)\n1982 - The Gunslinger (DT1 - revised edition - read by George Guidall)\n1982 - The Running Man (read by Kevin Kenerly)\n1983 - Christine (read by Holter Graham)\n1983 - Cycle of the Werewolf\n1983 - Pet Sematary\n1984 - The Talisman (with Peter Straub - read by Frank Muller)\n1984 - Thinner (read by Joe Mantegna)\n1985 - Skeleton Crew (22 short stories)\n1986 - It (read by Steven Weber)\n1987 - Misery (read by Lindsay Crouse)\n1987 - The Drawing of the Three (DT2 - read by Frank Muller)\n1987 - The Eyes of the Dragon (read by Bronson Pinchot)\n1987 - The Tommyknockers (read by Edward Herrmann)\n1989 - The Dark Half (read by Grover Gardner)\n1990 - Four Past Midnight (4 novellas)\n1990 - The Stand (Complete and Uncut Edition - read by Garrick Hagon)\n1991 - Needful Things (read by Stephen King)\n1991 - The Waste Lands (DT3 - read by Frank Muller)\n1992 - Dolores Claiborne (read by Frances Sternhagen)\n1992 - Gerald's Game (read by Lindsay Crouse)\n1993 - Nightmares &amp; Dreamscapes (24 short stories)\n1994 - Insomnia (read by Eli Wallach)\n1995 - Rose Madder (read by Blair Brown)\n1996 - Desperation (read by Stephen King)\n1996 - The Green Mile (read by Frank Muller)\n1996 - The Regulators (read by Frank Muller)\n1997 - Wizard and Glass (DT4 - read by Frank Muller)\n1998 - Bag of Bones (read by Stephen King)\n1999 - Hearts in Atlantis (read by Stephen King and William Hurt)\n1999 - Storm of the Century\n1999 - The Girl Who Loved Tom Gordon (read by Anne Heche)\n2000 - On Writing (Nonfiction - read by Stephen King)\n2001 - Black House (with Peter Straub - read by Frank Muller)\n2001 - Dreamcatcher (read by Jeffrey DeMunn)\n2002 - Everything's Eventual (14 short stories)\n2002 - From a Buick 8 (read by a Full Cast)\n2003 - Wolves of the Calla (DT5 - read by George Guidall)\n2004 - Faithful (Nonfiction - read by Adam Grupper and Ron McLarty)\n2004 - Song of Susannah (DT6 - read by George Guidall)\n2004 - The Dark Tower (DT7 - read by George Guidall)\n2005 - The Colorado Kid (read by Jeffrey DeMunn)\n2006 - Cell (read by Campbell Scott)\n2006 - Lisey's Story (read by Mare Winningham)\n2007 - Blaze (read by Ron McLarty)\n2008 - Duma Key (read by John Slattery)\n2008 - Just After Sunset (13 short stories)\n2009 - Morality (short story - read by Mare Winningham)\n2009 - Throttle (short story with Joe Hill - read by Stephen Lang)\n2009 - Under the Dome (read by Raul Esparza)\n2009 - UR (novella - read by Holter Graham)\n2010 - Blockade Billy (novella - read by Craig Wasson)\n\nalso 18 alternate audiobook versions:\n1975 - 'Salem's Lot (read by Richard Nazarewich)\n1979 - The Dead Zone (read by Diane Islandburg)\n1979 - The Long Walk (older version)\n1980 - Firestarter (older version)\n1981 - Cujo (older version)\n1981 - Roadwork (older version)\n1982 - Different Seasons (4 novellas - read by Hayward Morse)\n1982 - The Gunslinger (DT1 - original edition - read by Frank Muller)\n1982 - The Gunslinger (DT1 - read by Stephen King)\n1982 - The Running Man (older version)\n1983 - Christine (older version)\n1986 - It (older version)\n1987 - The Drawing of the Three (DT2 - read by Stephen King)\n1987 - The Eyes of the Dragon (old crappy version)\n1987 - The Tommyknockers (older version)\n1989 - The Dark Half (older version)\n1990 - The Stand (Complete and Uncut Edition - read by Bruce Huntey)\n1991 - The Waste Lands (DT3 - read by Stephen King)\n\nand the FULL ILLUSTRATIONS from the Dark Tower books\nPLUS my new (nearly complete) Steve King eBook Collection\n","torrent":{"xt":"urn:btih:d2badd18f36508800a48abac254ff83ba6a77bdd","amp;dn":"The+Stephen+King+Audiobook+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2badd18f36508800a48abac254ff83ba6a77bdd","infoHashBuffer":{"type":"Buffer","data":[210,186,221,24,243,101,8,128,10,72,171,172,37,79,248,59,166,167,123,221]},"announce":[],"urlList":[]}}