{"title":"A Devil's Chaplain: Essays - Richard Dawkins AZW3 EPUB MOBI","uid":13690212,"size":1804489,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d43bfc6aa320c009b4e12569e2db8646e9102380&amp;dn=A+Devil%27s+Chaplain%3A+Essays+-+Richard+Dawkins+AZW3+EPUB+MOBI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FreddyFroggy1","files":5,"time":1456603517,"description":"A Devil's Chaplain: Selected Essays — Richard Dawkins Formats: AZW3, EPUB, MOBI. Published in 2003\r\n\r\nNon-fiction. Tags: Biology, Evolution, Mathematics, Religion, Science\r\nisbn:9780297865421\r\n\r\nThis a cleaner version than many out there and includes fully linked footnotes/endnotes and back-of-book index.\r\n\rReview\r\n=================\r\nRichard Dawkins has an opinion on everything biological, it seems, and in A Devil's Chaplain, everything is biological. Dawkins weighs in on topics as diverse as ape rights, jury trials, religion, and education, all examined through the lens of natural selection and evolution. Although many of these essays have been published elsewhere, this book is something of a greatest-hits compilation, reprinting many of Dawkins' most famous recent compositions. They are well worth re-reading. \r\n\r\nHis 1998 review of Alan Sokal and Jean Bricmont's Fashionable Nonsense is as bracing an indictment of academic obscurantism as the book it covered, although the review reveals some of Dawkins' personal biases as well. Several essays are devoted to skillfully debunking religion and mysticism, and these are likely to raise the hackles of even casual believers.\r\n\r\nScience, and more specifically evolutionary science, underlies each essay, giving readers a glimpse into the last several years' debates about the minutiae of natural selection. In one moving piece, Dawkins reflects on his late rival Stephen Jay Gould's magnum opus, The Structure of Evolutionary Theory, and clarifies what it was the two Darwinist heavyweights actually disagreed about. \r\n\r\nWhile the collection showcases Dawkins' brilliance and intellectual sparkle, it brings up as many questions as it answers. As an ever-ardent champion of science, honest discourse, and rational debate, Dawkins will obviously relish the challenge of answering them. \r\n\r\nFrom Publishers Weekly\r\n======================\r\nOxford don Dawkins is familiar to readers with any interest in evolution. While the late Stephen Jay Gould was alive, he and Dawkins were friendly antagonists on the question of whether evolution &quot;progresses&quot; (Gould: No, Dawkins: Yes, depending on your definition of &quot;progress&quot;). Dawkins's The Selfish Gene has been very influential, not least for his introduction of the &quot;meme,&quot; sort of a Lamarckian culturally inherited trait. \r\n\r\nIn this, his first collection of essays, Dawkins muses on a wide spectrum of topics: why the jury system isn't the best way to determine innocence or guilt; the vindication of Darwinism (or what he insists is properly called neo-Darwinism) in the past quarter-century; the fallacy in thinking that individual genes, for instance a &quot;gay gene,&quot; can be directly linked to personality traits; what he sees as the dangers of giving opponents the benefit of the doubt just because they wrap their arguments in religious belief; several sympathetic pieces on Gould; and a final section on why we all can be said to be &quot;out of Africa.&quot; \r\n\r\nFans of Dawkins's earlier books should snap up this collection. Readers new to him may find that the short format (many of these essays were originally forewords to books, book reviews or magazine pieces) doesn't quite do his reputation justice. Dawkins will antagonize some readers by his attacks on religion: his tone in these essays may fall just short of intellectual arrogance, but he certainly exhibits an intellectual impatience not always beneficial to his argument. Still, Dawkins's enthusiasm for the diversity of life on this planet should prove contagious","torrent":{"xt":"urn:btih:d43bfc6aa320c009b4e12569e2db8646e9102380","amp;dn":"A+Devil%27s+Chaplain%3A+Essays+-+Richard+Dawkins+AZW3+EPUB+MOBI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d43bfc6aa320c009b4e12569e2db8646e9102380","infoHashBuffer":{"type":"Buffer","data":[212,59,252,106,163,32,192,9,180,225,37,105,226,219,134,70,233,16,35,128]},"announce":[],"urlList":[]}}