{"title":"Inventions (2014) [FLAC]","uid":9889644,"size":250828043,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d4e853469f8c6006106cf40285f9cfa4320b68d0&amp;dn=Inventions+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1396626929,"description":"\n  Inventions (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Post-Rock, Ambient, Electronic\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 800 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Echo Tropism\n  02 Flood Poems\n  03 Entity\n  04 Luminous Insects\n  05 Peaceable Child\n  06 Sun Locations,Sun Coda\n  07 Recipient\n  08 Psychic Automation\n\n  On their own, Eluvium mastermind Matthew Cooper and Explosions in the Sky guitarist Mark T. Smith have explored similar sonic territories in very different ways. Where Eluvium explore the subtlety of gentle soundscapes and textural ambience, EITS favor grandeur, with overwhelming crescendos of emotion breaking through the loneliness of their songs' wide-open spaces. Teaming up as Inventions, the duo create a new identity for themselves on their eponymous debut for Temporary Residence. Not so much merging their individual sounds as finding a middle ground between them, the pair craft a series of melancholic musical plateaus, with each feeling more like a specific moment in time than a rising and falling composition. Rather than fill the song with dynamic builds and cathartic releases, Inventions work in pulses of intensity, capturing a moment and holding on to it like a firefly caught in a jar. In creating these musical still lifes, Inventions have hit on a sound that's more about mesmerism than movement. The real magic, however, is that they've somehow managed to pull this off without making the album powerfully dull. By giving us songs that feel like the middle of something, Inventions leave room for the listener to add their own beginning and ending to the musical narrative, allowing the listener to burrow into the layers of melody to carve out their own safe little space. While the pedigree of this project is certainly strong, Inventions stands strong on its own, so although fans of Eluvium and Explosions in the Sky won't have any trouble digging into the album, being a fan of the duo's previous work isn't a part of the price of admission.","torrent":{"xt":"urn:btih:d4e853469f8c6006106cf40285f9cfa4320b68d0","amp;dn":"Inventions+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4e853469f8c6006106cf40285f9cfa4320b68d0","infoHashBuffer":{"type":"Buffer","data":[212,232,83,70,159,140,96,6,16,108,244,2,133,249,207,164,50,11,104,208]},"announce":[],"urlList":[]}}