{"title":"The Metamorphosis of Plants by Johann Wolfgang von Goethe","uid":9626215,"size":736710,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4ed091a3141fd23af610e6f4bbbc1617b7e9367&amp;dn=The+Metamorphosis+of+Plants+by+Johann+Wolfgang+von+Goethe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PirateBook","files":3,"time":1392596553,"description":"\nThe Metamorphosis of Plants, published in 1790, was Goethe's first major attempt to describe what he called in a letter to a friend &quot;the truth about the how of the organism.&quot; Inspired by the diversity of flora he found on a journey to Italy, Goethe sought a unity of form in diverse structures. He came to see in the leaf the germ of a plant's metamorphosis--&quot;the true Proteus who can hide or reveal himself in all vegetal forms&quot;--from the root and stem leaves to the calyx and corolla, to pistil and stamens. \n\nWith this short book--123 numbered paragraphs, in the manner of the great botanist Linnaeus--Goethe aimed to tell the story of botanical forms in process, to present, in effect, a motion picture of the metamorphosis of plants. This MIT Press edition of The Metamorphosis of Plants illustrates Goethe's text (in an English translation by Douglas Miller) with a series of stunning and starkly beautiful color photographs as well as numerous line drawings. \n\nIt is the most completely and colorfully illustrated edition of Goethe's book ever published. It demonstrates vividly Goethe's ideas of transformation and interdependence, as well as the systematic use of imagination in scientific research---which influenced thinkers ranging from Darwin to Thoreau and has much to teach us today about our relationship with nature.\n\nGenre: Science, European Literature","torrent":{"xt":"urn:btih:d4ed091a3141fd23af610e6f4bbbc1617b7e9367","amp;dn":"The+Metamorphosis+of+Plants+by+Johann+Wolfgang+von+Goethe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4ed091a3141fd23af610e6f4bbbc1617b7e9367","infoHashBuffer":{"type":"Buffer","data":[212,237,9,26,49,65,253,35,175,97,14,111,75,187,193,97,123,126,147,103]},"announce":[],"urlList":[]}}