{"title":"Railworks TS2016 DTG DB BR 361 Loco Add-On","uid":13052516,"size":295674280,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d530eb34289e36301b899c8dd66465b0cdd50064&amp;dn=Railworks+TS2016+DTG+DB+BR+361+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TS2015","files":1,"time":1450633560,"description":"The diminutive DB BR 361 packs a punch when it comes to serious pulling power, and is now available for shunting duties on Germany’s rail network in Train Simulator. \r\n\r\nBuilt between 1956 and 1964, the BR 361 (originally classified as V 60) is a diesel locomotive designed for shunting duties and the occasional light goods train for Deutsche Bundesbahn. In total, 942 of these shunters were produced, with several modifications through their lifetime including new engines and remote control operation. \r\n\r\nThe first prototype was designed in 1951 as DB had a shortage of small shunters; four prototypes were built in 1955, each built by a different manufacturer - Krupp, Mak, Henschel and Krauss-Maffei. Each featured different engines too, however they still proved to be successful. DB opted for the Maybach GTO 6/GTO 6A engines for their production models, which started to be delivered in 1956. \r\n\r\nEven in these early stages of the V 60’s life, some models were modified with stronger frames and a higher adhesive weight increase from 48.3 to 53 tons; these heavier shunters were able to haul an extra six tons of ballast compared to the unmodified variant. \r\n\r\nDespite this difference, they were all still classified as V 60s until all of DB’s rolling stock was reclassified, dividing the V 60s into BR 260s and 261s for light and heavy variants respectively. By 1987, they were reclassified again as minor locomotives (Kleinlok), giving them their BR 360/361 grouping as they are known today. \r\n\r\nDespite being built primarily as shunters, the V 60s were also used for transporting light freight and passenger trains, and some even saw some departmental use. A plan to replace the V 60 in the early 1980s never came to fruition, and DB set about improving the 25 year old V 60s instead. \r\n\r\nThe V 60 has a maximum speed of 60km/h (37mph), however the diesel motor needs to be pre-heated before it can run; as a result, the earlier models had to have a small coke oven and carry about 150kg of coke to heat the diesel motor, although newer V 60s used oil burners instead. \r\n\r\nToday, many of the 942 locomotives are still in service, with around 400 in service for DB and other examples for various private railways in Germany and beyond, including Turkey and Norway. \r\n\r\nThe BR 361 for Train Simulator is available in DB Cargo Red livery and features dynamic braking, combination throttle/brake, cab and instrument lighting, in-cab signalling, PZB and SIFA safety systems. Also included are SGGRSS container freight wagons. \r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:d530eb34289e36301b899c8dd66465b0cdd50064","amp;dn":"Railworks+TS2016+DTG+DB+BR+361+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d530eb34289e36301b899c8dd66465b0cdd50064","infoHashBuffer":{"type":"Buffer","data":[213,48,235,52,40,158,54,48,27,137,156,141,214,100,101,176,205,213,0,100]},"announce":[],"urlList":[]}}