{"title":"Lessons in IT Transformation: Technology Expert to Business Lead","uid":8377703,"size":3658563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5fe07e3d5ea093e1ab91aa7cb17ece2100e4ba5&amp;dn=Lessons+in+IT+Transformation%3A+Technology+Expert+to+Business+Lead&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MersaletoPa","files":-1,"time":1366093794,"description":"Larry Bonfante, &quot;Lessons in IT Transformation: Technology Expert to Business Leader&quot;\nEnglish | ISBN: 1118004477 | 2011 | PDF | 224 pages | 3 MB\n\n\nFocusing on the qualities required to transform an organization through the lens of the CIO, this book provides practical advice on how to address key issues, as well as create a context for the type of leadership qualities required to broaden the CIO's impact in every aspect of the corporation.\n\nDownload Now!\nFree register to download UseNet downloader and install, then search \n&quot;Lessons in IT Transformation: Technology Expert to Business Leader&quot; and start downloading. \nYou can DOWNLOAD 300GB for free! \nLessons in IT Transformation: Technology Expert to Business Leader\n\n\n\n\nProvides practical advice on key issues for leadership qualities\nLooks at the differences between leadership and management and the need for effectiveness in both disciplines\nExplores relationship management, communication skills, change management, developing human capital, sustainability, alignment, and qualities of great leaders\n\nA timely look at how the IT function can become totally aligned with the strategies and operational direction of the business enterprise, Lessons in IT Transformation reveals how CIOs can?and should?evolve from managers of utility services to business leaders who can drive revenue, value, and process redesign.","torrent":{"xt":"urn:btih:d5fe07e3d5ea093e1ab91aa7cb17ece2100e4ba5","amp;dn":"Lessons+in+IT+Transformation%3A+Technology+Expert+to+Business+Lead","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5fe07e3d5ea093e1ab91aa7cb17ece2100e4ba5","infoHashBuffer":{"type":"Buffer","data":[213,254,7,227,213,234,9,62,26,185,26,167,203,23,236,226,16,14,75,165]},"announce":[],"urlList":[]}}