{"title":"Advanced SystemCare Ultimate 8.2.0.865 + Serial Patch","uid":12798565,"size":78104662,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d64df929a9ed0374c3be93da0fcbd0500d848e37&amp;dn=Advanced+SystemCare+Ultimate+8.2.0.865+%2B+Serial+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubberboy37","files":1,"time":1448015119,"description":"Advanced SystemCAare Ultimate  incorporates top Anti-Virus capabilities, as well as the already proven comprehensive PC Tune-Up ability. It has One-Click approach to help protect, repair, clean and optimize your PC. Based on #1 ranked BitDefender Anti-Virus technology and the IObit Anti-Malware engine, it is a part of IObit Anti-Virus project dedicating to provide more and better value-added services with the IObit users. With it's Real-Time Protection against viruses, spyware and phishing attacks, powerful tuning-up and cleaning functionality, Advanced SystemCare Ultimate provides always-on, automated and all-in-one protection against all kinds of security threats, system slow down, freeze and crash. It ensures PC security and maintains maximum computer performance automatically without sloweing down your system.\r\n\r\n\r\nChangelog (2015-11-19):\r\n\r\n- Expanded database to remove more latest threats\r\n\r\n\r\n- New IObit Uninstaller 5.1 for more secure and thorough uninstallation\r\n\r\n\r\n- Added option to show system boot time on start in Startup Manager\r\n\r\n\r\n- Default Program Tool added support for Microsoft Edger, Reader (Win8), Windows Photo View (Win8), Xbox Music (Win8), Photo's (Win8), Coral PaintShop Pro, MediaMonkey, Ashampoo Photo, Sumatra PDF, Nitro Reader 3, Nitro Pro 9, Pegasus Mail, The Bat and Becky\r\n\r\n\r\n- Enhanced the privacy cleaning for Chrome 46.0, Firefox 42.0, Opera 33.0, Comodo IceDragon 40.1, Auslogics Disk Defrag 6.0, Adobe Air 18.0, Thunterbird 38.1, VLC Media Player 2.1.5 Rincewind, and many more\r\n\r\n\r\n- Expanded database for Spyware Removal, Registry Fix, Software Updater, Startup Manager, Surfing Protection, Privacy Sweet and Junk Files Cleaner\r\n\r\n\r\n- Updated multiple languages\r\n\r\n\r\n- Fixed bugs in previous version\r\n\r\n\r\nRelease date: 2015-11-19\r\nOS: Windows XP/Vista/7/8/8.1/10\r\nLanguage: Multilingual","torrent":{"xt":"urn:btih:d64df929a9ed0374c3be93da0fcbd0500d848e37","amp;dn":"Advanced+SystemCare+Ultimate+8.2.0.865+%2B+Serial+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d64df929a9ed0374c3be93da0fcbd0500d848e37","infoHashBuffer":{"type":"Buffer","data":[214,77,249,41,169,237,3,116,195,190,147,218,15,203,208,80,13,132,142,55]},"announce":[],"urlList":[]}}