{"title":"The Perfection of the Paper Clip - James Ward.epub","uid":12939878,"size":4852718,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d86a32e03b24db5c32df820aead34055d18c64be&amp;dn=The+Perfection+of+the+Paper+Clip+-+James+Ward.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":1,"time":1449619745,"description":"The Perfection of the Paper Clip: Curious Tales of Invention, Accidental Genius, and Stationery Obsession - James Ward\r\n\r\n\r\nThis wonderfully quirky book will change the way you look at your desk forever with stories of accidental genius, bitter rivalries, and an appreciation for everyday objects, like the humble but perfectly designed paper clip and the utilitarian, irreplaceable pencil.\r\n\r\nHow many of humanity’s brightest ideas started out on a scrap of paper, a Post-It, or in the margins of a notebook? In a delightfully witty and fresh voice, James Ward—cofounder of the Boring Conference and collector of the arcane—explores the secret histories of deskbound supplies, from pencils to fluorescent ink, and the gleaming reams of white paper we all take for granted, encouraging a deeper appreciation and fascination for the things that surround us each day.\r\n\r\nIn the spirit of The Evolution of Useful Things and A History of the World in 100 Objects, Ward transforms the mundane into stories of invention, discovery, and even awe. The Perfection of the Paper Clip is a fascinating tour of the objects that touch our daily lives, filled with charming drawings, illuminating stories, and winning humor that will satisfy curious minds and armchair inventors","torrent":{"xt":"urn:btih:d86a32e03b24db5c32df820aead34055d18c64be","amp;dn":"The+Perfection+of+the+Paper+Clip+-+James+Ward.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d86a32e03b24db5c32df820aead34055d18c64be","infoHashBuffer":{"type":"Buffer","data":[216,106,50,224,59,36,219,92,50,223,130,10,234,211,64,85,209,140,100,190]},"announce":[],"urlList":[]}}