{"title":"WinRAR 5.30 Final(x86-x64) Pre-Activated 100% Clean Install","uid":12834662,"size":3736537,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d8879894389b6a820b81d2833daa168311f81567&amp;dn=WinRAR+5.30+Final%28x86-x64%29+Pre-Activated+100%25+Clean+Install&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"creative3","files":2,"time":1448433649,"description":"Release Date: 24th November 2015\r\nLanguage: English US\r\nType: Compression Archive\r\nLicense: Pre-Activated\r\n\r\nWinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format.\r\n\r\n\r\n   WinRAR 5.30 - What's new in the latest version\r\n\r\n\r\n   Version 5.30\r\n\r\n   1. Information about the critical vulnerability in WinRAR self-extracting\r\n      archives published in news in September and October 2015 is incorrect.\r\n      Unfortunately mass media failed to recognize that what was described\r\n      as WinRAR vulnerability is Windows OLE vulnerability patched\r\n      in November 2014:\r\n\r\n      https://technet.microsoft.com/en-us/library/security/ms14-064.aspx\r\n\r\n      Even if unpatched, this Windows OLE vulnerability does not introduce\r\n      new risk factors for WinRAR SFX archives.\r\n\r\n      Please read http://rarlab.com/vuln_sfx_html2.htm for more details.\r\n\r\n      No patches for WinRAR are needed.\r\n\r\n   2. Added extraction of multipart ZIP archives created by 7-Zip.\r\n      Such archives have .zip.001, .zip.002, ... file extensions.\r\n      You need to open .zip.001 file in WinRAR shell to browse \r\n      or unpack such archive. All parts must be stored in the same folder\r\n      before starting extraction.\r\n\r\n   3. Added extraction of files split to multiple parts with .001,\r\n      .002, ..., extensions. You can open .001 file as a usual archive\r\n      and then unpack its contents. WinRAR will combine all parts\r\n      and save them to extracted file. All parts must be stored\r\n      in the same folder before starting extraction.\r\n\r\n      &quot;001&quot; item is included to &quot;Associate WinRAR with&quot; list\r\n      in &quot;Settings/Integration&quot; dialog.\r\n         \r\n   4. WinRAR file list allows to use mouse Back and Forward buttons\r\n      or Alt+Left and Alt+Right keyboard shortcuts to navigate\r\n      in recently visited folders.\r\n\r\n   5. Folder wildcards are allowed in RAR command line in file names to\r\n      archive. For example:\r\n\r\n      rar a backup c:backup2015**\r\n\r\n      will archive all '2015*' folders in c:backup. Use -r switch to search\r\n      for '2015*' also in c:backup subfolders.\r\n\r\n   6. &quot;Extract&quot; button in SFX archive is changed to &quot;Pause&quot; when extraction\r\n      is started, so it is possible to pause SFX extraction and resume it\r\n      later.\r\n\r\n   7. &quot;Skip encrypted&quot; option in &quot;Find files&quot; dialog to silently skip\r\n      encrypted archives while performing search command.\r\n   \r\n   8. Archive test command works for tar.gz, tar.bz2 and tar.xz archives.\r\n      Since TAR format does not provide file data checksums, WinRAR checks\r\n      only validity of GZIP, BZIP2 or XZ container.\r\n   \r\n   9. Adding a new string to WinRAR diagnostic messages window could be\r\n      slow and affect the operation performance in case of thousands\r\n      of errors. Now it works fast regardless of errors number.\r\n\r\n  10. New 'R' object for -sc switch defines encoding of console\r\n      RAR messages sent to redirected files and pipes. For example:\r\n\r\n      rar lb -scur data &gt; list.txt\r\n\r\n      will produce Unicode list.txt with archived file names.\r\n\r\n  11. Sleep time parameter in -ri[:] switch is\r\n      adjusted to lower its impact to RAR performance and especially\r\n      to recovery record related operations. Higher sleep time values\r\n      are needed to reduce the system load to same level as\r\n      in previous versions.\r\n\r\n  12. Console RAR &quot;l&quot; and &quot;v&quot; commands display file time in YYYY-MM-DD\r\n      format.\r\n\r\n  13. When extracting RAR and ZIP archives created in Unix, WinRAR maps\r\n      decomposed Unicode characters to precomposed. Such conversion\r\n      is required for some Unix and OS X archives to correctly unpack\r\n      non-English archived names in Windows. It works for Windows versions\r\n      starting from Windows Vista.\r\n\r\n  14. Modification time is set for all folders created when unpacking\r\n      .7z archives. Previous versions set it only for non-empty folders.\r\n\r\n  15. WinRAR prevents a computer to go to sleep by inactivity timeout\r\n      until current operation, such as archiving, extraction or another\r\n      archive processing, is done.\r\n\r\n  16. Total progress bar is displayed when extracting .arj, .lzh and .cab\r\n      archives (except multivolume archives).\r\n\r\n  17. Progress bar is displayed when deleting files after archiving\r\n      and when clearing &quot;Archive&quot; attribute of archived files.\r\n\r\n  18. &quot;Test&quot; command also verifies contents of NTFS alternate data streams\r\n      in RAR 3.x - 5.x archives. Previously their contents was checked\r\n      only during extraction command.\r\n\r\n  19. SFX module sets sfxstime environment variable, which contains\r\n      the module start time in &quot;YYYY-MM-DD-HH-MM-SS-ms&quot; format.\r\n      You can specify it in Path command if you need to generate a time\r\n      based unique installation path, such as &quot;Path=myapp-%sfxstime%&quot;.\r\n\r\n  20. Bugs fixed:\r\n\r\n      a) console RAR crashed instead of displaying an overwrite prompt\r\n         when attempting to add files to already existing volumes;\r\n\r\n      b) console RAR &quot;lt&quot; command did not display seconds in file timestamp;\r\n\r\n      c) WinRAR failed to decompress .xxe files if they did not include\r\n         &quot;section N of xxencode&quot; string in the body;\r\n\r\n      d) WinRAR could not restore contents of NTFS alternate data stream\r\n         saved with -os switch if it was split between different volumes.\r\n\r\nIt is Pre-Activated, so just install and use it. No need to use any crack, patch or license. Its already activated with lifetime licensed for unlimited Company.\r\nNo virus, No malware. 100% Clean Install","torrent":{"xt":"urn:btih:d8879894389b6a820b81d2833daa168311f81567","amp;dn":"WinRAR+5.30+Final%28x86-x64%29+Pre-Activated+100%25+Clean+Install","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8879894389b6a820b81d2833daa168311f81567","infoHashBuffer":{"type":"Buffer","data":[216,135,152,148,56,155,106,130,11,129,210,131,61,170,22,131,17,248,21,103]},"announce":[],"urlList":[]}}