{"title":"Windows 8 For Dummies by Senzati.epub","uid":7855723,"size":12291628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8e0cb5767a03010e6c3fa2f14f64735fefaefd3&amp;dn=Windows+8+For+Dummies+by+Senzati.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BySenzati","files":-1,"time":1353755822,"description":"Andy Rathbone, &quot;Windows 8 For Dummies&quot; \n\n\nThe bestselling tech book of all time, now updated for Windows 8\n\nMicrosoft Windows is the operating system that runs nearly 90 percent of the world's computers. Windows 8 will offer new interface updates, cloud-based services, and much more. This update of Andy Rathbone's bestselling Windows guide covers all the basics, plus the enhancements unique to Windows 8. Whether you're meeting Windows for the first time or upgrading from an earlier version, this book shows you how to navigate the interface, work with files, browse the Internet, set up e-mail, manage media, and more.\nCombined editions of this book, all by Microsoft MVP Andy Rathbone, have sold more than 15 million copies worldwide, making Windows For Dummies the #1 bestselling technology book of all time\nCovers all the basics of using Windows 8--core desktop components, managing files and folders, saving files, using Windows search, printing, and working in the cloud\nShows how to get online, set up and use e-mail, use the latest version of Internet Explorer, set up security and virus protection, add music to the media player, organize photos, and edit media\nIncludes coverage on using Windows 8's new start screen on both a desktop computer and a touchscreen device\n\nWindows 8 For Dummies has what all Windows newbies need to know as well as complete coverage of the new version's bells and whistles.\n\n\nEnglish | 2012 | 432 pages | EPUB | 12 MB","torrent":{"xt":"urn:btih:d8e0cb5767a03010e6c3fa2f14f64735fefaefd3","amp;dn":"Windows+8+For+Dummies+by+Senzati.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8e0cb5767a03010e6c3fa2f14f64735fefaefd3","infoHashBuffer":{"type":"Buffer","data":[216,224,203,87,103,160,48,16,230,195,250,47,20,246,71,53,254,250,239,211]},"announce":[],"urlList":[]}}