{"title":"Tremors(1990)DVDRip.AC3(ENG)-DROCK","uid":6798438,"size":734936741,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d9e2356e11aad26004d925fa50dd9df102ac5ed5&amp;dn=Tremors%281990%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320557817,"description":"Tremors is actually two movies in one. On its own terms, it's an enjoyable modern sci-fi horror-thriller, with good pacing and a sense of humor; but it's also a loving tribute to such 1950s low-budget desert-based sci-fi-horror films like Them!, It Came From Outer Space, Tarantula, and The Monolith Monsters. Kevin Bacon and Fred Ward are the stars, a pair of small-town handymen living in a small desert community, who stumble upon several difficult-to-explain phenomena, including a couple of people who've died under extremely strange (and, in one instance, very grisly) circumstances. Eventually, they and a handful of their neighbors find the cause: gigantic prehistoric worm-like creatures that streak under the desert the way fish swim through oceans, reaching up and grabbing anything they need for food. Cut off from the outside world, they have to figure out how to get across the desert alive while these creatures -- that are smart as well as fast -- close in on them, stalking them like monster sharks. The film benefits from the presence of special effects that are good enough to pull this all off, keeping the shock value high, and also from a subtly humorous script and performances to match by the entire cast, and director Ron Underwood's breezy pacing of the whole picture. \n\nRipped with Handbrake.\n\nLength: 1 Hour 35 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps\n","torrent":{"xt":"urn:btih:d9e2356e11aad26004d925fa50dd9df102ac5ed5","amp;dn":"Tremors%281990%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e2356e11aad26004d925fa50dd9df102ac5ed5","infoHashBuffer":{"type":"Buffer","data":[217,226,53,110,17,170,210,96,4,217,37,250,80,221,157,241,2,172,94,213]},"announce":[],"urlList":[]}}