{"title":"The Complete Idiot's Guide to Movies, Flicks, and Films","uid":9179239,"size":5442740,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da240ffd1a2eecefca9f7511889564106aa3d184&amp;dn=The+Complete+Idiot%27s+Guide+to+Movies%2C+Flicks%2C+and+Films&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1384206685,"description":"From the Back Cover\nIf you love movies, this entertaining, user-friendly manual offers you a selective guide for finding what you like and for discovering films that are new to you, from 1920s French films to classic Westerns. It covers Hollywoods entire hundred-year history and explains film genre and terminology.\nAbout the Author\nMark Winokur and Bruce Holsinger teach film studies and English at the University of Colorado. Their credits include books and articles on topics from medieval music to monstrosity in Hollywood science fiction-and they are eager to share their love of film with a mainstream audience.\n\nUser Review:\nGreat material to convert a beginner into a filmophile\nBy A Customer on March 6, 2001\nA great introduction to the entire world of film -- not just Hollywood, but a host of world cinemas from European to Latin American to African and Near Eastern. The examples used are well explained and are always pertinent to the points at hand. My favorite chapters were one on film theory (which made obscure concepts accessible to the beginner) and one that used all the concepts introduced in the book to explain the German silent film &quot;Nosferatu.&quot; I had just seen the new movie &quot;Shadow of the Vampire,&quot; which is based on the making of &quot;Nosferatu&quot;; this book made me understand for the first time what a complex piece of art that early movie is. I highly recommend this book as an affordable intro to film criticism that, while accessible and fun to read, does not talk down to its audience.","torrent":{"xt":"urn:btih:da240ffd1a2eecefca9f7511889564106aa3d184","amp;dn":"The+Complete+Idiot%27s+Guide+to+Movies%2C+Flicks%2C+and+Films","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da240ffd1a2eecefca9f7511889564106aa3d184","infoHashBuffer":{"type":"Buffer","data":[218,36,15,253,26,46,236,239,202,159,117,17,136,149,100,16,106,163,209,132]},"announce":[],"urlList":[]}}