{"title":"Unto This Last [mp3] John Ruskin - ScanSoft Daniel","uid":8363111,"size":157001162,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:da8a7b841e335acdd013b2f4b257163d0db30a74&amp;dn=Unto+This+Last+%5Bmp3%5D+John+Ruskin+-+ScanSoft+Daniel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":27,"time":1365690455,"description":"This is the FOUR ESSAYS from the book that the young MK Gandhi saw while in British Law school, redirecting his life almost as much as Tolstoy's &quot;The Kingdom of God is Within you,&quot; also on UnviolentPeacemaker at ThePirateBay.\n\n\nNOTICE: WHY SCREW THE PUBLISHERS, WRITERS, CREATORS?  When you have the $$$, buy this download, preferably from a locally owned store.  &quot;Universal Family&quot; is the ONLY Revolution.  Hypocrisy kills.\n\n\nNOTICE: This book is read by the HQ ELECTRONIC VOICE SCANSOFT DANIEL.  Don't like that?  Don't download it.  Don't complain.  Don't get in the way.\n\n\nThis book from the\n\nLIBRARY OF UNVIOLENT REVOLUTION - AGAPE, UNIVERSAL FAMILY\n\n'UnviolentPeacemaker' on ThePirateBay.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt;\n\nHundreds more like it, in that UnviolentPeacemaker library.\n\n\n\nTHOSE CLUELESS TO THE PLANETARY EMERGENCY OF IMPENDING ECOCIDE SHOULD GO ELSEWHERE.  These uploads were created for me, to equip me to Wage All-out Unviolent War for my current and future 204 billion children.  If you are looking for style over substance this site and these materials are not for you.  THE PRESENT AND FUTURE KIDS ARE SCREAMING AT US TO SAVE THEIR FUTURE, not whether there are typos, hugely rough parts, audio artifacts, pauses, footnote numbers, etc.  HAVE THE DECENCY NOT TO COMPLAIN.\n\n\nALSO, CUT ME SOME SLICK.  THIS UPLOAD WAS PREPARED ON 04.11.13, THIS DAY 14 OF MY 'ECOCIDE'S DEATH FAST, ZERO CALORIES,' RACING TO FINISH THIS PROJECT SO I CAN ABSTAIN FROM LIQUIDS AS WELL BY MIDNIGHHT SUNDAY NIGHT. GOOGLE 'start loving.' Also GOOGLE, 'tracking plan b'  So, I'm working with a 23,400 calorie deficit, and a sleep deficit the last 4 days of near 8 hrs x 4 = 32 hours, so I can get this done, before I am.  (Hmmm, you too are this committed to averting ecocide so out kids and grandkids have a Life, like you and I did, right?)\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?\n\n\n\n\nNote: From this book of essays, only the four essays, &quot;Unto This Last,&quot; that inspired Gandhi, are provided.\n\n\nFrom: http://en.wikipedia.org/wiki/Unto_This_Last\n\n&quot;Unto This Last&quot; had a very important impact on Gandhi's philosophy.[3]  He discovered the book in March 1904 through Henry Polak, whom he had met in a vegetarian restaurant in South Africa. Polak was chief editor of the Johannesburg paper The Critic.  Gandhi decided immediately not only to change his own life according to Ruskin's teaching, but also to publish his own newspaper, Indian Opinion, from a farm where everybody would get the same salary, without distinction of function, \nrace or nationality, which for that time, was quite revolutionary. Thus Gandhi created Phoenix Settlement.  Gandhi translated &quot;Unto This Last&quot; into Gujarati in 1908 under the title of &quot;Sarvodaya&quot; (&quot;well being of all&quot;). Valii Govindji Desai translated it back to English in 1951 under the title of &quot;Unto This \nLast: A Paraphrase&quot;.[4] This last essay can be considered his program on economics, as in &quot;Unto This Last&quot;, Gandhi found an important part of his social and economic ideas.\n\n\nFrom: http://www.mkgandhi.org/articles/inspiration.htm\n\nTolstoy's book 'The Kingdom of God is within you' overwhelmed Gandhi. Ruskin's book 'Unto this Last' had cast a magic spell on Gandhi so much so that he paraphrased the book as Sarvodaya' and decided to teach from it.\n\n\n\n.... it is easy to find more such references.","torrent":{"xt":"urn:btih:da8a7b841e335acdd013b2f4b257163d0db30a74","amp;dn":"Unto+This+Last+%5Bmp3%5D+John+Ruskin+-+ScanSoft+Daniel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da8a7b841e335acdd013b2f4b257163d0db30a74","infoHashBuffer":{"type":"Buffer","data":[218,138,123,132,30,51,90,205,208,19,178,244,178,87,22,61,13,179,10,116]},"announce":[],"urlList":[]}}