{"title":"WebcamMax v7 9 2 6","uid":11980909,"size":27157989,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:db08933a4ceff3027d58d465d92aec2af46b51e2&amp;dn=WebcamMax+v7+9+2+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glaresc","files":1,"time":1433206224,"description":"Stream videos, movies, flash, desktop screen, pictures to virtual webcam; add floating text, frame, transform, emotion effects over real webcam. For all webcam programs (MSN, ICQ, AIM, Skype, Camfrog, Paltalk, Yahoo Messenger and etc). Your chat mate will be attracted by your webcam. More than 1500 effects online. DIY webcam effects. Webcam video recorder. Webcam snap. Share webcam in 16 programs. Fast switch between virtual and real webcam.\n\n\n\n Features:\n\n Thousands of Fantastic Effects: Thousands of cool effects for your live video chats and video recording. You can download limitless effects at webcammax.com.\n Video Recording: Record your fantastic videos show with our cool effects to broadcast on YouTube or Facebook.\n Virtual Webcam: Share your video clips or desktop screen with family and friends through your Instant Messengers even without a real webcam.\n Easy to Share: Directly share your cool videos and photos with family or friends on Facebook. You can also upload and share your videos on Youtube.\n Doodling and PinP: Paint on the video box freely and directly. You can also broadcast different sources at the same time with Picture in Picture feature.\n Work for All: Work for almost all webcam programs such as Windows Live Messenger, Skype, Yahoo Messenger, ICQ, Paltalk, Camfrog, YouTube, Ustream, JustinTV, and much more","torrent":{"xt":"urn:btih:db08933a4ceff3027d58d465d92aec2af46b51e2","amp;dn":"WebcamMax+v7+9+2+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db08933a4ceff3027d58d465d92aec2af46b51e2","infoHashBuffer":{"type":"Buffer","data":[219,8,147,58,76,239,243,2,125,88,212,101,217,42,236,42,244,107,81,226]},"announce":[],"urlList":[]}}