{"title":"Santana-1991-2009","uid":5370723,"size":2831116736,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd21120be9f5beac8102fe1f7cf10a70b46a4228&amp;dn=Santana-1991-2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flitigalisa","files":356,"time":1266414193,"description":" &lt;a href=&quot;http://thepiratebay.se/user/flitigalisa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://thepiratebay.se/user/flitigalisa&lt;/a&gt;\n\nSantana is a band consisting of a flexible number of musicians accompanying Carlos Santana since the late 1960s. The range of these artists has varied greatly. Just like Santana himself, the band is known for helping make Latin rock famous in the rest of the world. They have won a total of 8 Grammy Awards and 3 Latin Grammy Awards which were all awarded in 2000.\nThe band was formed in 1964 in San Francisco as the Santana Blues Band.  The first members were Carlos Santana (lead guitar), Tom Fraser (rhythm guitar), Mike Carabello (percussion), Rod Harper (drums &amp; percussion), Gus Rodriguez (bass guitar) and Gregg Rolie (lead vocals &amp; keyboards). In the following years the members of the group changed frequently for a number of reasons, and from 1971 to 1972 there was a brief separation between the group and Santana.\nSantana himself rarely sings in his songs despite being the leader of the band and recent hits have been frequently accompanied by a guest singer, rather than the members of the band.\nIn 1998, the group was inducted into the Rock &amp; Roll Hall of Fame, with Carlos Santana, Jose Chepito Areas, David Brown, Mike Carabello, Gregg Rolie and Michael Shrieve being honored.\n\n","torrent":{"xt":"urn:btih:dd21120be9f5beac8102fe1f7cf10a70b46a4228","amp;dn":"Santana-1991-2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd21120be9f5beac8102fe1f7cf10a70b46a4228","infoHashBuffer":{"type":"Buffer","data":[221,33,18,11,233,245,190,172,129,2,254,31,124,241,10,112,180,106,66,40]},"announce":[],"urlList":[]}}