{"title":"The Real Housewives of New York City S05E07  RKSTR mp4","uid":7451752,"size":571323819,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dfac5874a2a97308d443e9ac561c379fd7bef080&amp;dn=The+Real+Housewives+of+New+York+City+S05E07++RKSTR+mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"FatFreddy638","files":1,"time":1342533668,"description":"Episode 7: Good Trip, Bad Fall\n&quot;Royal Wars&quot; erupt in London, when Carole attempts to give LuAnn a taste of her own medicine\n\nSonja, Heather, LuAnn, and Carole are finishing up their London trip with a day of fun and games. They head off for a very English game of croquet, but by this point, tension is building between Carole and LuAnn and Heather comments that we may be seeing the &quot;royal wars.&quot; In NYC, with very little time left to prep her anniversary party, Aviva is concerned with Sonja's lack of party planning and brings Ramona to check out the party location. \n\nBack in London, the ladies end the trip with a farewell dinner where Carole tries to give LuAnn a taste of her own medicine by &quot;one-upping&quot; everything that the Countess says. And with that, the ladies bid farewell to London and head back to the States. At the anniversary party, and Sonja in the City's first event, the jury is still out on Sonja's company as her choice of entertainment turns out to be a train wreck. When Aviva and Reid kick things off talking about their love, things literally kick off when Aviva falls down the stairs in front of everyone. Finally, to try and make peace, Heather finds Ramona to talk, but when Ramona avoids Heather, she gets a dose of her own medicine.","torrent":{"xt":"urn:btih:dfac5874a2a97308d443e9ac561c379fd7bef080","amp;dn":"The+Real+Housewives+of+New+York+City+S05E07++RKSTR+mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfac5874a2a97308d443e9ac561c379fd7bef080","infoHashBuffer":{"type":"Buffer","data":[223,172,88,116,162,169,115,8,212,67,233,172,86,28,55,159,215,190,240,128]},"announce":[],"urlList":[]}}