{"title":"Broder Daniel - No time for us 1989-2004  2CD","uid":6756714,"size":961702284,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e0cea5cf634b38c4c81382583a1cb40e9784a1dc&amp;dn=Broder+Daniel+-+No+time+for+us+1989-2004++2CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1319059113,"description":"Broder Daniel (often abbreviated BD) was an alternative rock band from Gothenburg, Sweden. They formed in the late 1980s and then consisted of classmates Henrik Berggren and Daniel Gilbert. The band claims they started playing to gain social respect and it was decided early on that emotional expression would be more important to their sound than musical correctness.\nMusically, they have been inspired by bands such as The Jesus And Mary Chain, Iggy Pop and The Velvet Underground, relying heavily on distorted guitars and simple arrangements. Their lyrics have mostly centered around existential issues and youth angst.\nBroder Daniel was largely regarded as an entitative cornerstone of Swedish alternative music during the 1990s, even though the band has proven to be quite unstable ever since the beginning, with members leaving the band every few years.\n\n- - -\n\nWhile attending GÃƒÂ¶teborgs HÃƒÂ¶gre Samskola in Gothenburg, Henrik Berggren was looking for a way to express himself, and decided that the easiest way would be to form a pop band. The first six years of the band's existence consisted of a number of name changes until the band finally settled on the name Broder Daniel - translating to Brother Daniel. A couple of new members joined and they slowly started to find their sound. Swedish music press soon caught on to the hype of the now notorious band featuring charismatic singer Henrik who in a short time had gained a cult following of maladjusted youth, looking for a leader. Journalists, however, tended to mostly focus on the violent shows and Henrik's make-up and out of tune voice.\n\nMusic label Jimmy Fun Music, owned by Roxette member Per Gessle, picked the band up and promoted them until they signed to EMI Music Sweden. In 1995 the band released their debut album Saturday Night Engine which was characterized by its simple songs with relatively low respect for musical correctness. They soon gained a relatively large following of fans throughout Sweden.\n\nAfter releasing their second album, self-titled Broder Daniel, the band resigned from EMI in 1997 and found themselves without a record deal - something few people in the music industry could understand. While they did not sell many records, the band was indeed a popular act in clubs and on music festivals. One year later they signed to record label Dolores Recordings and released their most critically acclaimed album so far: Broder Daniel Forever. The new record was dark, with a focus on topics of love and death. Its sound was inspired by Psychocandy, the debut album of indie rockers The Jesus and Mary Chain. The popularity of Forever soon took off, and the band reached a larger audience than ever before in their career, much thanks to the inclusion of three Broder Daniel-songs on the soundtrack for the movie Show Me Love which was one of the most popular films in Sweden in the 1990s.\n\nFollowing the release of Forever, the band embarked on a controversial tour across Sweden, which the band later ended prematurely. A few shows were played in England as an attempt to sign a record deal for international release of their albums. That, however, didn't succeed. After the tour, the members parted ways to recover and did not maintain any contact with each other in the year that followed. In 2001, bass player HÃƒÂ¥kan HellstrÃƒÂ¶m released a solo record which hit big and soon after that he left the band, since the other members didn't think his reputation as a spreader of joy would reflect well on the band. Guitar player Theodor Jensen also released a celebrated record with his band The Plan.\n\nFive years after the release of Forever, the band once again got together to record their new album Cruel Town which was released in 2003. This time around they had a clear focus on the lyrics which were now more complex and less repetitive than before. This album showed a matured Broder Daniel, with themes based around society and nostalgia. Berggren was now singing about the cold society which had made him the person he is today, while looking back at his childhood.\n\nSince the Cruel Town tour, the band has performed only a few times together. Singer Henrik Berggren has performed several acoustic solo sets playing Broder Daniel-songs.\n\nOn 30 of March, 2008, guitarist Anders GÃƒÂ¶thberg committed suicide in Stockholm.\n\nThe band played together for the last time at Way Out West Festival in Gothenburg in honour of the late Anders GÃƒÂ¶thberg. During the concert they played their newly written song Hold On to Your Dreams, dedicated to GÃƒÂ¶thberg.\n\n- - - \n\nUnder bÃƒÂ¶rjan av 2005 slÃƒÂ¤pptes Broder Daniels samlingsplatta No Time For Us (1989-2004). FrÃƒÂ¥n bÃƒÂ¶rjan var Henrik Berggren emot att slÃƒÂ¤ppa en samlingsskiva men gick med pÃƒÂ¥ det eftersom man kom pÃƒÂ¥ iden att slÃƒÂ¤ppa ett dubbelalbum dÃƒÂ¤r den fÃƒÂ¶rst skivan innehÃƒÂ¥ller alla hits och den andra skivan innehÃƒÂ¥ller demoversioner av mÃƒÂ¥nga av Broder Daniels lÃƒÂ¥tar. (wikipedia)\n\n\n\nBroder Daniel - No time for us 1989-2004\n(2CD GÃƒÂ¶teborg Dolores/Virgin 2005)\n\n 1. Luke Skywalker \n 2. Iceage \n 3. Work (oklippt version) \n 4. Underground \n 5. ABC 123 \n 6. Go my own way  \n 7. I'll be gone \n 8. You bury me  \n 9. Whirlwind \n10. Happy people never fantasize \n11. Dream my days away  \n12. When we were winning  \n13. Cruel town  \n14. Shoreline \n15. Army of dreamers \n16. What clowns are we  \n17. When we were winning (long version) \n18. Son of S:t Jacobs  (demo -89)\n19. Luke Skywalker  (demo -93)\n20. Cadillac  (demo -93)\n21. Lovesick (demo -93)\n22. Sitting out in the cold  (demo -93)\n23. Kids are alright (porta demo 940418)\n24. Lost in love (porta demo 940418)\n25. Come on you people (porta demo 940418)\n26. You're my Valentine (porta demo 940509)\n27. Disease inside (porta demo 940509)\n28. Lemon (T&amp;A demo -96)\n29. On my own  (T&amp;A demo -96)\n30. Love doesn't last  (demo -97)\n31. I'll be gone (demo -97)\n32. Whirlwind (demo -97)\n33. Old in just one day  (demo -97)\n34. Shoreline (demo -01)\n35. No time for us (akustisk)\n","torrent":{"xt":"urn:btih:e0cea5cf634b38c4c81382583a1cb40e9784a1dc","amp;dn":"Broder+Daniel+-+No+time+for+us+1989-2004++2CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0cea5cf634b38c4c81382583a1cb40e9784a1dc","infoHashBuffer":{"type":"Buffer","data":[224,206,165,207,99,75,56,196,200,19,130,88,58,28,180,14,151,132,161,220]},"announce":[],"urlList":[]}}