{"title":"MOTOGP 2013 EngAudio PerfectRip GLOBE","uid":8599659,"size":2136131192,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1835950a8cef518439d1d33016900f93d5e34e5&amp;dn=MOTOGP+2013+EngAudio+PerfectRip+GLOBE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"globeplus","files":-1,"time":1371852516,"description":"Hi games fans and play the new MOTOGP game ...\n\nFILE INFO : Ripped only audio languages and the videos was correctly worked and tested inside the game\n\n\nFeatures :\n\nMotoGP 13 features all the tracks, riders and teams from the 2013 MotoGP, Moto 2 and Moto 3 world championships. MotoGP13 features 4 single player game modes: Grand Prix, World Championship, Career and Time attack. Grand Prix is a standard mode where the player picks a class, team and rider along with the track and weather conditions. This game mode takes the player across a single Grand Prix weekend including practice, qualifying and the race. World Championship mode allows the player to ride a full or custom season in either MotoGP, Moto 2 or Moto 3. Career mode is the main single player mode and incorporates first and third person elements. Upon a few wildcard events, the player will earn a ride in Moto 3 and begin their career. From here the player rides through multiple seasons, earning new rides with the aim of ultimately becoming Moto GP world champion. Career mode boasts many new features to MotoGP video games. These include Parc Ferme, motorhomes and a walkable garage. The career mode is also expanded with objectives given from your own Personnel Manager. Time Attack allows the player to race themselves endlessly against the clock. Multiplayer features online game modes as well as split screen multiplayer. MotoGP13 features a revolutionary physics engine containing over 300 parameters. Multiple physics settings and aids allow for beginners as well as the experienced to have an immersive experience. A brand new weather systems also fetaures in MotoGP13. The player can select from 5 weather options one of which is dynamic where the race could start in dry conditions and then begin to rain during the race. MotoGP13 has been developed to bring players the most immersive MotoGP features and as a results the game features in game commentary from Moto GP international commentator Gavin Emmett, a real life based HUD and a brand new helmet cam similar to the one seen in Shift 2: Unleashed. Other features like these include press conferences, news articles based on the players performances and the ability to talk tactics with teammates. The game is also set to have real in game events based on real races being added constantly.A demo of the game will be released in early June and players will be able to choose either Valentino Rossi or Marc Marquez and race 3 laps at Circuit de Catalunya.\n\n\n* enjoy ...","torrent":{"xt":"urn:btih:e1835950a8cef518439d1d33016900f93d5e34e5","amp;dn":"MOTOGP+2013+EngAudio+PerfectRip+GLOBE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1835950a8cef518439d1d33016900f93d5e34e5","infoHashBuffer":{"type":"Buffer","data":[225,131,89,80,168,206,245,24,67,157,29,51,1,105,0,249,61,94,52,229]},"announce":[],"urlList":[]}}