{"title":"Fundamentals of Liquid Crystal Devices, 2nd Edition [2014]","uid":11962730,"size":7064936,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e23e479a581bd0973ece5607316baab9208adc1f&amp;dn=Fundamentals+of+Liquid+Crystal+Devices%2C+2nd+Edition+%5B2014%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoctDeath","files":2,"time":1432591581,"description":"Title: Fundamentals of Liquid Crystal Devices\nSeries: Wiley Series in Display Technology\nAuthor: Deng-Ke Yang, Shin-Tson Wu\nFormat: PDF\nHardcover: 592 pages\nPublisher: Wiley; 2 edition (December 3, 2014)\nLanguage: English\nISBN: 9781118752005\n\nLiquid Crystal Devices are crucial and ubiquitous components of an ever-increasing number of technologies. They are used in everything from cellular phones, eBook readers, GPS devices, computer monitors and automotive displays to projectors and TVs, to name but a few. This second edition continues to serve as an introductory guide to the fundamental properties of liquid crystals and their technical application, while explicating the recent advancements within LCD technology. This edition includes important new chapters on blue-phase display technology, advancements in LCD research significantly contributed to by the authors themselves.\n\nThis title is of particular interest to engineers and researchers involved in display technology and graduate students involved in display technology research.\n\nKey features:\n\n- Updated throughout to reflect the latest technical state-of-the-art in LCD research and development, including new chapters and material on topics such as the properties of blue-phase liquid crystal displays and 3D liquid crystal displays;\n- Explains the link between the fundamental scientific principles behind liquid crystal technology and their application to photonic devices and displays, providing a thorough understanding of the physics, optics, electro-optics and material aspects of Liquid Crystal Devices;\n- Revised material reflecting developments in LCD technology, including updates on optical modelling methods, transmissive LCDs and tunable liquid crystal photonic devices;\n- Chapters conclude with detailed homework problems to further cement an understanding of the topic","torrent":{"xt":"urn:btih:e23e479a581bd0973ece5607316baab9208adc1f","amp;dn":"Fundamentals+of+Liquid+Crystal+Devices%2C+2nd+Edition+%5B2014%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e23e479a581bd0973ece5607316baab9208adc1f","infoHashBuffer":{"type":"Buffer","data":[226,62,71,154,88,27,208,151,62,206,86,7,49,107,170,185,32,138,220,31]},"announce":[],"urlList":[]}}