{"title":"21(2008)DVDRip.AC3(ENG)-DROCK","uid":6012261,"size":733265920,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e27a90aab73449651a240c6cba3c3f5e233e7a53&amp;dn=21%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1291503425,"description":"Director Robert Luketic adapts Ben Mezrich\\'s best-seller Bringing Down the House: The Inside Story of Six M.I.T. Students Who Took Vegas for Millions to tell the true-life tale of six genius students who used their brains to beat considerable odds. Ben Campbell (Jim Sturgess) may be shy, but his wallflower reputation betrays his inner brilliance. As smart as Ben may be, however, if he can\\'t pay his tuition he\\'ll be kicked out of M.I.T. Fortunately, the answer to all of Ben\\'s problems is right there in the cards. Recruited to join a team of extremely gifted students who have used their mastery of numbers to beat the odds at blackjack, Ben procures a fake identity in order to join the casino scammers and their brilliant leader -- eccentric math professor and stats genius Micky Rosa (Kevin Spacey) -- in some highly profitable weekend excursions to Las Vegas. Counting cards isn\\'t illegal, and by using a complex series of signals, this team has cracked the code. Of course, it doesn\\'t take long for Ben to become seduced by the glamorous Las Vegas lifestyle, and the attention afforded to him by his sexy teammate Jill Taylor (Kate Bosworth) finds him pushing his luck to the absolute limits. Laurence Fishburne stars as Cole Williams, the Sin City security chief who catches on to the group and makes it his mission to expose their lucrative blackjack scam. \n\nRipped with DVD Decrypter and Autogk.","torrent":{"xt":"urn:btih:e27a90aab73449651a240c6cba3c3f5e233e7a53","amp;dn":"21%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e27a90aab73449651a240c6cba3c3f5e233e7a53","infoHashBuffer":{"type":"Buffer","data":[226,122,144,170,183,52,73,101,26,36,12,108,186,60,63,94,35,62,122,83]},"announce":[],"urlList":[]}}