{"title":"Sharyn   McCrumb-She Walks These Hills","uid":9930093,"size":274860532,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e3ed8b0dadde7b685fc0d3fde12d8bb0e093e61a&amp;dn=Sharyn+++McCrumb-She+Walks+These+Hills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"twocows","files":24,"time":1397097746,"description":"Historian Jeremy Cobb is backpacking on the Appalachian Trail, attempting to retrace the tragic journey of eighteen-year-old Katie Wyler, who was captured by the Shawnee after the massacre of her pioneer family in Mitchell County, North Carolina. In late summer, Katie escaped from a Shawnee village on the banks of the Ohio, and followed the rivers through the wilderness to find her way home - a brave journey that ended in sorrow.\nJeremy, a city-bred graduate student with no trail experience, is determined to complete his scholarly quest, unaware that his journey will be both a trial of hardships and a mystical experience. He does not know that the spirit of Katie Wyler is still seen wandering the hills, trying to get home. Mountain wise woman Nora Bonesteel sees her every autumn &quot;when the air is crisp and the light is slanted and the birds are still.&quot;\nHiram Sorley, known as Harm, is also at large in the Appalachian wilderness. Sorely, who has escaped from the Northeast Correctional Center in Mountain City, Tennessee, is the focus of a wide-spread manhunt involving","torrent":{"xt":"urn:btih:e3ed8b0dadde7b685fc0d3fde12d8bb0e093e61a","amp;dn":"Sharyn+++McCrumb-She+Walks+These+Hills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3ed8b0dadde7b685fc0d3fde12d8bb0e093e61a","infoHashBuffer":{"type":"Buffer","data":[227,237,139,13,173,222,123,104,95,192,211,253,225,45,139,176,224,147,230,26]},"announce":[],"urlList":[]}}