{"title":"Hank Locklin - Please Help Me I'm Falling - 1955-1964","uid":6435181,"size":507377575,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e3fc0422ea9a55811909d3e5d8c7a2d11f8dec5d&amp;dn=Hank+Locklin+-+Please+Help+Me+I%5C%27m+Falling+-+1955-1964&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bonnie335","files":132,"time":1306786445,"description":"Bear Family Records. Release:1995. Remastered. VBR 220'. Incl. Covers.\n\n\nPlease Help Me I'm Falling is a four-disc box set containing every recording Hank Locklin made between 1955 and 1964. It traces his evolution from a hillbilly balladeer to a smooth country-pop crooner, although Lockin's performance style, and the kinds of songs he sang, didn't change dramatically. The instrumentation, however, changed in a big way thanks to the rise of the Nashville sound; sweet vocal choruses appeared around 1957, and then strings and muted horns began to dominate arrangements that sometimes sounded more like Guy Lombardo than any antecedent in country music. Locklin has such a pure country tenor, though, that he sounds plenty &quot;country&quot; in any context. Despite the preponderance of country-pop ballads and international material (which includes lots of Irish, Hawaiian, and faux-ethnic material of the &quot;Filipino Baby&quot; variety), Locklin occasionally returned to hillbilly themes as on his 1962 hit &quot;We're Gonna Go Fishin'&quot; (although even that incorporates a rock &amp; roll saxophone). The set takes its name from Locklin's 1960 hit that held the number one spot for months and became one of the decade's biggest hits. Typical for the Bear Family label, the box set is packaged in an LP-sized box with a book full of biographical and discographical information, and many photos. In tandem with Send Me the Pillow That You Dream On, Bear Family's box set of Locklin's early 4-Star sides, Please Help Me I'm Falling rounds up Locklin's complete recordings from the most commercially and artistically vital stage of his career. ","torrent":{"xt":"urn:btih:e3fc0422ea9a55811909d3e5d8c7a2d11f8dec5d","amp;dn":"Hank+Locklin+-+Please+Help+Me+I%5C%27m+Falling+-+1955-1964","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3fc0422ea9a55811909d3e5d8c7a2d11f8dec5d","infoHashBuffer":{"type":"Buffer","data":[227,252,4,34,234,154,85,129,25,9,211,229,216,199,162,209,31,141,236,93]},"announce":[],"urlList":[]}}