{"title":"Acrylamide in Food - Analysis, Content and Potential Health Effe","uid":14518379,"size":18698209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4a997f93592b975c33d4145ec76074366a6d40a&amp;dn=Acrylamide+in+Food+-+Analysis%2C+Content+and+Potential+Health+Effe&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462353105,"description":"Acrylamide in Food - Analysis, Content and Potential Health Effects - Vural Gökmen (AP, 2016).pdf\r\n\r\nISBN 9780128028322\r\n\r\nAcrylamide in Food: Analysis, Content and Potential Health Effects provides the recent analytical methodologies for acrylamide detection, up-to-date information about its occurrence in various foods (such as bakery products, fried potato products, coffee, battered products, water, table olives etc.), and its interaction mechanisms and health effects.\r\n\r\nThe book is designed for food scientists, technologists, toxicologists, and food industry workers, providing an invaluable industrial reference book that is also ideal for academic libraries that cover the domains of food production or food science.\r\n\r\nAs the World Health Organization has declared that acrylamide represents a potential health risk, there has been, in recent years, an increase in material on the formation and presence of acrylamide in different foods. This book compiles and synthesizes that information in a single source, thus enabling those in one discipline to become familiar with the concepts and applications in other disciplines of food science.\r\n\r\nProvides latest information on acrylamide in various foods (bakery products, fried potato products, coffee, battered products, water, table olives, etc.)\r\nExplores acrylamide in the food chain in the context of harm, such as acrylamide and cancer, neuropathology of acrylamide, maternal acrylamide and effects on offspring and its toxic effects in tissues\r\nTouches on a variety of subjects, including acrylamide, high heated foods, dietary acrylamide, acrylamide formation, N-acetyl-S-(2-carbamoylethyl)-cysteine (AAMA), acrylamide removal, L-asparaginase, and acrylamide determination\r\nPresents recent analytical methodologies for acrylamide determination, including liquid chromatographic tandem mass spectrometry and gas chromatography-mass spectrometry","torrent":{"xt":"urn:btih:e4a997f93592b975c33d4145ec76074366a6d40a","amp;dn":"Acrylamide+in+Food+-+Analysis%2C+Content+and+Potential+Health+Effe","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a997f93592b975c33d4145ec76074366a6d40a","infoHashBuffer":{"type":"Buffer","data":[228,169,151,249,53,146,185,117,195,61,65,69,236,118,7,67,102,166,212,10]},"announce":[],"urlList":[]}}