{"title":"Britain's War Machine {BBS}","uid":6831466,"size":5702639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e4d698e72eafe7acdc327f2d9e9eb6272870b3e7&amp;dn=Britain%5C%27s+War+Machine+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321886201,"description":"The familiar image of the British in the Second World War is that of the plucky underdog taking on German might. David Edgerton's bold, compelling new history shows the conflict in a new light, with Britain as a very wealthy country, formidable in arms, ruthless in pursuit of its interests, and in command of a global production system. Rather than belittled by a Nazi behemoth, Britain arguably had the world's most advanced mechanized forces. It had not only a great empire, but allies large and small.\n\nEdgerton shows that Britain fought on many fronts and its many home fronts kept it exceptionally well supplied with weapons, food and oil, allowing it to mobilize to an extraordinary extent. It created and deployed a vast empire of machines, from the humble tramp steamer to the battleship, from the rifle to the tank, made in colossal factories the world over. Scientists and engineers invented new weapons, encouraged by a government and prime minister enthusiastic about the latest technologies. The British, indeed Churchillian, vision of war and modernity was challenged by repeated defeat at the hands of less well-equipped enemies. Yet the end result was a vindication of this vision. Like the United States, a powerful Britain won a cheap victory, while others paid a great price.\n\nPutting resources, machines and experts at the heart of a global rather than merely imperial story, Britain's War Machine demolishes timeworn myths about wartime Britain and gives us a groundbreaking and often unsettling picture of a great power in action.\n\n\n# Hardcover: 464 pages\n# Publisher: Oxford University Press, USA (September 9, 2011)\n# Language: English\n# ISBN-10: 0199832676\n# ISBN-13: 978-0199832675","torrent":{"xt":"urn:btih:e4d698e72eafe7acdc327f2d9e9eb6272870b3e7","amp;dn":"Britain%5C%27s+War+Machine+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4d698e72eafe7acdc327f2d9e9eb6272870b3e7","infoHashBuffer":{"type":"Buffer","data":[228,214,152,231,46,175,231,172,220,50,127,45,158,158,182,39,40,112,179,231]},"announce":[],"urlList":[]}}