{"title":"1993 - Doctor Who, Dimensions in Time","uid":9217894,"size":112320313,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e50e80c740985954ca999842813e988588103355&amp;dn=1993+-+Doctor+Who%2C+Dimensions+in+Time&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bnaron","files":2,"time":1384889730,"description":"Dimensions in Time was a two-part sketch broadcast in 1993 as a part of that year's 'Children in Need' appeal.\n\nIt was a nominal 'celebration' of the thirtieth anniversary of Doctor Who, largely made because of the cancellation of the BBC's original idea for a thirtieth anniversary story, 'The Dark Dimension'. Since the BBC had already obtained, at least in principle, agreement from most of the ex-Doctors to do some sort of anniversary program, they went ahead with a charity sketch. 'Dimensions' raised over Â£101,000 for 'Children in Need' according to presenter, Noel Edmonds.\n\n01 - Dimensions in Time - Parts 1 &amp; 2 - (17 minutes)\n\n    Synopsis: The Rani has opened a hole in time, allowing her access to the Doctor's timeline. She uses this to cycle through the Doctor's lives, causing him and his companions to jump back and forth between past and present incarnations. Her intention is to capture all of the Doctor's selves in a time loop, trapping him in London's East End; she has already captured the First and Second Doctor in the time hole. This causes the Fourth Doctor to send a message to his remaining selves, warning them of the Rani's plan.\n\n02 - Outtakes - (7 minutes)\n\n     Synopsis: Outtakes and rarely seen footage of the Dimensions in Time sketch.\n     (approximately 7 Minutes)\n\nNOTE: This sketch probably should have never seen the light of day. It was so chopped up into tiny little scenes in order to get as many companions in the episode, that I simply could not follow ANY kind of plot. But it WAS for a good cause.\n","torrent":{"xt":"urn:btih:e50e80c740985954ca999842813e988588103355","amp;dn":"1993+-+Doctor+Who%2C+Dimensions+in+Time","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e50e80c740985954ca999842813e988588103355","infoHashBuffer":{"type":"Buffer","data":[229,14,128,199,64,152,89,84,202,153,152,66,129,62,152,133,136,16,51,85]},"announce":[],"urlList":[]}}