{"title":"Convective Heat Transfer","uid":12180844,"size":31363706,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e57bc94d8817c6943fbff7c73c6035ffc546a92f&amp;dn=Convective+Heat+Transfer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1438438999,"description":"Convective Heat Transfer - Mathematical and Computational Modelling of Viscous Fluids and Porous Media (Elsevier, Pergamon, 2001).pdf\n\nISBN 0080438784\n\nInterest in studying the phenomena of convective heat and mass transfer between an ambient fluid and a body which is immersed in it stems both from fundamental considerations, such as the development of better insights into the nature of the underlying physical processes which take place, and from practical considerations, such as the fact that these idealised configurations serve as a launching pad for\nmodelling the analogous transfer processes in more realistic physical systems. Such idealised geometries also provide a test ground for checking the validity of theoretical\nanalyses. Consequently, an immense research effort has been expended in exploring and understanding the convective heat and mass transfer processes between a fluid and submerged objects of various shapes. Among several geometries which have received considerable attention are plates, circular and elliptical cylinders, and spheres, although much information is also available for some other bodies, such as\ncorrugated surfaces or bodies of relatively complicated shapes.\n\nThe book is a unified progress report which captures the spirit of the work in progress in boundary-layer heat transfer research and also identifies potential difficulties and areas for further study. In addition, this work provides new material on convective heat and mass transfer, as well as a fresh look at basic methods in heat transfer. Extensive references are included in order to stimulate further studies of the problems considered. A state-of-the-art picture of boundary-layer heat transfer today is presented by listing and commenting also upon the most recent successful efforts and identifying the needs for further research","torrent":{"xt":"urn:btih:e57bc94d8817c6943fbff7c73c6035ffc546a92f","amp;dn":"Convective+Heat+Transfer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e57bc94d8817c6943fbff7c73c6035ffc546a92f","infoHashBuffer":{"type":"Buffer","data":[229,123,201,77,136,23,198,148,63,191,247,199,60,96,53,255,197,70,169,47]},"announce":[],"urlList":[]}}