{"title":"[Kung Fu] The One-Armed Swordsman - Celestial Shaw Brothers Rema","uid":4014438,"size":1902805702,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e5fc2663eb48dc738dcefc2ccd8d344ec82e34a8&amp;dn=%5BKung+Fu%5D+The+One-Armed+Swordsman+-+Celestial+Shaw+Brothers+Rema&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mistertpitydafoo","files":2,"time":1202275509,"description":"The One-Armed Swordsman\nCelestial Remastered Shaw Brothers Dragon Dynasty DVD\nDVDrip to Divx Ultra\nChinese/English embedded subs and languages, require divx ultra compatible software or standalone dvd player\nIncludes .srt English\nSEED PLEASE!! If anyone has Return of the One Armed Swordsman DVD PLEASE upload PLEASE!!\n\nPlot:\tOne-armed Jimmy Wang Yu trains to defend his martial arts school and honor the name of his dead father when the school is threatened by the same gang that killed his father.\nCopyright Ã‚Â© 2001-6 HKFlix, all rights reserved. No part of this text may be reproduced or transmitted in any form or by any means, electronic or mechanical, including photocopying, recording, or by any information storage and retrieval system, without permission in writing from HKFlix.\n\nOverview:\tAn evil gang attacks the Chi school of Golden Sword Kung Fu. One student sacrifices his life to save his teacher and his school, his dying wish is that his son be taken in as a student. Young Fang Kang (Jimmy Wang Yu) grows up in the school and treasures his fathers broken sword and the memory of his father&amp;#039;s sacrifice. The other students (including the teachers daughter played by Pan Yin-Tze) resent him and try to drive him away. The teacher&amp;#039;s daughter challenges him to a fight and when he refuses she becomes enraged and recklessly chops off his arm! He retreats, broken and bloody, and is found by a young poor girl living alone (Chiao Chiao) who nurses him back to health. Meanwhile, the evil gang who originally attacked the Golden Sword school develops a weapon that renders the Golden Sword useless and starts killing off all of the schools students. Fang Kang eventually recovers with the girls help but must now face a life with only one arm. Will he be able to recover and live to defend the school as his father did?\n\nCast: \tJimmy Wang Yu  ||  Pan Yingzi  ||  Chiao Chiao  ||  Wong Chung Shun  ||  Tin Fung  ||  Guk Fung  ||  Liu Chia Liang  ||  Yeung Chi Hing  ||  Chen Yan Yan  ||  Fan Mei Sheng  ||  Wong Kwong Yue  ||  Tong Gaai  ||  Gai Yuen  ||  Cliff Lok  ||  Yen Shi-Kwan  ||  Yuen Cheung Yan  ||  Yuen Wo Ping  ||  Tong Dik  ||  Mars\n(Click any actor to search for more of their movies!)\n\nRunning Time:\t116 mins. (approx.)\n\nLanguages:\tMandarin (Dolby Digital 2.0 - Stereo - Dual Mono)\nEnglish (Dolby Digital 2.0 - Stereo - Dual Mono)\n\nSubtitles:\tENGLISH, Spanish\n\nDistributor:\tDragon Dynasty  [A USA-Based Distributor]\n\nRating:\t\nIIA - &quot;Some Content May Be Inappropriate For Children&quot; (roughly equal to an MPPA rating of &quot;PG-13&quot;)\nFilms rated Category IIA may contain mild violence such as martial arts, mild nudity that is not sexually oriented, mild explicit language and some mild adult situations.\n\nFeatures:\t\n# Anamorphic Widescreen 2.35:1\n# Mono\n# Audio Commentary by David Chute &amp; Andy Klein\n# Interviews With Jimmy Wang Yu, David Chute &amp; Andy Klein\n# &quot;The Master: Cheng Cheh&quot; Featurette (18 mins.)\n# Stills Gallery\n# Trailers\n# DVD-9 ","torrent":{"xt":"urn:btih:e5fc2663eb48dc738dcefc2ccd8d344ec82e34a8","amp;dn":"%5BKung+Fu%5D+The+One-Armed+Swordsman+-+Celestial+Shaw+Brothers+Rema","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5fc2663eb48dc738dcefc2ccd8d344ec82e34a8","infoHashBuffer":{"type":"Buffer","data":[229,252,38,99,235,72,220,115,141,206,252,44,205,141,52,78,200,46,52,168]},"announce":[],"urlList":[]}}