{"title":"Blacks On Blondes - Haleyy Sweet","uid":11672168,"size":485807513,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e64ce8cdfe7bc89f85e5b68469b8c42836b8c490&amp;dn=Blacks+On+Blondes+-+Haleyy+Sweet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Upl0ad3rR","files":1,"time":1422731018,"description":"---:More From My Torrent's Here:---  &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-54cd1906423f9.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54cd1906423f9.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://image-tpb.com/img-54cd19078a840.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54cd19078a840.html&lt;/a&gt; \n\nLast week we had the Devil. This week we have an angel and she comes in the form of Haley Sweet. Haley's with Hooks and Nathan Threat and she's listening to them go on about the negative effects tube sites have had on porn. Haley tells both guys that she has a shoot in a few minutes and a butt plug currently inserted for prearation. It looks as if Haley's going to miss it since both black sharks are circling the white girl. The generous white slut gets down on her knees and sucks on those black cocks without hesistation. Haley's head turns back and forth as if she's at a tennis match. However, the only balls in question are big, black and full of goo which will come into play later. Haley's nectar flavored pussy is next on the menu for these two hungry thugs. That white hole gapes from the constant bombardment of black cock. Hooks loses his mind and blasts her face until his sperm tank reaches &quot;empty&quot;. Nathan, the extreme pervert, continues to tap that white ass while jizz is dripping from Haley's beautiful face. Hooks gets back in the game and hits that pussy before Nathan Threat drills deep inside her ass. Haley's mouth attempts to extract any remaining cum that might be remaining in hook's urethra. This white whore enjoys what she does! The thought of getting dp'd by both swordsmen was enough to get her juices flowing to the point where lube wasn't required. The ass and pussy weren't spared from a double penetration that nearly saw her reproductive and digestive systems destroyed beyond repair. Hooks and Nathan made sure she wouldn't make her next scene as they pounded her holes until it was time to spray her with some nut butter. The double dose of black gunk coated her face and this little angel couldn't be happier. However, it looks as if she won't make it to her next scene","torrent":{"xt":"urn:btih:e64ce8cdfe7bc89f85e5b68469b8c42836b8c490","amp;dn":"Blacks+On+Blondes+-+Haleyy+Sweet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e64ce8cdfe7bc89f85e5b68469b8c42836b8c490","infoHashBuffer":{"type":"Buffer","data":[230,76,232,205,254,123,200,159,133,229,182,132,105,184,196,40,54,184,196,144]},"announce":[],"urlList":[]}}