{"title":"Mushroom Wars v1.2","uid":15442022,"size":143980002,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e69fe991324c04ec6221e2e6c878b6d89ce999f9&amp;dn=Mushroom+Wars+v1.2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1469832351,"description":"You are to become a General of the Mushroom Army. As a fearless commander and skillful strategist, your role is to battle opposing tribes, capture and hold settlements, defensive towers, and armories, to increase the size of your Mushroom forces and conquer the battlefield!\r\n\r\nMushroom Wars, originally released for PlayStation 3, was named one of PSN’s top 25 games and became critically acclaimed all around the world. The intuitive controls merge seamlessly with its challenging gameplay, providing a unique introduction to the real-time strategy genre. While easy to pick-up for beginners, Mushroom Wars features enough gameplay depth and strategy to inspire the most experienced players.\r\n\r\nThis friendly-looking RTS can scratch your strategy itch!\r\n\r\n\r\n\r\nComplete a fascinating Campaign, jump into Skirmish mode to play single battles against up to three computer-controlled opponents, or challenge other players in Multiplayer battles!\r\n\r\n    Varying multiplayer modes: king of the hill, domination, capture\r\n    Up to four players and 4000 units in a battle simultaneously\r\n    Maximum action in five-minute matches\r\n    Strategic resource management: Mushroom hordes perform both as fighting units and an important consumable resource for upgrades.\r\n    Skill-based gameplay with fair competition","torrent":{"xt":"urn:btih:e69fe991324c04ec6221e2e6c878b6d89ce999f9","amp;dn":"Mushroom+Wars+v1.2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69fe991324c04ec6221e2e6c878b6d89ce999f9","infoHashBuffer":{"type":"Buffer","data":[230,159,233,145,50,76,4,236,98,33,226,230,200,120,182,216,156,233,153,249]},"announce":[],"urlList":[]}}