{"title":"Cultures.Northland.v1.0.0.MacOSX","uid":6981222,"size":328869486,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:e6e5c038033799100bb0482a8621964197dbe829&amp;dn=Cultures.Northland.v1.0.0.MacOSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"User_01","files":-1,"time":1327413813,"description":"Create a thriving settlement with farms, bakeries, Potteries, Mason Shops, Schools, Armories and many more. Manage your settlement and its Settlers, erect new buildings, raw materials will roll in, finished goods will roll out so you can grow more people. Watch your people walk, eat, sleep, and talk to each other for entertainment. Couples marry. Babies are born, grow up, and are assigned careers of their own.Each person is a unique character who can be assigned a career. As they go about their careers, their skills improve. As their skills improve, new careers are opened to them. Stay out of the way of your enemies or attack them when you feel there is no other option. \n\nCultures: Northland follows the story of a wandering band of Vikings, guided by a quartet of heroes named Bjarni (son of the famous explorer Leif Ericsson), his lover Cyra, and their friends Hatchi and Sigurd. Hatchi soon finds that his homeland is overrun by enemies. As a result, he calls upon his friends for help. The game's campaign is spread out over eight missions, and you can also play an additional eight stand-alone missions that are unrelated to the story.\n\nFeatures:\n\n-8 campaign Missions with several subquests and 8 single missions\n-4 heroes that join forces to fight the final battle\n-Over 30 different occupational groups, updated job and skills systems\n-menus with different level of detail to fit each gamers needs and preferences\n-Highly detailed 3D environment\n-Extensive tutorial with step by step introduction into the game and its features\n-Improved AI (for the villagers as well as for other tribes)\n- 3 difficulty levels to make the game fun for everybody from beginners to experts\n- Special effects like weather effects, fog, ghost units etc","torrent":{"xt":"urn:btih:e6e5c038033799100bb0482a8621964197dbe829","amp;dn":"Cultures.Northland.v1.0.0.MacOSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6e5c038033799100bb0482a8621964197dbe829","infoHashBuffer":{"type":"Buffer","data":[230,229,192,56,3,55,153,16,11,176,72,42,134,33,150,65,151,219,232,41]},"announce":[],"urlList":[]}}