{"title":"IEInspector HTTP Analyzer Full Edition v6.1.1.313+kg","uid":5939557,"size":19399456,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e81235e4095d19c5b5b9ebd8cab2ac93df80ffac&amp;dn=IEInspector+HTTP+Analyzer+Full+Edition+v6.1.1.313%2Bkg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Slickinator","files":2,"time":1289091796,"description":"IEInspector HTTP Analyzer Full Edition v6.1.1.313   \n &lt;a href=&quot;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/HAv6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i71.photobucket.com/albums/i122/Slickinator2006/HAv6.jpg&lt;/a&gt;\n   \n\n\tIntegrate with Internet Explorer and Firefox (available in Add-on Edition)\nNo more switching between windows. HTTP Analyzer Shows HTTP/HTTPS traffic and web page in the same window. Much easier to learn and use.\n     \n   Capture wide range of HTTP Related data\nUnlike many other tools, HTTP Analyzer's information is organized into sessions for easy identification of requests and responses. HTTP Analyzer can capture a wide range of HTTP related data, including:\n\n    *\n\n      Request and response headers\n    *\n\n      Sent and received cookies\n    *\n\n      URL and redirect URL\n    *\n\n      HTTP verb (GET, POST...)\n    *\n\n      Time start, Time end and duration of a request transaction\n    *\n\n      Content length of page, image or file\n    *\n\n      Mime type of response content \n\n\t\n\n    *\n\n      Response content\n    *\n\n      HTTP status codes or error codes if the request failed\n    *\n\n      Parameters sent in a query strings\n    *\n\n      Post Form values\n    *\n\n      Streams\n    *\n\n      Display whether content read from cache \n\n  Monitor System-Wide/Single/Multi Process (Stand-Alone Edition)\nHTTP Analyzer Stand-alone includes four methods to start logging. It can capture HTTP/HTTPS data from system-wide/ single / multi-process. It supports IE, Safari, Firefox and other win32 Winsock-based http application.\n\n    * Current Session: Monitor all applications of current user session.\n    * All Sessions with System processes: Monitor applications of all sessions including all system processes.\n    * New Process...: &quot;New process...&quot; and &quot;Reopen process&quot; allow users to create and monitor a particular process.\n    * Select Running processes...: Select one or more running process and monitor the particular processes.\n\n  HTTP Request Builder\nUsers can handcraft an HTTP request by using the HTTP Request Builder, or they can use a drag-and-drop operation to move an existing request from the session grid to the Request Builder to execute it again. User  can use multipart/form-data POST method to upload files (introduced in RFC 1867) and View the response headers and content.\nhttp request builder\nIE/Firefox Tamper (Add-on edition only)\nUser can tamper with HTTP requests, view and modify GET query parameters, HTTP/HTTPS headers and POST parameters from Internet Explorer 5+ and Firefox 3+ by using IE/Firefox tamper tool. Since the tool exposes and allows tampering with inconvenient input, It can help user to detect user-input security flaws (e.g. XSS and SQL injection vulnerabilities).\nWARNING: This tool makes it simple to carry out malicious attacks against poorly-written code. Such willful use of this tool against third-parties is a violation of federal, state, and local laws.\n  Highlights Detected Potential Problems\nHttp Analyzer examines each request and issues hinting messages when detecting potential functionality ,performance or security problem. Requests that have hintings are highlighted with a new Hint column marker:\n  Native support for Flash Remoting\nHTTP Analyzer is especially useful for Adobe Flash developers as you can view the request and response of LoadVariables, LoadMovie and XML loads. It also can deserialize and display all Flash Remoting or AMF (AMF0 and AMF3) traffic in a easy-to-use AMF object tree.\nAMF Object Tree\n  Automation Interface\nThe automation library allows other applications or DLLs to talk to HTTP Analyzer Stand-alone application or HTTP Analyzer IE Add-on, and it can control them to capture HTTP/HTTPS traffic, access the detailed HTTP Transaction information and save and load HTTP Transaction log files.   A quite useful feature is that you could call AttachProcessByID to integrate Http Analyzer Stand-alone to your unit test and use it to verify whether the data sent/received by your Web method is correct.\n\nThe automation library can be used by most programming languages (e.g. C#, Delphi &amp; JavaScript).\n\nThe following C# code, Write all URLs to console.\nusing HTTPAnalyzerStd;//adding a reference to &quot;HTTPAnalyzer Stand-alone Automation Library&quot;\n\nIHTTPAnalyzerStandAlone standalone = new HTTPAnalyzerStandAloneClass();\nstandalone.Visible = true\nstandalone.AttachProcessByID(Process.GetCurrentProcess().Id);\nstandalone.Start();\n......\nstandalone.Stop();\n\nforeach (ILogEntry entry in standalone.Log)\n{\n  Console.WriteLine(entry.URL);\n    // do something\n}\nRecord intermediate HTTP/HTTPS traffic \tÃ‚Â¡Ã‚Â¡\nHTTP Analyzer can display all intermediate HTTP/HTTPS traffic, including  redirection, authentication and 1xx responses...\n  Real-time Request Level Time Chart\nThe colored time chart is used to express the relative time between a single network level timing (i.e. , DNS lookup, TCP connects) and other timing segments in the same request.\nrequest level time chart\n  Real-time Page/Process Level Time Chart\nThe colored bars are used to express the relative timing of requests in the same group ( Webpage for IE Add-on, Process for Stand-alone) and the different phases of an HTTP request or a webpage, e.g. blocked, connect, page load time, etc.  Please note that &quot;PageLoadTime&quot; is not calculated by the child requests timing. HTTP Analyzer gets DOMReadyTime and PageLoadTime by listening the corresponding webpage events. The data is more accurate and reliable.\nwebpage level time chart\nwebpage timing chart2\n Real-time Multi-level summaries\nThe summary panel displays the real-time updated summary information on the HTTP/HTTPS requests in a single webpage, a single monitored process or the whole log.\nwebpage summary panel \ttotal summary panel\n  Grouping Of Requests By Page/Process\nIn Add-on Edition, Requests are now grouped by page by default. while in Stand-alone Edition, Requests are grouped by process name by default. Each group can be separately expanded or collapsed. Requests that are grouped can be navigated more easily.\ngroup by webpage\n Build-in Hex Viewer\nHex viewer allow users to view and edit binary files in hexadecimal and textual format.\nHex Viewer \tHex Viewer in content tab\n(Hex viewer, click for larger image) \t(Hex Viewer in stream tab , click for larger image)\n\t\n\nDecode ASP.NET ViewState\nHTTP Analyzer can read and decode the hidden ViewState on an ASP.NET Page. It displays the hidden ViewState in a tree view, raw text, or in XML format.\nASP.net Viewstate decoder\n\t\n\nBuild-in JSON and Soap Viewer\nAs you can see below, the viewer simply shows a tree structure representation of the JSON and Soap traffic. You can use the &quot;Send to JSON Viewer&quot; command in any editor to directly send selected content to the build-in JSON Viewer.\nJSON and SOAP Object Tree\n\n View text and image based content\nHTTP Analyzer can view graphic images and html files as they appear in the browser, display HTML, CSS, JavaScript text content with color syntax  highlighting.\ncontent image \tcontent html editor\n (view image , click for larger image) \t(view HTML , click for larger image)\n\t\n\n&quot;Before request and after response&quot;  cache comparisons  (available in IE Add-on Edition)\nHTTP Analyzer shows not only network traffic between the browser and the web site, but also the interaction between Internet Explorer and the browser cache. This is an important feature when a web site is being tuned for performance or to determine why pages are not updating correctly\nbefore and after cache compare\n\t\n\nSelectively clear cache and cookie\nUnlike IE's clear tool, which clears all caches and cookies indiscriminately, while HTTP Analyzer's can selectively clear caches and  cookies which are related with current HTTP/HTTPS sessions. This feature is especially important for regression test when you wish to initialize web application related environment before test. It's handy to recall bug.\n\t\n\nDecrypt HTTPS Traffic\nHTTP Analyzer can show you unencrypted data sent over HTTPS / SSL connections as the same level of detail as HTTP. HTTPS is available if the application uses the Microsoft WININET API , Mozilla NSS API or OpenSSL API.\n\t\n\nSupport HTTP Compression\nHTTP Analyzer supports web application that have HTTP compression enabled,  displaying the decompressed content and providing information about the compression rate.\n\t\n\nMS ExcelÃ‚Â® Style data filtering\nHTTP Analyzer preconfigure many filter criteria, moreover, you can customize filter criteria against any data item, such as content types, verb, response codes, URLs, headers.\n\ndata filter\n\n   (filter builder, click for animator gif)\n\t\n\nData grouping\nAutomatic Data grouping-an extremely powerful data viewing and manipulation metaphor\n\ndata grouping\n\n     (group by type, click for animator gif)\n\t\n\nRuntime Column Selection\nThe 36 columns can be shown in session grid. And you can use the new quick column button to toggle columns' visibility and reorder columns by dragging items in the dropdown.\nquick column customize\n\n\nInstallation Info:\n\ninstall setup then go to help\n\nuse the keygen and generate your self a \nserial number, highlight and copy and use\nany name you want and paste serial number in \nregistration. shut program off and restart\nregistered enjoy from Slickinator.","torrent":{"xt":"urn:btih:e81235e4095d19c5b5b9ebd8cab2ac93df80ffac","amp;dn":"IEInspector+HTTP+Analyzer+Full+Edition+v6.1.1.313%2Bkg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e81235e4095d19c5b5b9ebd8cab2ac93df80ffac","infoHashBuffer":{"type":"Buffer","data":[232,18,53,228,9,93,25,197,181,185,235,216,202,178,172,147,223,128,255,172]},"announce":[],"urlList":[]}}