{"title":"[1992] Little Village - Little Village 117mb @ 320kbs [only1joe]","uid":5244780,"size":122754993,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e866ec096fb5e8df3d805ead0c4d74ede827ffb4&amp;dn=%5B1992%5D+Little+Village+-+Little+Village+117mb+%40+320kbs+%5Bonly1joe%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"only1joe","files":-1,"time":1261941048,"description":"Little Village - Little Village [1992]\n &lt;a href=&quot;\nhttp://img163.imageshack.us/img163/4356/littlevillagelittlevill.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img163.imageshack.us/img163/4356/littlevillagelittlevill.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/PAJICaACD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/PAJICaACD&lt;/a&gt;\n\nWikipedia - Little Village is an album by the supergroup of the same name, consisting of Ry Cooder, John Hiatt, Nick Lowe and Jim Keltner. They had performed as a group recording the John Hiatt solo album Bring the Family in 1987. Little Village is the only album produced by the group. The band did a tour of the US and Europe to support the album and disbanded later the same year as its release. Although all songs are credited to all four group members, Hiatt sang all but two, those two sung by Cooder and Lowe. &quot;Solar Sex Panel&quot; and &quot;Don't Go Away Mad&quot; were released as singles. At the Grammy Awards of 1993, Little Village was nominated in the &quot;Best Album&quot; category.\n\nMark Deming, All Music Guide - Sometimes you just can't get lightning to strike in the same place twice, no matter how hard you try, and the sole album from Little Village serves as proof. In 1987, guitarist Ry Cooder, bassist Nick Lowe, and drummer Jim Keltner backed up singer and songwriter John Hiatt on his album Bring the Family; the album was hailed as an instant classic, but negotiations to reassemble the group for Hiatt's next album failed. Five years later, the four musicians were persuaded to give working together another try, but this time instead of backing Hiatt, they'd form a band called Little Village, with all the members writing collectively and Hiatt, Cooder, and Lowe trading off on vocals. The idea certainly sounded promising, and there's no denying that these guys play together brilliantly; Little Village rocks harder than Bring the Family, with Keltner and Lowe generating a bucketful of groove, and Cooder chiming in with a man-sized portion of his trademark funky guitar. But while the songs on Bring the Family were powerful, personal, and often deeply moving, here the band sounds like they're just looking to make a good-time party album, and while it is indeed a good time, the results just aren't as satisfying; bald spots and bad driving may be funny, but love and family are the kind of stuff that sticks with you. Also, while Little Village was supposed to be a democracy, it's significant that John Hiatt ended up with the lion's share of the vocals, and most of the songs sound like, well, like John Hiatt songs, which is by no means a bad thing, but with writers and vocalists of the caliber of Nick Lowe and Ry Cooder on board, it's a shame we don't hear more from them. After one album and one tour, Little Village called it a day, and while the album shows they knew how to work together, the finished product is just good fun, rather than the second instant classic they were shooting for. \n\nTrack Listings\n\n[01] Solar Sex Panel\n[02] The Action\n[03] Inside Job\n[04] Big Love\n[05] Take Another Look\n[06] Do You Want My Job\n[07] Don't Go Away Mad\n[08] Fool Who Knows\n[09] She Runs Hot\n[10] Don't Think About Her When You're Trying To Drive\n[11] Don't Bug Me When I'm Working\n \n\nTotal Mp3 Play Time\t&gt; 00h:46m:17s\nTotal File Size\t&gt; 117mb (Including MP3s, Art Covers &amp; File)\nTotal Bit Size\t&gt; 320kbps\nMusic File Type\t&gt; I-Tunes MP3 Format\nMusic Video Format\t&gt; N / A\nScanned Artwork\t&gt; Yes @ 300dpi\nOriginal CD Rip\t&gt; Yes - only1joe\nOriginal Uploader\t&gt; Yes - only1joe \nUpload Speed\t&gt; 33-35KB/s\nMusic Genre\t&gt; Rock\nRelease Date\t&gt; 18 February 1992\nRecord Company\t&gt; Reprise Records \nArtists WebSite\t&gt; \n\n&gt; http://en.wikipedia.org/wiki/Little_Village\n\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n\n\n","torrent":{"xt":"urn:btih:e866ec096fb5e8df3d805ead0c4d74ede827ffb4","amp;dn":"%5B1992%5D+Little+Village+-+Little+Village+117mb+%40+320kbs+%5Bonly1joe%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e866ec096fb5e8df3d805ead0c4d74ede827ffb4","infoHashBuffer":{"type":"Buffer","data":[232,102,236,9,111,181,232,223,61,128,94,173,12,77,116,237,232,39,255,180]},"announce":[],"urlList":[]}}