{"title":"Falling Skies - Season 2","uid":9605485,"size":10729344967,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e97ea1f4974ccd8c8f31a6c95778c3f48b12243a&amp;dn=Falling+Skies+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"POtHS11","files":-1,"time":1392215831,"description":"\n\nFalling Skies is an American science fiction post-apocalyptic dramatic television series created by Robert Rodat and executive produced by Steven Spielberg. The series stars Noah Wyle as Tom Mason, a former Boston University history professor who becomes the second-in-command of the 2nd Massachusetts Militia Regiment, a group of civilians and fighters fleeing post-apocalyptic Boston following an alien invasion that devastated the planet six months before the events of season one.\n\nThe series is broadcast in the United States on the cable channel TNT, and is a production of DreamWorks Television. The series premiered on June 19, 2011.\n\nOn July 2, 2013, TNT renewed the show for a fourth season of 12 episodes to premiere summer 2014.[1]..Falling Skies tells the story of the aftermath of a global invasion by extraterrestrials (including mechanical attack drones called &quot;mechs&quot;, a species of green-skinned six-legged beings known as &quot;Skitters&quot; that appear to control the mechs, and a third mysterious species known as the Overlords, or &quot;espheni&quot;, presumably the actual engineers of the invasion and the masters of the Skitters). Within a few days the invaders neutralized the world's power grid and technology, destroyed the militaries of all the world's countries, and killed over 90% of the human population. The aliens' objectives are not explained, though the aliens try to round up children between the ages of 8 and 18 and attach a biomechanical obedience device onto (and into) their spines, referred to as a &quot;harness&quot;. The harness controls the child's mind, and forcibly removing it generally kills the child. The story begins six months after the invasion and follows a group of survivors who band together to fight back. The group, known as the Second Massachusetts (an allusion to a historical regiment from the Continental Army), is led by retired U.S. Army Captain Dan Weaver and Boston University history professor Tom Mason who, while in search of his son Ben, must put his extensive knowledge of military history into practice as one of the leaders of the resistance movement.","torrent":{"xt":"urn:btih:e97ea1f4974ccd8c8f31a6c95778c3f48b12243a","amp;dn":"Falling+Skies+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e97ea1f4974ccd8c8f31a6c95778c3f48b12243a","infoHashBuffer":{"type":"Buffer","data":[233,126,161,244,151,76,205,140,143,49,166,201,87,120,195,244,139,18,36,58]},"announce":[],"urlList":[]}}