{"title":"Walking Tall(2004)DVDRip.AC3(ENG)-DROCK","uid":6804325,"size":734581484,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb1bcaad59b94f15ca7f73d0c936ceb268903578&amp;dn=Walking+Tall%282004%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320799170,"description":"A man fights to bring decency and the rule of law back to his hometown in this action drama. Chris Vaughn (The Rock) left his home in Washington State\\'s timber country to join the Army, where he distinguished himself as a member of the Special Forces. When his hitch is over, Vaughn decides to return home to help run the family business, a sawmill, but he soon makes the unpleasant discovery that things aren\\'t what they once were. Vaughn learns that the town\\'s lumber industry has all but dried up, and an old high school buddy, Jay Hamilton (Neal McDonough), has turned the city into a den of vice, running a large gambling casino and strip club while selling drugs and women on the side. Angry at this turn of events, and frustrated by local law enforcement officials who are willing to ignore Hamilton\\'s crimes in exchange for kickbacks, Vaughn decides to run for sheriff, and with the help of another old friend, Ray Templeton (Johnny Knoxville), he wins the election. But Hamilton doesn\\'t take kindly to Vaughn\\'s attempts to clean up the town, and Vaughn discovers Hamilton\\'s henchmen are willing to target his friends, his family, and the woman he loves (Ashley Scott) in order to have their way. Walking Tall was based on Phil Karlson\\'s 1973 action hit of the same name, which was in turn inspired by the true story of Buford Pusser, who was sheriff of Tennessee\\'s McNairy County between 1964 and 1970 and gained fame for his tough tactics against the local criminal element.\n\nRipped with Handbrake.\n\nLength: 1 Hour 26 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate; 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:eb1bcaad59b94f15ca7f73d0c936ceb268903578","amp;dn":"Walking+Tall%282004%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb1bcaad59b94f15ca7f73d0c936ceb268903578","infoHashBuffer":{"type":"Buffer","data":[235,27,202,173,89,185,79,21,202,127,115,208,201,54,206,178,104,144,53,120]},"announce":[],"urlList":[]}}