{"title":"MMA Manager v1.4.3 + mod [apkpita]","uid":15111526,"size":77404590,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ec16a2c58e28eac36f6e22ff31e9fb0176517676&amp;dn=MMA+Manager+v1.4.3+%2B+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1467008078,"description":"Take on the role of a MMA manager in the modern fight business. Manage your gym and build your fight team from the local scene to the heights of managing world champions in the top promotions.\r\n\r\n\r\n\r\n&quot;An MMA simulator as beautiful as the bloody and bruised fighters it celebrates, MMA Manager is nevertheless fun and well-constructed&quot; - Bronze Award from PocketGamer\r\n\r\n&quot;MMA Manager is a great management sim to pass time or any train journey or whenever you get a spare moment. It is deep enough to allow you to feel like you are running things without ever being too overwhelming and will keep you entertained for many an hour. A must for any MMA fan.&quot; - Michael Dalgleish, Zero1Gaming\r\n\r\n&quot;You must go on. You can’t go on. You’ll go on. All for 10%.&quot; - Josh Rosenblatt, Vice's Fightland\r\n\r\n\r\n• This is your fight team. Recruit fighters from multiple weight classes and hire coaches to train them.\r\n• Negotiate with leagues, book fights, and guide your fighters up the ranks to win titles.\r\n• An open-ended game in a simulated MMA world with 10 different fight promotions and at least 940 AI fighters.\r\n• Wide range of procedurally generated fighters with differing appearances, skills, stats, martial arts backgrounds, records and personalities. Fighter appearances can vary in hair styles, colours, tattoos, skin tone, facial hair and cauliflower ears.\r\n• AI Fighters will age out, fight each other and move up and down the rankings.\r\n• Fully Simulated player fighters and personalities including greed, happiness, bad habits and career goals.\r\n• Manage your fighters’ careers, keep them happy but remember you can always get rid of them.\r\n• Complex fight simulations with a huge number of possible combinations of action that can make up each fight.\r\n• Corner fighters and influence key moments in the fight.\r\n• Different martial arts styles affect what techniques fighters can use. Fighters can learn new styles from their coaches.\r\n• Deal with issues like missing weight, injuries, and PEDs.\r\n\r\n• Upgrade and equip your gym with the best equipment to compliment your coaches.\r\n\r\nWhat’s new:\r\n• Fix for a long standing bug where basing you team in Alaska would lead to a corrupted save.\r\n\r\nMod Info:\r\nUnlimited money\r\n\r\nRequirements: Android OS 4.4 and up","torrent":{"xt":"urn:btih:ec16a2c58e28eac36f6e22ff31e9fb0176517676","amp;dn":"MMA+Manager+v1.4.3+%2B+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec16a2c58e28eac36f6e22ff31e9fb0176517676","infoHashBuffer":{"type":"Buffer","data":[236,22,162,197,142,40,234,195,111,110,34,255,49,233,251,1,118,81,118,118]},"announce":[],"urlList":[]}}