{"title":"Tongue.In.Cheek.XXX.DVDRip.x264-Pr0nStarS","uid":8915558,"size":2021094886,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ec7f3c4467090ba37f33dd01cc4b258470146991&amp;dn=Tongue.In.Cheek.XXX.DVDRip.x264-Pr0nStarS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chkm8te","files":1,"time":1379133314,"description":"Tongue.In.Cheek.XXX.DVDRip.x264-Pr0nStarS\n\nStarring : Aleksa Nicole, Juelz Ventura, Karlie Montana, Kendra Lust, Maddy O 'Reilly, Monique Alexander, Romi Rain, Sandy Description : Director Kevin Moore brings state-of-the-art camerawork and a passion for freaky fetish to his very first all-girl release. 'Tongue In Cheek' emphasizes deep, devoted rim jobs and ass play in four scalding scenes of intimate lesbian desire. The director loves exposing his deep-seated kinks to the mainstream porn market, and very few movies have been dedicated to the girl-girl ass-licking niche. So Kevin assembled a killer cast of insatiable butt sluts, beautiful babes with zero inhibition when it comes to Sapphic salad tossing. First, round-assed, fishnet-clad babes Karlie Montana and Sandy tease Kevin's camera with their plump, juicy behinds, then worship each other's asshole in a passionate session of face sitting and well-oiled ass grinding. Next, busty Brunettes Romi Rain and Aleksa Nicole Share Crack some snacking, vibrator and an Action Inflatable Butt plug! MILFy personal Trainer Teaches adorable Kendra Lust, Young Maddy O'Reilly A Lesson in Anal Frenching; Their sensuous workout turns into A Lewd Butt- munch brunch. Dirty blonde Juelz Ventura and MILF Monique Alexander start out dressing themselves in the most provocative sex club attire ... and end up slutting it up together in a private bedroom buttfest. The movie's ass kissing comes with a side order of stimulating sex toys. Running nearly three hours (with an additional 24 minutes of behind-the-scenes interviews on the DVD), 'Tongue In Cheek' is a gift to ass crack addicts and underserved fans of all-female bung-tonguing fun. Everyone gets kissed in the end!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7jyilbeaab81k7l5cagh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7jyilbeaab81k7l5cagh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=33z94b3l7ll1rvpxmwqn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=33z94b3l7ll1rvpxmwqn.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:ec7f3c4467090ba37f33dd01cc4b258470146991","amp;dn":"Tongue.In.Cheek.XXX.DVDRip.x264-Pr0nStarS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec7f3c4467090ba37f33dd01cc4b258470146991","infoHashBuffer":{"type":"Buffer","data":[236,127,60,68,103,9,11,163,127,51,221,1,204,75,37,132,112,20,105,145]},"announce":[],"urlList":[]}}