{"title":"Head First PHP &amp; MySQL (A Brain-Friendly Guide)","uid":4716131,"size":69565244,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecb71a3e65937b7fbddda57e879382c7d2cd0977&amp;dn=Head+First+PHP+%26+MySQL+%28A+Brain-Friendly+Guide%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234286284,"description":"If you're ready to create web pages more complex than those you can build with HTML and CSS, Head First PHP &amp; MySQL is the ultimate learning guide to building dynamic, database-driven websites using PHP and MySQL. Packed with real-world examples, this book teaches you all the essentials of server-side programming, from the fundamentals of PHP and MySQL coding to advanced topics such as form validation, session IDs, cookies, database queries and joins, file I/O operations, content management, and more.\n\nHead First PHP &amp; MySQL offers the same visually rich format that's turned every title in the Head First series into a bestseller, with plenty of exercises, quizzes, puzzles, and other interactive features to help you retain what you've learned. \n- Use PHP to transform static HTML pages into dynamic web sites\n- Create and populate your own MySQL database tables, and work with data stored in files\n- Perform sophisticated MySQL queries with joins, and refine your results with LIMIT and ORDER BY\n- Use cookies and sessions to track visitors' login information and personalize the site for users\n- Protect your data from SQL injection attacks\n- Use regular expressions to validate information on forms\n- Dynamically display text based on session info and create images on the fly\n- Pull syndicated data from other sites using PHP and XML\n\nThroughout the book, you'll build sophisticated examples -- including a mailing list, a job board, and an online dating site -- to help you learn how to harness the power of PHP and MySQL in a variety of contexts. If you're ready to build a truly dynamic website, Head First PHP &amp; MySQL is the ideal way to get going.","torrent":{"xt":"urn:btih:ecb71a3e65937b7fbddda57e879382c7d2cd0977","amp;dn":"Head+First+PHP+%26+MySQL+%28A+Brain-Friendly+Guide%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecb71a3e65937b7fbddda57e879382c7d2cd0977","infoHashBuffer":{"type":"Buffer","data":[236,183,26,62,101,147,123,127,189,221,165,126,135,147,130,199,210,205,9,119]},"announce":[],"urlList":[]}}