{"title":"J. C. Servais - Iriacynthe (1982)","uid":11849062,"size":29098209,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ecc19a5ef9abf4ffecdbdc672117e18052bf9637&amp;dn=J.+C.+Servais+-+Iriacynthe+%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":1,"time":1430039505,"description":"Iriacynthe \n\nRijperman-Drukwerk Publisher, 1982, 49 pages\n\nWritten and Illustrated by J. C. Servais\n\nWriting assistance by Jacques Cornerotte\n\nThis story opens on the baron DuBois, as he visits his father's memorial during a hunt. Two years ago, his father threw himself from Devil's Rock, after a strange illness. Then, as he continues his hunt, the young Baron is touched by Iriacynthe - a beautiful and magical being clad in little more than her beauty. That touch ensorcels him, and sets him on the fatal path that his father followed. Then a family power play follows, squabbling for control over the late baron's estate. But other forces hold sway in this woodland, as well, with alignments of their own. The tale owes more to allusion and hint that to step by step storytelling, so origins and alliances of the characters remain murky. I don't find that ambiguity frustrating, though; instead, it supports the general air of fey mystery that pervades this story. Servais's artwork has a delicate line and palette that support the lightness of the otherworld beings, including enticing renderings of the fairy maidens. Although there's no open eroticism here, it certainly won't suit the body-shy. This isn't a must-have for any collection of graphic novels. If you can find it, though, you'll find the illustration and scripting both easy to enjoy","torrent":{"xt":"urn:btih:ecc19a5ef9abf4ffecdbdc672117e18052bf9637","amp;dn":"J.+C.+Servais+-+Iriacynthe+%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc19a5ef9abf4ffecdbdc672117e18052bf9637","infoHashBuffer":{"type":"Buffer","data":[236,193,154,94,249,171,244,255,236,219,220,103,33,23,225,128,82,191,150,55]},"announce":[],"urlList":[]}}