{"title":"We - Arundhati Roy","uid":3646822,"size":732828137,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ed116be21ac09783c38aa5dccfab42ee8324faf5&amp;dn=We+-+Arundhati+Roy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"ruglump","files":2,"time":1174782213,"description":"We - Arundhati Roy\n\n\n\n\nWicked soundtrack.  Powerful imagery.  Arundhati Roys speech strikes to the heart - every word poinently and poetically weaving a detailed view of our current global crisis.  Seed, seed, seed this one out.  Objectively clear.  Compellingly incisive.  Stunning that so much said without words.\n\n64 minutes that will rattle your cage.\nI aquired a full widescreen DVD iso (pre-release), and reduced to 716megs (Xvid 640x368, mp3 192kbps).  View, share.\n-Ruglump\n\n\n\n\nFilm description below copied, in part, from http://www.weroy.org\nCheck the site out, its well worth the time.\n\n* We is a fast-paced 64 minute documentary that covers the world politics of power, war, corporations, deception and exploitation.\n* It visualizes the words of Arundhati Roy, specifically her famous Come September speech, where she spoke on such things as the war on terror, corporate globalization, justice and the growing civil unrest.\n* Witty, moving, alarming and quite a lesson in modern history.\n* We is almost in the style of a music video, featuring the contemporary music of Lush, Curve, Love &amp; Rockets, Boards of Canada, Nine Inch Nails, Dead Can Dance, Amon Tobin, Massive Attack, Totoise, Telepop, Placebo and Faithless. The music serves as wonderful background for the words of Ms. Roy and images of humanity in the world we live all in today.\n* We is a completely free documentary, created (and released) anonymously on the internet.","torrent":{"xt":"urn:btih:ed116be21ac09783c38aa5dccfab42ee8324faf5","amp;dn":"We+-+Arundhati+Roy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed116be21ac09783c38aa5dccfab42ee8324faf5","infoHashBuffer":{"type":"Buffer","data":[237,17,107,226,26,192,151,131,195,138,165,220,207,171,66,238,131,36,250,245]},"announce":[],"urlList":[]}}