{"title":"I Luv Halloween v1-v3 (2005-2007)","uid":10885221,"size":131523841,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ed696ebda107cc9c7affa70c20850660cdef8355&amp;dn=I+Luv+Halloween+v1-v3+%282005-2007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1409071460,"description":"Promotional info:\n\nV1 - &quot;This time it's not just about the candy... Join the misadventures of a group of particularly disturbing trick-or-treaters as they go about their macabre business on Halloween night. Blaming the apples they got from the first house of the evening for the bad candy they've been receiving all night, the kids plot revenge on the old bag who handed out the funky fruit.Riotously funny and wickedly shocking, artist Benjamin Roman and comic book vet Keith Giffen have crafted a sometimes sick and always twisted tale about a holiday that some of us just can't live without--who doesn't love Halloween?&quot;\n\nV2 - &quot;Play Magazine's #1 Manga All your twisted favorites return, but this time they've brought along a few friends! The ghoulish Halloween adventures continue--but what's this? The town has been overrun with zombies! Will the undead take a bite out of trick-or-treating forever?!&quot;Read it if you have a strong stomach and are just a little disturbed.&quot; -Dave Halverson, Play Magazine&quot;\n\nV3 - &quot;&quot;Crass, tasteless, and brilliant.&quot; -Newtype They say bad things come in threes, and this third round of trick o' treating is a close encounter of the twisted kind. We won't completely spoil the surprise, but this volume inlcudes an alien invasion, defiled corpses, more lame candy, and some new, sick characters, including Kevin Kyle Kramer--a.k.a Triple K--and Monica, a charming thirteen-year-old who really REALLY hates dogs. This Halloween, you won't know what crazy is... &quot;I Luv Halloween is pure filth.... I have never been utterly disgusted and insulted by a comic book.&quot; -fanboyplanet.com&quot;\n\nNo scanner credit is listed. Thanks to the scanners for their efforts. Please seed and enjoy. :)\n\nPlease visit and support my Suprbay release thread here, I would appreciate it:       &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-VikTSlick-s-Comics-Releases&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ed696ebda107cc9c7affa70c20850660cdef8355","amp;dn":"I+Luv+Halloween+v1-v3+%282005-2007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed696ebda107cc9c7affa70c20850660cdef8355","infoHashBuffer":{"type":"Buffer","data":[237,105,110,189,161,7,204,156,122,255,167,12,32,133,6,96,205,239,131,85]},"announce":[],"urlList":[]}}