{"title":"A Rockstar's Valentine (Decoy) by K.T. Fisher epub","uid":9723750,"size":118860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed8a7667928bbf0381edbb95125583e1486ac354&amp;dn=A+Rockstar%27s+Valentine+%28Decoy%29+by+K.T.+Fisher+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AtomTPB","files":1,"time":1394270086,"description":"Before we had Rockstar Daddy, there was A Rockstar's Valentine.......\n\nAs soon as I set eyes on the gorgeous guy who saves me from having to dance with yet another jerk, I thought he would be just like the rest. His bad boy rocker image definitely screamed heart breaker, but I was wrong. Boy was I wrong! Yes, Jax can sometimes act like a caveman but he's different than the rest and I can't seem to forget about him. Not that he will give me the chance to forget about him! But why would someone like Jax, who has more than enough experience be interested in a little virgin like me? I thought for sure he was a heartless player when I first met him but I quickly figured out that wasn't the case at all.\n\nAs soon as I spot the sexy little red head walk in, I've already laid her down and claimed her. Now it's just getting her to realize that, along with all the fuckers who seem to be eyeballing her. I soon find out that Kendal is addictive and I need to have my fill of her regularly. How a man before me has never gone that far and claimed Kendal for himself before is beyond me but thank fuck they haven't because Kendal will be completely mine.","torrent":{"xt":"urn:btih:ed8a7667928bbf0381edbb95125583e1486ac354","amp;dn":"A+Rockstar%27s+Valentine+%28Decoy%29+by+K.T.+Fisher+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed8a7667928bbf0381edbb95125583e1486ac354","infoHashBuffer":{"type":"Buffer","data":[237,138,118,103,146,139,191,3,129,237,187,149,18,85,131,225,72,106,195,84]},"announce":[],"urlList":[]}}