{"title":"Platiquemos - Spanish 1-8","uid":4642666,"size":484231724,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ee67c90652e757523012b076c2dc14fcd49756ce&amp;dn=Platiquemos+-+Spanish+1-8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"soy.milk","files":9,"time":1231775431,"description":"Platiquemos is a drill-intensive course operating off a principle of &quot;overlearning&quot;. It is based off the original FSI (Foreign Service Institute) Spanish course, which was drafted by the US government to bring government employees being deployed to foreign nations to fluency in the respective nation's language. The other copies floating around the internet either have no seeds or incorrect file headers, so the track would only play about 2/3rds of the way through before cutting off. These files have the mp3 streams rebuilt as well as cleaner tags (for what it's worth). Follow this course through from start to finish and you WILL have reached basic conversational fluency in Spanish. Best of luck!\n\n&quot;The original FSI Basic Course in Spanish consists of 55 Units, divided into four volumes with accompanying audio-cassettes.  In order to make the program more manageable, we have further divided it into eight levels, each corresponding in time requirement to a college semester; re-formatted the original for clarity and simplicity; and modified the text to make it more relevant to students in every walk of life.  This also gave us the opportunity to include some cultural information and some [we hope] interesting illustrations (Platiquemos contains over 500 culturally authentic illustrations).  The complete program contains over 1500 pages of text, and over 50 hours of audio on compact disks or in mp3 format...&quot;\n-http://www.platiquemos-letstalk.com","torrent":{"xt":"urn:btih:ee67c90652e757523012b076c2dc14fcd49756ce","amp;dn":"Platiquemos+-+Spanish+1-8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee67c90652e757523012b076c2dc14fcd49756ce","infoHashBuffer":{"type":"Buffer","data":[238,103,201,6,82,231,87,82,48,18,176,118,194,220,20,252,212,151,86,206]},"announce":[],"urlList":[]}}