{"title":"Scientific Literacy Under the Microscope- A Whole School Approac","uid":7261796,"size":3318412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee6b250a3870fd9977a989d767c7f84f3e3cbb8c&amp;dn=Scientific+Literacy+Under+the+Microscope-+A+Whole+School+Approac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"594mgnav","files":10,"time":1336752136,"description":"Scientific Literacy Under the Microscope- A Whole School Approach to Science Teaching and Learning[Team Nanban][TPB]\n\nJohn Loughran, Kathy Smith and Amanda Berry | English  ISBN 9460915264, 9460915272 | 2011 | 164 pages | PDF | 3,2 MB\n\nDESCRIPTION:\n\nScientific literacy is generally valued and acknowledged among educators as a desirable student learning outcome. \nHowever, what scientific literacy really means in terms of classroom practice and student learning is debatable due to the inherent complexity of the term \nand varying expectations of what it means for learning outcomes.\n\nTo date the teacher voice has been noticeably absent from this debate even though the very nature of teacher expertise lies at the heart of the \nprocesses which shape students' scientific literacy. The chapters that comprise this book tap into the expertise of a group of primary teachers \nfrom Our Lady of Good Counsel (OLGC), a primary school that chose to actively engage in teaching for scientific literacy. By analyzing the insights \nand thinking that emerged as they attempted to unravel some of the pedagogical complexities associated with constructing an understanding of \nscientific literacy in their own classrooms, these teachers demonstrate the professional knowledge and skill inherent in the expertise of teaching \nand learning science in a primary classroom. The chapters in this book illustrate the processes and structures that were created at OGLC to provide \nthe conditions that allowed these teachers to explore and build on the range of ideas that informed their approach to teaching for scientific literacy. \nThis book is a compelling example of how a whole school approach to scientific literacy can make a difference for students' learning of science and \noffer a concrete example of the development of professional knowledge and practice of teachers.\n\nPLZ SEED AFTER DOWNLOADING...\n\n&quot;SHARING IS CARING&quot;","torrent":{"xt":"urn:btih:ee6b250a3870fd9977a989d767c7f84f3e3cbb8c","amp;dn":"Scientific+Literacy+Under+the+Microscope-+A+Whole+School+Approac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee6b250a3870fd9977a989d767c7f84f3e3cbb8c","infoHashBuffer":{"type":"Buffer","data":[238,107,37,10,56,112,253,153,119,169,137,215,103,199,248,79,62,60,187,140]},"announce":[],"urlList":[]}}