{"title":"Mikis Theodorakis - Serpico (1973) [Soundtrack][mp3 320][h33t][s","uid":4846697,"size":80653786,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee7bb1d4d2a00e6a85623a360b860abcb6c6e94e&amp;dn=Mikis+Theodorakis+-+Serpico+%281973%29+%5BSoundtrack%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":18,"time":1239714460,"description":"Mikis Theodorakis - Serpico \nYear: 1973\nLabel: FM records (2003, digitally remastered)\nTotal time: 33:05\nBitrate: 320 kbps\n\n'Theme from Serpico' introduces the lovely main melody which goes through several variations in the course of the score, being at different times arranged for wind instruments, mandolin, violins, guitar and full symphony orchestra.  'Honest Cop' is an upbeat and vivid jazz piece performed by guitar, saxophone, trumpet (and muted trumpet), a rather active bass guitar and drums that create the sound and atmosphere a good and experienced jazz band might produce. The tracks that follow continue in the same easy listening musical style.  In 'Shoe Shop' we get a nice rendition of the main theme by the flute, trumpet and piano.  'On the Streets' it's a faster, more upbeat and little strange variation of the main theme, with excellent bass guitar and drums work.  The mood changes abruptly in 'Flashback', with lovely and sad melodies from the guitar, violin and wind instruments.  In about 01.30 the music becomes intense and dark, the mood relaxing for a fabulous performance of the main theme by the mandolin towards the end of the cue.  'Laurie's Fable' is another version of the main theme, scored for mandolin, guitar and wind instruments.  'Disillusion' is a dark, sad and slow piece followed by the real highlight of this album, 'End of Title' which starts in quite melancholic mood with the piano, violin and guitar and ends with a flawless and uplifting performance of the main theme by the mandolin and the full orchestra.  Standout tracks are the main and closing titles, 'On the Streets' and 'Flashback', and some of them (especially those with the mandolin and guitar) remind us of the Captain Corelli's Mandolin original score by Stephen Warbeck released much later, in 2001.  In Conclusion, this soundtrack consists of a strong and memorable main theme ( and a secondary one, clearly heard in track.1 between the first and second performance of the main theme ), some darker and sad moments but mostly pleasant easy listening and relaxing music that successfully combines jazz and a more classical style into a coherent whole that keeps the listener interested and satisfied.  An excellent new package and fine sound quality. ~ Demetris Christodoulides \n \nPersonnel:\nMikis Theodorakis (Piano, Arranger and Conductor)\n\nMikis Theodorakis - Serpico Tracks:\n01  Theme from Serpico 3:29 \n02  Honest cop 3:15 \n03  Alone in The Apartment 4:09 \n04  Meeting in The Park 2:17 \n05  Shoe Shop 3:07 \n06  On The Streets 4:30 \n07  Flashback 4:33 \n08  Laurie's Fable 1:44 \n09  Disillusion 1:55 \n10  End of Title 4:00 \nAll compositions by Mikis Theodorakis","torrent":{"xt":"urn:btih:ee7bb1d4d2a00e6a85623a360b860abcb6c6e94e","amp;dn":"Mikis+Theodorakis+-+Serpico+%281973%29+%5BSoundtrack%5D%5Bmp3+320%5D%5Bh33t%5D%5Bs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee7bb1d4d2a00e6a85623a360b860abcb6c6e94e","infoHashBuffer":{"type":"Buffer","data":[238,123,177,212,210,160,14,106,133,98,58,54,11,134,10,188,182,198,233,78]},"announce":[],"urlList":[]}}