{"title":"The Macedonian Question: Britain and the Southern Balkans 1939-1","uid":11744620,"size":1076334,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee8c06a098149274d6ae344ab7ce06f7f0c14232&amp;dn=The+Macedonian+Question%3A+Britain+and+the+Southern+Balkans+1939-1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425948841,"description":"The Macedonian Question - the struggle for control over a territory with historically ill-defined borders and conflicting national identities - is one of the most intractable problems in modern Balkan history. In this lucid and persuasive study, Dimitris Livanios explores the British dimension to the Macedonian Question from the outbreak of the Second World War to the aftermath of the Tito-Stalin split.\n\nInvestigating British policy towards the Bulgar-Yugoslav controversy over Macedonia, the author assesses the impact of British actions and strategy during this period, with a particular focus on wartime planning concerning the future of Yugoslavia and Bulgaria, and attempts to prevent Tito from creating a federation of the South Slavs, both during and after the war. Making extensive use of British archives, Livanios brings to light important documentary evidence to offer a fresh perspective on the emergence of the federal Macedonian unit within Tito's Yugoslavia, and on the efforts to create a functioning Macedonian national ideology","torrent":{"xt":"urn:btih:ee8c06a098149274d6ae344ab7ce06f7f0c14232","amp;dn":"The+Macedonian+Question%3A+Britain+and+the+Southern+Balkans+1939-1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee8c06a098149274d6ae344ab7ce06f7f0c14232","infoHashBuffer":{"type":"Buffer","data":[238,140,6,160,152,20,146,116,214,174,52,74,183,206,6,247,240,193,66,50]},"announce":[],"urlList":[]}}