{"title":"Michael Jackson - Dangerous [Ogg Vorbis -q6]","uid":3357804,"size":110368966,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ef308aa5a0558d11455e99ca97c2391529ce7d8d&amp;dn=Michael+Jackson+-+Dangerous+%5BOgg+Vorbis+-q6%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cuthbert","files":15,"time":1121713224,"description":"Ripped with EAC and oggdropXPd V1.8.3 using -q6\n\nThis is a very fine rip of Michael Jackson's 4th solo album Dangerous (1992).\n\n1. Jam\n2. Why You Wanna Trip On Me\n3. In The Closet\n4. She Drives Me Wild\n5. Remember The Time\n6. Can't Let Her Get Away\n7. Heal The World\n8. Black Or White\n9. Who Is It\n10. Give In To Me \n11. Will You Be There\n12. Keep The Faith\n13. Gone Too Soon\n14. Dangerous\n\nReview by Stephen Thomas Erlewine (www.allmusic.com):\n\nDespite the success of Bad, it was hard not to view it as a bit of a letdown, since it presented a cleaner, colder, calculated version of Thriller -- something that delivered what it should on the surface, but wound up offering less in the long run. So, it was time for a change-up, something even a superstar as huge as Michael Jackson realized, so he left Quincy Jones behind, hired Guy mastermind Teddy Riley as the main producer, and worked with a variety of other producers, arrangers, and writers, most notably Bruce Swedien and Bill Bottrell. The end result of this is a much sharper, harder, riskier album than Bad, one that has its eyes on the street, even if its heart gets middle-class soft on &quot;Heal the World.&quot; The shift in direction and change of collaborators has liberated Jackson, and he's written a set of songs that is considerably stronger than Bad, often approaching the consistency of Off the Wall and Thriller. If it is hardly as effervescent or joyous as either of those records, chalk it up to his suffocating stardom, which results in a set of songs without much real emotional center, either in their substance or performance. But, there's a lot to be said for professional craftsmanship at its peak, and Dangerous has plenty of that, not just on such fine singles as &quot;In the Closet,&quot; &quot;Remember the Time,&quot; or the blistering &quot;Jam,&quot; but on album tracks like &quot;Why You Wanna Trip on Me.&quot; No, it's not perfect -- it has a terrible cover, a couple of slow spots, and suffers from CD-era ailments of the early '90s, such as its overly long running time and its deadening Q Sound production, which sounds like somebody forgot to take the Surround Sound button off. Even so, Dangerous captures Jackson at a near-peak, delivering an album that would have ruled the pop charts surely and smoothly if it had arrived just a year earlier. But it didn't -- it arrived along with grunge, which changed the rules of the game nearly as much as Thriller itself. Consequently, it's the rare multi-platinum, number one album that qualifies as a nearly forgotten, underappreciated record.","torrent":{"xt":"urn:btih:ef308aa5a0558d11455e99ca97c2391529ce7d8d","amp;dn":"Michael+Jackson+-+Dangerous+%5BOgg+Vorbis+-q6%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef308aa5a0558d11455e99ca97c2391529ce7d8d","infoHashBuffer":{"type":"Buffer","data":[239,48,138,165,160,85,141,17,69,94,153,202,151,194,57,21,41,206,125,141]},"announce":[],"urlList":[]}}