{"title":"Rob von Behren, Why events are a bad Idea","uid":5570410,"size":190006,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ef47010095f00f6e13d8241afb89f58731e2f38c&amp;dn=Rob+von+Behren%2C+Why+events+are+a+bad+Idea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1274233320,"description":"Event-based programming has been highly touted in recent years as the best way to write highly concurrent applications. Having worked on several of these systems, we now believe this approach to be a mistake. Specifically, we believe that threads can achieve all of the strengths of events, including support for high concurrency, low overhead, and a simple concurrency model. Moreover, we argue that threads allow a simpler and more natural programming style.\nWe examine the claimed strengths of events over threads and show that the weaknesses of threads are artifacts of specific threading implementations and not inherent to the threading paradigm. As evidence, we present a user-level thread package that scales to 100,000 threads and achieves excellent performance in a web server. We also refine the duality argument of Lauer and Needham, which implies that good implementations of thread systems and event systems will have similar performance. Finally, we argue that compiler support for thread systems is a fruitful area for future research. It is a mistake to attempt high concurrency without help from the compiler, and we discuss several enhancements that are enabled by relatively simple compiler changes.","torrent":{"xt":"urn:btih:ef47010095f00f6e13d8241afb89f58731e2f38c","amp;dn":"Rob+von+Behren%2C+Why+events+are+a+bad+Idea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef47010095f00f6e13d8241afb89f58731e2f38c","infoHashBuffer":{"type":"Buffer","data":[239,71,1,0,149,240,15,110,19,216,36,26,251,137,245,135,49,226,243,140]},"announce":[],"urlList":[]}}