{"title":"Dalgoda - Jan Strnad, Dennis Fujtake, Fantagraphics","uid":7556202,"size":127133074,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ef8a4937fb2aa15d936be8ecc90c6d6f49848737&amp;dn=Dalgoda+-+Jan+Strnad%2C+Dennis+Fujtake%2C+Fantagraphics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":8,"time":1345617048,"description":"Issues 1-8 of Dalgoda, Fantagraphics Books, 1984-1986\n\n\nDalgoda, another one of those great lost books from the 80s. Well, I've always liked it, anyway.\n\nBack in June, The Comics Reporter said (http://www.comicsreporter.com/index.php/comics_i_read_in_series_form_in_the_1980s_dalgoda/):\n\n&quot;Dalgoda was probably the first Fantagraphics comic book series I followed; it was certainly the first Fantagraphics series I saw in the comic book stores on a regular basis. It featured writing by former Warren and DC writer Jan Strnad and art by Dennis Fujitake, an illustrator who had contributed to Gary Groth-related publications since they were being made in Gary's bedroom by counting out the characters in each line of type and spacing accordingly. My memory is that it was superior genre work -- or at least better than 95 percent of what was on the stands -- and reasonably accessible to fans of general, lighthearted science fiction. It was leisurely paced, and had a genial tone; it was neither pompous nor self-loathing. The art featured that somewhat peculiar, can-still-spot-it-across-the-room Fantagraphics coloring from that era. In fact, Fujitake's art, with its blend of mainstream rendering values, meticulous environmental detail and humorous exaggeration, is what lingers on in memory.\n\nI mentioned to a friend who still occasionally reads comics that I was going to write about Dalgoda soon and he said he'd buy that comic today. It's kind of odd to imagine, but I wonder if that exact content came out this summer if it wouldn't have the same position in the marketplace that these books did 28 years ago. That may say a lot about those comics, and even more about the market.&quot;\n\n\n-----------------------------------------------------------------------------\n\nIf anybody has the other Dalgoda mini-series (Flesh &amp; Bone) or any of the numerous books with Dalgoda back-up stories, please, please, PLEASE share them.\n\n\nAlso, I tried to add an image to this one... what a complete pain in the ass! Never again. ","torrent":{"xt":"urn:btih:ef8a4937fb2aa15d936be8ecc90c6d6f49848737","amp;dn":"Dalgoda+-+Jan+Strnad%2C+Dennis+Fujtake%2C+Fantagraphics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef8a4937fb2aa15d936be8ecc90c6d6f49848737","infoHashBuffer":{"type":"Buffer","data":[239,138,73,55,251,42,161,93,147,107,232,236,201,12,109,111,73,132,135,55]},"announce":[],"urlList":[]}}