{"title":"CBC The Passionate Eye.Comic Books Go to War (2010).WS.PDTV.XviD","uid":5316202,"size":365598807,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f055a621bc7506dde9d3b35d6b82d241ee682f52&amp;dn=CBC+The+Passionate+Eye.Comic+Books+Go+to+War+%282010%29.WS.PDTV.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Ekolb","files":3,"time":1264719280,"description":"Comic Books Go to War 2010\n\nThe universe of comic books is a worldwide pop mythology. But in this age of 24-hour news, comic books have become a journalistic tool, reaching out to younger audiences in an effort to provide them with an understanding of the human dimensions of war, revolution, and genocide.\n\nFor almost 100 years comic books provided fantasy, escape, and compensation for adolescents who often felt powerless and misunderstood in their daily lives. Fantasies of power are often violent, but the violence in comic books has no consequences. After all, it's just the stroke of a pen.\n\nBut what happens when the comic book meets real war? Comic Books Go To War explores the journalistic, aesthetic and political implications of reporting the most violent and terrible of human experiences through &quot;comics.&quot;\n\nToday cartoonists write from every corner of the world: reporting on war first hand and writing their own experiences. Joe Sacco is a comic book journalist his first book, Palestine, launched the genre in 1992. In 2005, when he was embedded with US Marines in Baghdad, the report he filed was an 8-page comic book carried by newspapers all over the world.\n\nIn 2001 cartoonist Ted Rall went to Afghanistan to witness the American invasion and wrote To Afghanistan and Back. Persepolis, Marjane Satrapis book and Oscar nominated film, provide a window into childhood during the 1980 Iranian Revolution. And four times a year Le Temps of Geneva gives its first three pages to the comics journalism of Patrick Chappatte. Readers who never thought of picking up a comic book get breaking news through text and drawings in a daily journal.\n\nFormat            : AVI\nLength            : 349 MiB for 44mn 34s 920ms\n\nCodec             : XviD\nSource            : PDTV\nLanguage          : English\nSubtitles         : None\nGenre             : Documentary\n\nVideo #0          : MPEG-4 Visual at 957 Kbps\nAspect            : 608 x 336 (1.810) at 29.970 fps\n\nAudio #0          : MPEG Audio at 122 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:f055a621bc7506dde9d3b35d6b82d241ee682f52","amp;dn":"CBC+The+Passionate+Eye.Comic+Books+Go+to+War+%282010%29.WS.PDTV.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f055a621bc7506dde9d3b35d6b82d241ee682f52","infoHashBuffer":{"type":"Buffer","data":[240,85,166,33,188,117,6,221,233,211,179,93,107,130,210,65,238,104,47,82]},"announce":[],"urlList":[]}}