{"title":"Israel-Palestine - Ending the hatred and violence","uid":4279402,"size":356577395,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:f0d01477ab2e88d384326dcffb560641447f085e&amp;dn=Israel-Palestine+-+Ending+the+hatred+and+violence&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"veruschkaaa","files":9,"time":1215343927,"description":"1. Fourty years on (after the 1967 war):\nIsraeli and Palestinian children are fed hatred and stereotypes from a very early age onward. People from the other side are often portrayed as heartless killing \nmachines, animals without a sense of human decency, who just want grab all the land and exterminate the other nation. \nWith this brainwashing and often little or no contact with people from the other side is it really suprising that when there is a direct encounter there is usually \ngreat aprehension and high levels of stress on both sides? \n\n2+3. Burning Conscience, Israeli Soldiers Speak Out:\nSome Israeli veterans have been thinking about their experiences with the Palestinian population and have realized that some of time what they or fellow \nsoldiers had done actually constituted crimes of war. But the Israeli public has been quite unaware of the level of brutality and hardship experienced by the \nPalestinians.\nSo it was a big step when some of the soldiers spoke out in public about the full extent of repression and terror against the Palestinian people and exhibited photos and video statements made by soldiers documenting the sad reality. It doesn't just hurt the Palestinians but also the Israeli soldiers.\nBreaking the Silence -&gt; www.shovrimshtika.org/index_e.asp \n\n4. Combatants for Peace:\nEqually courageous were meetings of Israeli veterans with former Palestinian fighters to try to break the vicious cycle of violence and retaliation by getting \nto know each other, becoming friends and setting a positive example. \n-&gt; www.combatantsforpeace.org\n\n5. Mother Courage, checking the checkpoints:\nSome Israeli women have decided to try to humanize the regime of controlls at the checkpoints where Palestinians are often forced to wait for hours or sometimes even days, in some cases only to be told that they can't pass after all. Tensions run high on both sides and and calming mediator is often helpfull, especially if \nthere is a language barrier. \nWomen against the Occupation and for Human Rights \n-&gt; www.machsomwatch.org/en\n\n6. Ghassan Andoni, Palestinian human rights activist: \nGhassan Andoni is co-founder of 'International Solidarity Movement', a direct non-violent action (like Ghandi in India) human rights organisation which aims to resist the harsh regime of the Israeli occupation peacefully. \n-&gt; www.palsolidarity.org/\n\n7. Jeff Halper, Israeli human rights activist: \nJeff Halper (co-founder of the Israeli Committee Against House Demolition) explains the message the Israeli government is sending to Palestinians through expropriation of land, house demolition, displacement and segmentation of the \noccupied West Bank by checkpoints, Jewish settlements and the Wall.\n-&gt; www.icahd.org/eng/\n\nYou can watch more (not just about Palestine-Israel) at \nwww.journeyman.tv \nwww.alternatefocus.org\n","torrent":{"xt":"urn:btih:f0d01477ab2e88d384326dcffb560641447f085e","amp;dn":"Israel-Palestine+-+Ending+the+hatred+and+violence","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0d01477ab2e88d384326dcffb560641447f085e","infoHashBuffer":{"type":"Buffer","data":[240,208,20,119,171,46,136,211,132,50,109,207,251,86,6,65,68,127,8,94]},"announce":[],"urlList":[]}}