{"title":"Japhia Life Discography 2000-2010 (4 Releases)","uid":7425901,"size":282142700,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f0f866b9d42b2ba9de367ce3e6df1245a9e11032&amp;dn=Japhia+Life+Discography+2000-2010+%284+Releases%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":59,"time":1341803764,"description":"--------------------------------------------------------------------------------\nJAPHIA LIFE DISCOGRAPHY\n--------------------------------------------------------------------------------\n\nThis Japhia Life discography includes the following 4 releases...\n\n * 2000 - Pages Of Life Chapter One\n * 2004 - Hell's Diary The Healing\n * 2006 - Fountain Of Life\n * 2010 - Nazareth\n\nNot many artists can say that they may become responsible for sparking the next phase in the evolution of an entire genre. If things continue to transpire the way they are, (Rapper/Singer) Japhia Life is set to become the next groundbreaking figure to emerge in music, Period! Born and raised in the gritty streets of Philadelphia, by age fifteenth Japhia found himself sitting in a crack house focused on living out his street dreams. Even though it became rough at times growing up, Japhia seemed to always find his escape in music. &quot;My Mother sings, and plays the piano. She has ever since I was little. A lot of people don't know that I sing and write songs as well. Weaving charisma with true stories has proven to become an explosive combination in terms of his fan base. In 2004 he received a phone call from Super-Producer Todd Collins that would change his life. He was offered a recording contract, and invited to fly out to Nashville, and begin working on a record. Shortly after his visit to Nashville he was signed by TC to (Beatmart/Sony BMG). He is featured in (URB Magazine) and the article starts off by mentioning his content being so inspiring, but yet so raw, and cutting edge at the same time. His penetrating style was compared to Hip Hop greats such as (2 Pac &amp; Nas). &quot;The artists people compare me to scares me sometimes (laughs). These are artists that I've admired artistically from the time I started writing, but I know now that I'm ready to show the globe what God put inside of me musically, and what I have to contribute to the industry&quot;. He is currently in the studio crafting his sophomore release, as well as writing for a plethora of up-coming releases from varies national recording artists. His national debut &quot;Fountain of Life&quot; along with the smash hit single &quot;Joanna&quot; were released in 2006, and have been garnering a firestorm of attention ever since it's release.\n\nGod Bless,\nTorrentTracts - July 2012\n","torrent":{"xt":"urn:btih:f0f866b9d42b2ba9de367ce3e6df1245a9e11032","amp;dn":"Japhia+Life+Discography+2000-2010+%284+Releases%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0f866b9d42b2ba9de367ce3e6df1245a9e11032","infoHashBuffer":{"type":"Buffer","data":[240,248,102,185,212,43,43,169,222,54,124,227,230,223,18,69,169,225,16,50]},"announce":[],"urlList":[]}}