{"title":"Coast to Coast AM February 03 2013","uid":8103020,"size":56626558,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f23f73295f11e89993669de63a6b2feffc2626fb&amp;dn=Coast+to+Coast+AM+February+03+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1360017137,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-03-13\nHost: \tGeorge Noory\nGuests: \tRaymon Grace, Linda Rosenbaum, Geoffrey Simmons\n\nDowser Raymon Grace talked about clearing negative energies, how dowsing \n\nworks, using the power of intent, and his ability to energize water. His \n\nwork is based on the following principles: all things are composed of \n\nenergy and the intelligent human mind can direct energy; energy is \n\nimpressed upon matter; and energy follows thought. He described helping a \n\nfarmer whose alfalfa field died after accidentally being sprayed with \n\nRoundup by &quot;scrambling the frequency of the Roundup and transforming it \n\ninto fertilizer.&quot; When dowsing, he uses a numeric chart going from 1 to \n\n100, both plus and minus. &quot;You'll do better if you ask a question that can \n\nbe answered with a numeric value, rather than a yes or no,&quot; he said, \n\nexplaining that dowsing inquiries can be answered with more specificity \n\nthat way.\n\nAppearing for a segment in the third hour, Linda Rosenbaum talked about \n\nhow she got involved in dowsing, and its healing applications (initially \n\nfacilitated by Raymon Grace) that helped rid her husband of a debilitating \n\nADD/ADHD condition. Grace related the ADD problem (as well as OCD) to a \n\ntype of brain imbalance, and has created a five minute video to help. He \n\nplaced a thought form in the film, and suggested that when watching it you \n\nwrite down the name of the person you want to help, with the clear intent \n\nthat Grace's energy will go out to that person. He recommended checking \n\nthe energy of a space or place, particularly if you're planning a move. A \n\nlot of times you can positively affect the energy of a place or clear out \n\nnegative energy, he said.\n\nGrace, who conducted another of his water energizing experiments during \n\nthe show, believes that due to his efforts (and several other people he \n\nworked in conjunction with), the energy level of water has been raised in \n\nmany places around the world, after they sent out a thought form. \n\nRegarding various types of healings, he noted that each body part has its \n\nown type of intelligence and emotion, and the way to correct a problem, is \n\nto &quot;thank the spiritual love and happiness for being in your body, \n\nand...thank your body everyday,&quot; rather than expressing negativity toward \n\nit.\nNew CPR Procedure\n\nFirst hour guest, Dr. Geoffrey Simmons provided an update on cardiac \n\narrest protocols. A new &quot;hands only&quot; CPR procedure, supported by the \n\nAmerican Heart Association, and other prominent organizations, eliminates \n\nmouth to mouth resuscitation (unless in the case of drowning), and calls \n\nfor a person to put pressure on the chest placing their palm on the \n\nsternum, and pressing rapidly at around a 100 times a minute. Video \n\ndirections here.\n\nNews segment guests: Lauren Weinstein, Mitch Battros, Dannion Brinkley\nWebsite(s):\n\n    raymongraceprojects.com\n    raymongracefoundation.org\n    raymongrace.us\n    myhusbandhasadd.com\n    discovery.org\n\nBook(s):\n\n    The Future Is Yours: Do Something About It!\n    My Husband Has ADD: and the Miraculous Discovery that Changed Our Life\n    Common Sense and Disaster Preparedness\n\n","torrent":{"xt":"urn:btih:f23f73295f11e89993669de63a6b2feffc2626fb","amp;dn":"Coast+to+Coast+AM+February+03+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23f73295f11e89993669de63a6b2feffc2626fb","infoHashBuffer":{"type":"Buffer","data":[242,63,115,41,95,17,232,153,147,102,157,230,58,107,47,239,252,38,38,251]},"announce":[],"urlList":[]}}