{"title":"Black Sabbath - Black Sabbath (1970) (W.B.Rhino Rem. 2004) [EAC-","uid":4215654,"size":319742765,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f28107883e1cfd3126cb23383d03a4f135d60610&amp;dn=Black+Sabbath+-+Black+Sabbath+%281970%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sworduigi","files":10,"time":1212326824,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Found (Ripped by Necromandus)\nArtwork: Full scans.\n\n\nGeneral Info:\n\n\nTracklist:\n   1. &quot;Black Sabbath&quot; ? 6:19\n   2. &quot;The Wizard&quot; ? 4:23\n   3. &quot;Wasp/Behind the Wall of Sleep/Bassically/N.I.B.&quot; ? 9:44\n   4. &quot;Wicked World&quot; ? 4:47\n   5. &quot;A Bit of Finger/Sleeping Village/Warning&quot;\n          (&quot;Warning&quot; written by Aynsley Dunbar et. al.) ? 14:16\n   6. &quot;Evil Woman&quot; (Crow) ? 3:23\n\n\n              LINE UP:\n    * Ozzy Osbourne ? vocals, harmonica on &quot;The Wizard&quot;\n    * Tony Iommi ? guitar\n    * Geezer Butler ? bass guitar\n    * Bill Ward ? drums\n\n    * Tom Allom ? engineer\n    * Barry Sheffield ? engineer\n    * Rodger Bain ? producer\n    *Dan Hersch, Bill Inglot ? remastering (2004)\n\n\n\nReview taken from metal-observer.com:\n&quot;The bullring was a lonely place of concrete towers and steel. The coal mines and the industries were all we had to feel.&quot; Sings the Metal-God Rob Halford from his &quot;Resurrection&quot;-album. And from the concrete jungle of Birmingham, England, the world&amp;#039;s finest Heavy Metal-band was born. A band that would shape, mould and influence countless others and a band that would ultimately collapse due to the excesses of the music business, but then be reborn many years later to show the nu-school just what they were missing.\nAs a debut-album &quot;Black Sabbath&quot; is just hard to beat. The flower-power happiness of the Sixties was being replaced by the doom and depression of the 1970&amp;#039;s and SABBATH were the perfect role-models. Pounding drums, wailing vocals, thumping bass and the guitar riffing of the master Tony Iommi. &quot;Black Sabbath&quot; didn&amp;#039;t welcome you with open arms. They just bulldozed into your collective and grabbed you by the balls to introduce you to their world.\nThe title track is a master class in Heavy Metal-song-writing. The opening picked riff coupled with Ozzy&amp;#039;s wailing vocals leading to the thundering middle riff must have sent punters running for cover! Heavy and very heavy was SABBATH&amp;#039;s message. &quot;The Wizard&quot;, complete with harmonica (!) is a glorious number with fantastic lyrics that would later become a trademark of Ozzy&amp;#039;s capabilities. &quot;Behind The Wall Of Sleep&quot; shows SABBATH&amp;#039;s diversity in musical tastes. Not content to play straight down the middle Metal. They introduced awkward time changes, alternating drum fills. These guys could play. The live favourite &quot;N.I.B&quot; needs little introduction save to say that this is one of Iommi&amp;#039;s classic riffs. &quot;Evil Woman&quot; strays off the Metal-path and once again shows us SABBATH&amp;#039;s Jazz and Blues-influences with a great bass riff by Geezer Butler. Another part of the SABBATH-sound is Iommi&amp;#039;s acoustic playing which starts off &quot;Sleeping Village&quot; then leading to another great riff: slow, brooding then some Jazz-inspired drums from Bill Ward underplayed by a fantastic Butler-bass-run and culminating in some fantastic double-tracked guitar soloing from Iommi.\nThe class of musician on this groundbreaking album is remarkable and I think often overlooked. SABBATH were doing something totally different from the PURPLEs and ZEPPELINs and to this day, some thirty years on, &quot;Black Sabbath&quot; is still one of the best debut albums ever released and if you are a Metal-fan, then this should be in your collection. ","torrent":{"xt":"urn:btih:f28107883e1cfd3126cb23383d03a4f135d60610","amp;dn":"Black+Sabbath+-+Black+Sabbath+%281970%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f28107883e1cfd3126cb23383d03a4f135d60610","infoHashBuffer":{"type":"Buffer","data":[242,129,7,136,62,28,253,49,38,203,35,56,61,3,164,241,53,214,6,16]},"announce":[],"urlList":[]}}