{"title":"The Seahorses - Do It Yourself [1997]","uid":9477227,"size":326642604,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f2c5ac57c55cf1af891c96a9454bc67a95674c1f&amp;dn=The+Seahorses+-+Do+It+Yourself+%5B1997%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389724883,"description":"Review by Stephen Thomas Erlewine\nDetermined to avoid the career-killing, time-consuming recording that plagued the Stone Roses' Second Coming, guitarist John Squire had the Seahorses record their debut album Do It Yourself within months of forming. While his desire to keep the Seahorses a straight-ahead working band is admirable, the results are painfully lackluster. Squire's riffs are skilled but rarely catchy -- they're labored and self-consciously complex. However, they do keep your attention, which can't be said about vocalist Chris Helme, who illustrates that Ian Brown's affected sneer works better with a tuneless vocalist. Helme's songs, including the two openers, are quite bland, but Squire's numbers are also undistinguished attempts at classicist Britpop. &quot;Love is the Law&quot; has a fairly interesting riff and &quot;Love Me and Leave Me,&quot; a song co-written by Liam Gallagher, has a nice melody, but the most disconcerting thing about the Seahorses is that Squire sounds as if he's following Oasis, a band he influenced himself. And he's not following them very well at that, which means Do It Yourself winds up sounding like second-rate Cast. (3/5)","torrent":{"xt":"urn:btih:f2c5ac57c55cf1af891c96a9454bc67a95674c1f","amp;dn":"The+Seahorses+-+Do+It+Yourself+%5B1997%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2c5ac57c55cf1af891c96a9454bc67a95674c1f","infoHashBuffer":{"type":"Buffer","data":[242,197,172,87,197,92,241,175,137,28,150,169,69,75,198,122,149,103,76,31]},"announce":[],"urlList":[]}}