{"title":"Darren Shan - The Demonata Book 4 - Bec","uid":4475754,"size":94935218,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f339337d410ed5d25c4ab146d7ffe691e95804ec&amp;dn=Darren+Shan+-+The+Demonata+Book+4+-+Bec&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Strikketanten","files":9,"time":1225330114,"description":"   BOOK 4 -   Bec\n\nPLOT OUTLINE\n\nBec is a young orphan living in a small ring fort in Celtic Ireland. She is studying to be a priestess. She&amp;#039;s not especially powerful, but she has an extraordinary memory and her teacher, Banba, believes she can one day prove herself useful to the clan they live with. It is a time of great change -- Christians have come to the country and many clans have already converted to the new religion. Bec&amp;#039;s clan still cling to the old ways, but they know they cannot stand against the tide of Christianity for much longer. Bec is worried -- where will a priestess of ancient magic like her fit into the new world? But then her people are faced with a far greater threat -- demons invade and take over much of the country. Night becomes a time of fighting and bloodshed. The world seems poised to fall to the demon invaders.\n\nIn the middle of the nightmarish war, a strange boy comes to Bec&amp;#039;s village. He&amp;#039;s a simple-minded youth who can run very fast but can&amp;#039;t even tell them his name. As addled in the head as he is, he carries a message -- his kinsmen are in trouble and need help. The warriors of Bec&amp;#039;s village are suspicious of the boy, but, for reasons she doesn&amp;#039;t fully understand, she persuades them to help him. A small band of warriors are sent with the boy, to brave the demon-ravaged lands beyond the village. It will be a journey of great danger, savage fighting, stunning revelations and lots of bloodshed.\n\nAnd Bec is going with them.","torrent":{"xt":"urn:btih:f339337d410ed5d25c4ab146d7ffe691e95804ec","amp;dn":"Darren+Shan+-+The+Demonata+Book+4+-+Bec","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f339337d410ed5d25c4ab146d7ffe691e95804ec","infoHashBuffer":{"type":"Buffer","data":[243,57,51,125,65,14,213,210,92,74,177,70,215,255,230,145,233,88,4,236]},"announce":[],"urlList":[]}}