{"title":"The NLP Cookbook: 50 NLP techniques for coaches","uid":12103271,"size":4196955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f409382d1641365c850ff072480e57683ca48a93&amp;dn=The+NLP+Cookbook%3A+50+NLP+techniques+for+coaches&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1436385864,"description":"The NLP Cookbook is a veritable smorgasbord of NLP and related techniques gleaned from some of the greatest names in the field and adapted to provide an encyclopaedic resource for all therapists, coaches, change agents or health professionals.\n\nFran Burgess uses the metaphor of cooking to describe the process of bringing together the best ingredients in NLP and selecting them carefully in order to produce some mouth watering results. The recipes are grouped into sections depending on their purpose. Quite a few focus on how to shift state, with some of these targeting specific states like acceptance and anxiety. These are followed by recipes that seek to develop behaviours and skills, and others that address beliefs and identity. There is then a wide range to choose from which deal with goals, relationships and the process of change.The beauty is that most of them can be used time and again for different circumstances and contexts, so they never wear out. Each recipe is prefaced by an introduction, giving you some background to its source and evolution. \nYou are provided with its ingredients, should you be interested in its engineering, plus timings and materials required, and if it is suitable for working solo, or with a partner. \nNovice cooks can follow the recipes slavishly whereas those with more experience can adapt a recipe, adding a little something here, removing a little something there. This is not magic. They understand the chemistry that underpins the cooking process. They know what happens when you put this with that, now or later","torrent":{"xt":"urn:btih:f409382d1641365c850ff072480e57683ca48a93","amp;dn":"The+NLP+Cookbook%3A+50+NLP+techniques+for+coaches","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f409382d1641365c850ff072480e57683ca48a93","infoHashBuffer":{"type":"Buffer","data":[244,9,56,45,22,65,54,92,133,15,240,114,72,14,87,104,60,164,138,147]},"announce":[],"urlList":[]}}