{"title":"Obama The Greatest President in the History of Everything","uid":6895462,"size":260748,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f418f5194c65c770748c61d7b0579a9c5ce068d7&amp;dn=Obama+The+Greatest+President+in+the+History+of+Everything+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Oromia","files":1,"time":1324184900,"description":"Obama: The Greatest President in the History of Everything \n\nFrank J. Fleming (Author)\n\nFile Size: 254 KB\nPrint Length: 25 pages\nPublisher: Broadside e-books (November 15, 2011)\n\n\nIt's hard to remember the dark days before 2008. It was a time of hatred, racism, violence, obese children, war, untaxed rich people, and incandescent light bulbs -- perhaps the worst days we had ever seen. And at the heart of it all was a thuggish, thoughtless man, George W. Bush, who lashed out angrily at whatever he didn't understand -- and he understood so very little. Then there was that laugh of his -- that horrible snicker that mocked everything intelligent and nuanced. Also, he looked like a chimp.\n\nIt seemed like the end for the United States of America. We would crumble in the hands of vicious, superstitious dimwits determined to hunt &quot;ter'ists&quot; or other figments of Bush's rotten mind. There was nothing left to do but head to Whole Foods to prepare our organic, sustainable, fair-trade last meal as the country ended around us. Despair had overtaken us, and we wondered aloud whether we could ever feel hope again.\n\nAnd then a man emerged who firmly answered, &quot;Yes we can!&quot;\n\nOh, but Barack Obama was no mere man. He was a paragon of intelligence and civilized society. A savior to the world's depressed. A lightbringer. A genius thinking thoughts the common man could never hope to comprehend. And his words -- his beautiful words read from crystal panes -- reached down to our souls and told us all would be well. With the simple act of casting a ballot for Barack Obama, we could make the world an immeasurably better place -- a world of peace, of love, of understanding, of unicorns, of rainbows, of expanded entitlements. This was his promise. And now, having had him as president for more than two years, we can say without reservation that he has delivered all his promises and more and is the best president this country -- or any country -- has ever had or could even imagine to have.\n\n","torrent":{"xt":"urn:btih:f418f5194c65c770748c61d7b0579a9c5ce068d7","amp;dn":"Obama+The+Greatest+President+in+the+History+of+Everything+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f418f5194c65c770748c61d7b0579a9c5ce068d7","infoHashBuffer":{"type":"Buffer","data":[244,24,245,25,76,101,199,112,116,140,97,215,176,87,154,156,92,224,104,215]},"announce":[],"urlList":[]}}