{"title":"The Sage Line 50 Version 11","uid":4053352,"size":96321626,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f4bb36d0855fb70b7ede780c6b54b68027c5f990&amp;dn=The+Sage+Line+50+Version+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"djr829","files":8,"time":1204254231,"description":"Please ensure that you have the latest Microsoft updates installed. This product will not install or run on Windows 95.\n\nSage Line 50 is a powerful business management system, designed to meet the needs of a wide range of UK companies. The software has been refined over many years to take advantage of developments in technology, and to reflect the changing requirements of businesses. As a result, Sage Line 50 offers control over all areas of your business and is the UK?s most successful accounting program.\n\nThe entry point into the range, Sage Line 50 Accountant has all the standard features you need manage all your customers and suppliers professionally and ensure an efficient cash flow for your business. The analysis and reporting tools in all Sage Line 50 programs ensure your critical business decisions are fully analysed and informed.\n\nWhy choose Sage Line 50? \nSage Line 50 is highly usable and secure, with a choice of program to suit your different needs. \nSimple and efficient to use, with a flexible installation process that allows you to tailor the set-up to suit your particular business requirements \nSecurely and simply access your Line 50 data from Microsoft Excel, so key members of your company can analyse and report on essential business information without using Sage Line 50 themselves. \nOffers security and accountability features such as Event Logging, where user identity is logged against activities; and Crash Checking to help ensure you don?t experience data corruption \nHelps you control cash flow, such as highlighting outstanding payments, prioritising payments, automating regular bills and invoices \nHelps to check for duplicate transactions and balance your books \nContains a suite of VAT audit reports approved by Her Majesty?s Revenue and Customs (HMRC) \nHelps you manage your stock, with product lists, records and Intrastat Returns \nA suite of features helping you to record and analyse credit dealings, maximise your cash flow and reduce the likelihood of bad debts \n\nSpecifications\n  \nVersion 11 \nLanguage(s) English \nDistribution Media CD-ROM \nPackage Type Retail Boxed Package \nOperating System Windows 98 SE/ME/NT 4/2000/XP/Server 2003 \nLicence Pricing Standard \nLicence Type Complete Package \nLicence Quantity 1 User, 1 Company \nMin CPU Pentium 400 MHz processor (2GHz recommended) \nMin HDD 150 MB \nMin RAM 64 MB (128 MB for Win XP/2000); 256 MB recommended (512 MB for Win XP/2000) \nMin Screen Requirements 800x600 (1024x768 recommended) \nOther Software Requirements Internet Explorer v6 or higher \n\n\n100% Fully Working / Licened SAGE\n\nUpped by djr829, please leave your comments, thanks","torrent":{"xt":"urn:btih:f4bb36d0855fb70b7ede780c6b54b68027c5f990","amp;dn":"The+Sage+Line+50+Version+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4bb36d0855fb70b7ede780c6b54b68027c5f990","infoHashBuffer":{"type":"Buffer","data":[244,187,54,208,133,95,183,11,126,222,120,12,107,84,182,128,39,197,249,144]},"announce":[],"urlList":[]}}