{"title":"Easy to Wed (1946) DVD5 Untouched- Esther Williams, Van Johnson ","uid":11335273,"size":5672962048,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f4c60c8061c15a51ca369a9c68ed83751c2e1087&amp;dn=Easy+to+Wed+%281946%29+DVD5+Untouched-+Esther+Williams%2C+Van+Johnson+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"SaM","files":-1,"time":1414722329,"description":"Easy to Wed (1946) DVD5 Untouched- Esther Williams, Van Johnson [DDR]\n\nEasy to Wed is a 1946 American musical comedy film directed by Edward Buzzell and starring Van Johnson, Esther Williams, Lucille Ball, and Keenan Wynn. \nThe screenplay by Dorothy Kingsley is an adaptation of the screenplay of the 1936 film Libeled Lady by Maurine Dallas Watkins, Howard Emmett Rogers, and George Oppenheimer.\n\n    CAST:-\n    Van Johnson as Bill Chandler\n    Esther Williams as Connie Allenbury           \n    Lucille Ball as Gladys Benton\n    Keenan Wynn as Warren Haggerty\n    Cecil Kellaway as J.B. Allenbury\n    Ben Blue as Spike Dolan\n    Paul Harvey as Curtis Farwood\n    Jonathan Hale as Hector Boswell\n\nDirected by Edward Buzzell\nProduced by Jack Cummings\nWritten by Dorothy Kingsley\nMusic by Johnny Green\nRunning time 106 minutes\n\nMOVIE PLOT:- Easy to Wed (1946)\nFinancier J.B. Allenbury (Cecil Kellaway) is determined to file a $2 million libel suit against The Morning Star when the newspaper prints a story claiming his daughter Connie (Esther Williams) was responsible for the breakup of a marriage. Anxious to save his paper from financial ruin, editor Curtis Farwood (Paul Harvey) enlists the help of business manager Warren Haggerty (Keenan Wynn), who postpones his marriage to Gladys Benton (Lucille Ball) in order to assist his employer.\n\nWarren's convoluted scheme involves having reporter Bill Chandler (Van Johnson) temporarily marry Gladys so that she can sue Connie for alienation of affection when an intimate photograph of Bill and Connie Allenbury surfaces, &quot;proving&quot; that the newspaper story is not libelous. In order to get the damaging picture, Bill must ingratiate himself with the Allenburys, who are vacationing at the Hotel Del Rey in Mexico. He heads south of the border with Spike Dolan and introduces himself to the Allenburys as a writer who enjoys hunting, which is J.B.'s favorite hobby.\n\nAs time passes and Bill fails to get himself photographed with Connie, Gladys and Warren become increasingly impatient. Warren suspects Bill has become romantically involved with Connie and flies to Mexico in the hope he can persuade her and her father to drop their lawsuit. When they refuse to comply, Warren telephones Gladys, who arrives at the resort and tells J.B. she is married to Bill. When J.B. reports this news to his daughter, Connie decides to prove him wrong by demanding that Bill marry her immediately. They are wed by a justice of the peace.\n\nWhen Warren and Gladys threaten to expose Bill as a bigamist, Bill announces that Gladys' mail-order divorce from her previous husband is not legally binding and therefore her marriage to Bill is also not legal. Gladys reveals that she obtained a second divorce in Reno that is legally binding. The Allenburys finally agree to drop their lawsuit and Warren and Gladys realize they are meant to be together.\n\nPRODUCTION NOTES:-\nAs noted in the opening credits, this film was adapted from the screenplay of the 1936 film Libeled Lady, a non-musical comedy starring Jean Harlow as Gladys Benton, William Powell as Bill Chandler, Myrna Loy as Connie Allenbury, and Spencer Tracy as Warren Haggerty.\n\nThis was the first film in which Williams sang, and she had to work with Harriet Lee, the MGM voice coach. However, Williams's singing part was actually in Portuguese, making it all the more difficult for her. The studio then hired Carmen Miranda to coach both Williams and Johnson.\n\nThis was Johnson and Williams' second film together, after Thrill of a Romance, which had been extremely successful at the box office. Williams said the two had been cast because &quot;Van and I matched. It looked like we belonged together as a couple. He was as much the all-American boy as I was the all-American girl. As World War II drew to a close, we...became icons, in a way, symbolizing the virtues that people loved best about America. Van represented all the young men who had gone off to war for their country, and I represented the girls they were fighting to come home to.&quot;\n\nVan Johnson's biography, MGM's Golden Boy states that Lucille Ball's performance as Gladys &quot;reveals the embryo of her Lucy Ricardo role in the later I Love Lucy television series,&quot; and also states that Keenan Wynn had been in a motorcycle accident before filming, had his mouth wired shut, and as a result, he had to talk between his teeth while losing thirty pounds in four weeks.\n\nThe film also features organist Ethel Smith in a musical sequence with Johnson and Williams, her second appearance in an Esther Williams film, the first being Bathing Beauty (1944).\nBox Office\n\nThe film was a hit: according to MGM records it earned $4,028,000 in the US and Canada and $1,610,000 elsewhere, making the studio a profit of $1,779,000.\n\nMUSICAL NUMBERS:-\n1. &quot;The Continental Polka&quot; - Sung and Danced by Lucille Ball (dubbed by Virginia Rees) and Chorus.\n2. &quot;Acercate Mas&quot; - Sung by Carlos Ramirez.\n3. &quot;Acercate Mas&quot; (reprise) - Sung and Danced by Esther Williams with Van Johnson.\n4. &quot;Toca Tu Samba&quot; - Played on the organ by Ethel Smith.\n5. &quot;Boneca de Pixe&quot; - Played on the organ by Ethel Smith and sung and danced by Esther Williams, Van Johnson and Chorus.\nCritical reception\n\nBosley Crowther of the New York Times observed, &quot;Perhaps the best things about it are Keenan Wynn and Lucille Ball . . . for both of these pleasant young people have exceptionally keen comedy sense and their roles are the most productive of hilarity in the show . . . Together they handle the burdens of the cleverly-complicated plot and throw both their voices and their torsos into an almost continuous flow of gags . . . Eddie Buzzell's direction, which never has been memorable, looks very good in this instance . . . Easy to Wed [is] a summer picture that is decidedly easy to enjoy.&quot;\n\nVariety called the film &quot;top-notch entertainment&quot; and added, &quot;Eddie Buzzell's direction emphasizes lightness and speed, despite picture's long footage . . . Lucille Ball is a standout on the comedy end, particularly her sequence where she indulges in an inebriated flight into fantastic Shakespeare. Keenan Wynn's deft comedy work also presses hard for solid laughs.&quot;\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: MPEG-2\nVideo Bitrate: 5774 kbps\nVideo Resolution: 720x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec:  AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  1\nAudio Languages: English\nRunTime 106 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:f4c60c8061c15a51ca369a9c68ed83751c2e1087","amp;dn":"Easy+to+Wed+%281946%29+DVD5+Untouched-+Esther+Williams%2C+Van+Johnson+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4c60c8061c15a51ca369a9c68ed83751c2e1087","infoHashBuffer":{"type":"Buffer","data":[244,198,12,128,97,193,90,81,202,54,154,156,104,237,131,117,28,46,16,135]},"announce":[],"urlList":[]}}