{"title":"[PDF] [2008] Cyanobacterial Harmful Algal Blooms State of the Sc","uid":6400362,"size":7799132,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5a4204e9aebe9cf4a960deff65650e8bfba0087&amp;dn=%5BPDF%5D+%5B2008%5D+Cyanobacterial+Harmful+Algal+Blooms+State+of+the+Sc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lyndavilla","files":2,"time":1305644139,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nCyanobacteria are single-celled organisms that live in fresh, brackish, and marine water. They use sunlight to make their own food. In warm, nutrient-rich environments, microscopic cyanobacteria can grow quickly, creating blooms that spread across the waters surface and may become visible. Because of the color, texture, and location of these blooms, the common name for cyanobacteria is blue-green algae. However, cyanobacteria are related more closely to bacteria than to algae. Cyanobacteria are found worldwide, from Brazil to China, Australia to the United States. In warmer climates, these organisms can grow year-round.\n\nScientists have called cyanobacteria the origin of plants, and have credited cyanobacteria with providing nitrogen fertilizer for rice and beans. But blooms of cyanobacteria are not always helpful. When these blooms become harmful to the environment, animals, and humans, scientists call them cyanobacterial harmful algal blooms (CyanoHABs).\n\nFreshwater CyanoHABs can use up the oxygen and block the sunlight that other organisms need to live. They also can produce powerful toxins that affect the brain and liver of animals and humans. Because of concerns about CyanoHABs, which can grow in drinking water and recreational water, the U.S. Environmental Protection Agency (EPA) has added cyanobacteria to its Drinking Water Contaminant Candidate List. This list identifies organisms and toxins that EPA considers to be priorities for investigation.\n\nReports of poisonings associated with CyanoHABs date back to the late 1800s. Anecdotal evidence and data from laboratory animal research suggest that cyanobacterial toxins can cause a range of adverse human health effects, yet few studies have explored the links between CyanoHABs and human health.","torrent":{"xt":"urn:btih:f5a4204e9aebe9cf4a960deff65650e8bfba0087","amp;dn":"%5BPDF%5D+%5B2008%5D+Cyanobacterial+Harmful+Algal+Blooms+State+of+the+Sc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a4204e9aebe9cf4a960deff65650e8bfba0087","infoHashBuffer":{"type":"Buffer","data":[245,164,32,78,154,235,233,207,74,150,13,239,246,86,80,232,191,186,0,135]},"announce":[],"urlList":[]}}