{"title":"Sarah McLachlan - Building A Mystery  (2nafish)","uid":5293925,"size":138717188,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f6240e2f9f8b8b3cad2d8130ec89b2c7f219d4ab&amp;dn=Sarah+McLachlan+-+Building+A+Mystery++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1263993493,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 4000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Building a Mystery&quot; is a song by Sarah McLachlan, from her multi-platinum album Surfacing, first released in 1997. At a live performance, Sarah explains the song as being &quot;basically about the fact that we all... have insecurities to hide, and we often do that by putting on a facade.&quot; She also goes on to say that &quot;unfortunately, if we just be who we are, that's usually the more attractive and beautiful thing&quot;.\n\nA fan favourite, the song was an immediate Top-40, Soft AC, and Hot AC hit which paved the grounds for her future songs &quot;Sweet Surrender&quot;, &quot;Adia&quot;, and &quot;Angel&quot;, all from the Surfacing album. It peaked at #13 on the Billboard Hot 100.\n\nThe album version of &quot;Building a Mystery,&quot; and the live albums &quot;Afterglow Live&quot; and &quot;Mirrorball&quot; contain the line, &quot;A beautiful fucked up man&quot;. The radio version replaces this line with &quot;A beautiful but strange man&quot; or the original lyric garbled beyond recognition, and during performances on radio or television, Sarah sings the line &quot;A beautiful messed up man.&quot;\n\nThe song was her biggest chart hit in Canada, spending eight weeks at #1 on the RPM charts and ranking as the #1 single of the year in the magazine's year end chart. It won the Juno Award for Single of the Year in 1998.\n\nThe track also made McLachlan the recipient of the Grammy Award for Best Female Pop Vocal Performance at the Grammy Awards of 1998, beating Mariah Carey, Shawn Colvin, Paula Cole and Jewel.\n\nThe video for the song features former Moist frontman David Usher.\n\nIt was #91 on VH1's 100 Greatest Songs of the 90's.\n\nSurfacing is a 1997 album by Canadian musician Sarah McLachlan. It was produced by Pierre Marchand in Montreal.\n\nIt was McLachlan's bestselling album to date, debuting at number one or number two on the Top 40 charts in many countries, and confirming her star status in many countries, most notably the United States where her 1993 album Fumbling Towards Ecstasy had been a steady seller but hadn't fully established McLachlan as a mainstream pop star. It was released to favorable reviews as McLachlan embarked on the Lilith Fair concert tour.\n\nThe album received a Grammy Award nomination for Best Pop Vocal Album, which was awarded to James Taylor's Hourglass, however the singer won the Best Pop Instrumental Performance award for the track &quot;Last Dance&quot; at the Grammy Awards of 1998.\n\nThe track &quot;Do What You Have to Do&quot; entered the news in 1998, when it was cited in Kenneth Starr's report as the subject of a letter from Monica Lewinsky to Bill Clinton. The song &quot;Angel&quot;, a single in 1999, enjoyed renewed visibility in 2001, when it became popular as a song of comfort and healing following the September 11, 2001 attacks on the World Trade Center. Rapper DMC of Run-DMC stated that this album helped save his life and turn his life around during a deep depression.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n\n","torrent":{"xt":"urn:btih:f6240e2f9f8b8b3cad2d8130ec89b2c7f219d4ab","amp;dn":"Sarah+McLachlan+-+Building+A+Mystery++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6240e2f9f8b8b3cad2d8130ec89b2c7f219d4ab","infoHashBuffer":{"type":"Buffer","data":[246,36,14,47,159,139,139,60,173,45,129,48,236,137,178,199,242,25,212,171]},"announce":[],"urlList":[]}}