{"title":"Flayed Disciple-Flayed Disciple (EP) 320k    ak2014","uid":10614116,"size":50965657,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f656da6baaafbf98ada82b83c0a229ad3ed4b16e&amp;dn=Flayed+Disciple-Flayed+Disciple+%28EP%29+320k++++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":4,"time":1406076101,"description":"Flayed Disciple-Flayed Disciple (EP) 320k    ak2014 What we got...Flayed Disciple is a British death metal/thrash metal band from Taunton, UK. Their debut album 'Death Hammer' was recorded in February 2012 at Foel Studio, Wales, with producer Chris Fielding. They are unsigned.\n\nIn July, 2010, Flayed Disciple won Bloodstock Open Air's Metal 2 The Masses competition in Bournemouth. That won them a place on the New Blood Stage at Bloodstock Open Air Festival, in Derby. They were then invited back to Bloodstock Open Air to play on the bigger Sophie Lancaster stage in 2012.\n\nAfter playing at Bloodstock the first time round, the band started to gain momentum. They were booked onto a tour with Swedish death metal band Aeon and Earache Records - Cerebral Bore. That tour included a slot on the Neurotic Deathfest, Tilburg, the Netherlands.\n\nThe band first met in 2008, and recorded the 'Drawn Viscera' EP in the summer of that year. The EP is now out of production and so considered rare as some of the tracks are not available online. The 2010 'Ejaculate While Killing' EP has been received in a positive way more often than not and Flayed Disciple have a presence in the major music magazines such as Metal Hammer, Terrorizer Magazine and Zero Tolerance. Many live reviews can be found on the internet.\n\nThe full length album 'Death Hammer' was released on May 28, 2012 by Irish label Grindscene Records. There are many reviews online and in print.\n\nTwo music videos were recorded from 'Death Hammer', which are available on YouTube, and had airplay on MTV Greece as well as through the Metal Hammer and Terrorizer websites.\n\nA 12&quot; vinyl was recorded in March 2014, and released independently on Flayed Disciple's own label - Bethlam Records.\n\n","torrent":{"xt":"urn:btih:f656da6baaafbf98ada82b83c0a229ad3ed4b16e","amp;dn":"Flayed+Disciple-Flayed+Disciple+%28EP%29+320k++++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f656da6baaafbf98ada82b83c0a229ad3ed4b16e","infoHashBuffer":{"type":"Buffer","data":[246,86,218,107,170,175,191,152,173,168,43,131,192,162,41,173,62,212,177,110]},"announce":[],"urlList":[]}}