{"title":"Claymore [Manga Ita Cbr] vol. 26-27 [TNT Village]","uid":12747110,"size":155415057,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f6d5947d2a7807323864b3183377eb36c63d6088&amp;dn=Claymore+%5BManga+Ita+Cbr%5D+vol.+26-27+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"turchez90","files":2,"time":1447325955,"description":".:Locandina:.\r\n\r\n[img]http://i.imgur.com/tm2TYIN.jpg[/img]\r\n\r\n.:Trama:.\r\n\r\nL'ambientazione di Claymore è un mondo di fantasia con riferimenti medioevali. Politicamente, sembra essere diviso in un grande numero di città-stato separate tra loro, dove gli umani coesistono con dei mostri chiamati yoma. Gli yoma si cibano di esseri umani e hanno la capacità di alterare la propria forma per nascondersi all'interno della società, in attesa del momento giusto per nutrirsi; il modo più facile per mimetizzarsi è prendere la forma di un umano recentemente divorato, di cui con la carne gli yoma acquisiscono anche i ricordi. Questo permette loro un alto grado di mimetizzazione.\r\nUna società segreta ha creato un ordine di guerriere sovrumane per proteggere l'umanità dagli yoma; esse vengono chiamate dagli abitanti dei villaggi Claymore, dal nome delle grandi spade a doppio taglio che esse utilizzano. I villaggi attaccati dagli yoma assoldano le Claymore per uccidere i mostri.\r\nL'organizzazione crea le guerriere impiantando carne e sangue di yoma nei corpi umani, producendo ibridi in grado di superare in potenza gli yoma stessi, grazie al loro addestramento e alla loro intelligenza. Le abilità base di una guerriera includono una rigenerazione rapida, una limitata capacità di trasformazione corporea, la capacità di percepire altre guerriere e demoni, una maggiore tempra fisica, non soffrono né il caldo né il freddo e non invecchiano. Indossano tutte la stessa uniforme, e utilizzano enormi spade Claymore, inutilizzabili da parte degli esseri umani per la loro pesantezza; sono caratterizzate da occhi argentei, capelli chiari tra il biondo e l'argento e perciò sono anche chiamate &quot;streghe dagli occhi d'argento&quot;. Inoltre i poteri yoma di ogni guerriera tendono ad incrementare con il tempo, finché la Claymore perde tutta la sua umanità e si trasforma in uno yoma altamente intelligente, chiamato &quot;risvegliato&quot;. Inoltre, le guerriere corrono costantemente il rischio di accelerare la trasformazione se utilizzano esageratamente i loro poteri; chiederanno ad una compagna di essere uccise quando percepiranno che il risveglio è vicino. Le guerriere Claymore sono attualmente tutte donne, poiché i Claymore maschi sono risultati molto forti, ma inaffidabili per la loro facile tendenza al risveglio.\r\nQuando l'Organizzazione è contattata dai villaggi per uccidere gli yoma, questa manda una guerriera, nonostante non tutte eseguano gli ordini volontariamente (come implicato nel manga); a missione compiuta, un agente passerà a riscuotere il compenso. Se una città non esegue il pagamento e successivamente chiederà nuovamente aiuto all'Organizzazione, non riceverà alcun soccorso e verrà quindi lasciata in balìa degli yoma. È stato insinuato che l'Organizzazione stessa indirizzi alcuni yoma verso queste città.\r\n\r\n.:Scheda:.\r\n\r\nAutore: Norihiro Yagi\r\nTitolo: Claymore\r\nTipologia: Manga\r\nPagine: 200/220 a volume\r\nAnno: 2002-2014\r\nNazionalità: Giappone\r\nGenere: Dark Fantasy\r\nLingua: Italiano\r\nDimensione del file: 148 Mb\r\nFormato del file: CBR (JPG)\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/IleUtGZ.jpg[/img]\r\n\r\n[img]http://i.imgur.com/Y883cB1.jpg[/img]","torrent":{"xt":"urn:btih:f6d5947d2a7807323864b3183377eb36c63d6088","amp;dn":"Claymore+%5BManga+Ita+Cbr%5D+vol.+26-27+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6d5947d2a7807323864b3183377eb36c63d6088","infoHashBuffer":{"type":"Buffer","data":[246,213,148,125,42,120,7,50,56,100,179,24,51,119,235,54,198,61,96,136]},"announce":[],"urlList":[]}}