{"title":"High Density Data Storage[BBS]","uid":6606950,"size":21055874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f71f1b9e82ff6567e67b8cf8bb92a384cd0667ca&amp;dn=High+Density+Data+Storage%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313436497,"description":"        High Density Data Storage: Principle, Technology, and Materials \n\n\n\n\n\nThe explosive increase in information and the miniaturization of electronic devices demand new recording technologies and materials that combine high density, fast response, long retention time and rewriting capability. As predicted, the current silicon-based computer circuits are reaching their physical limits. Further miniaturization of the electronic components and increase in data storage density are vital for the next generation of IT equipment such as ultra high-speed mobile computing, communication devices and sophisticated sensors. This original book presents a comprehensive introduction to the significant research achievements on high-density data storage from the aspects of recording mechanisms, materials and fabrication technologies, which are promising for overcoming the physical limits of current data storage systems. The book serves as an useful guide for the development of optimized materials, technologies and device structures for future information storage, and will lead readers to the fascinating world of information technology in the future. ","torrent":{"xt":"urn:btih:f71f1b9e82ff6567e67b8cf8bb92a384cd0667ca","amp;dn":"High+Density+Data+Storage%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f71f1b9e82ff6567e67b8cf8bb92a384cd0667ca","infoHashBuffer":{"type":"Buffer","data":[247,31,27,158,130,255,101,103,230,123,140,248,187,146,163,132,205,6,103,202]},"announce":[],"urlList":[]}}