{"title":"100 Minds That Made the Market by Kenneth L. Fisher","uid":9415526,"size":10122622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f74f2d5af931e862a3043eb4f1e81e5a78c252c8&amp;dn=100+Minds+That+Made+the+Market+by+Kenneth+L.+Fisher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":7,"time":1388432551,"description":"Introducing the new Fisher Investment Series, comprised of engaging and informative titles written by renowned money manager and bestselling author Ken Fisher. This series offers essential insights into the worlds of investing and finance. \nOver the course of nearly two centuries, the innovations, mistakes, and scandals of different market participants have played an important role in shaping today's financial markets. Now, in 100 Minds That Made the Market, Ken Fisher delivers cameo biographies of these pioneers of American financial history. From Joe Kennedy's &quot;sexcapades&quot; to Jesse Livermore's suicide, this book details the drama, the dirt, and the financial principles of an amazingly inventive group of financial minds. Fisher digs deep to uncover the careers, personal lives, and contributions of these individuals, and leads you through the lessons that can be learned from each one. Here you have 100 of the best teachers -- some you already know, some you will feel you know, and some you may not have previously discovered -- whose experiences will undoubtedly enhance your understanding of the markets. \nWith a few pages dedicated to each person, 100 Minds That Made the Market quickly captures the essence of the people and ideas that have influenced the evolution of the financial industry.","torrent":{"xt":"urn:btih:f74f2d5af931e862a3043eb4f1e81e5a78c252c8","amp;dn":"100+Minds+That+Made+the+Market+by+Kenneth+L.+Fisher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f74f2d5af931e862a3043eb4f1e81e5a78c252c8","infoHashBuffer":{"type":"Buffer","data":[247,79,45,90,249,49,232,98,163,4,62,180,241,232,30,90,120,194,82,200]},"announce":[],"urlList":[]}}