{"title":"Agatha Christie's Marple (2005-2006) Series 02 - 4 SD Episodes","uid":11005544,"size":2831394913,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f75981bac47d0671f9364b3e1fed266f31372c5d&amp;dn=Agatha+Christie%27s+Marple+%282005-2006%29+Series+02+-+4+SD+Episodes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bnaron","files":-1,"time":1410225796,"description":"                             Agatha Christie's Marple\n                              (2005-2006) Series 02\n                                   4 SD Episodes\n\n\nSeries Description Courtesy Of:\n\nFrom Wikipedia, the free encyclopedia &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Agatha_Christie's_Marple&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Agatha_Christie's_Marple&lt;/a&gt;\n\n\nAgatha Christie's Marple (or simply Marple) is a British ITV television series based on the books and short stories by British crime novelist Agatha Christie. The title character was played by Geraldine McEwan from the first to third series, until her retirement from the role, and by Julia McKenzie from the fourth series onwards.\n\nEach series consists of four feature-length episodes, except series six which only has three episodes. The first six episodes were all adaptations of Miss Marple novels by Christie. Subsequent episodes were derived both from works featuring Miss Marple but also Christie novels that did not feature the character. The title of the series removes the word Miss from Miss Marple, to match the title of the Agatha Christie's Poirot series.\n\nFollowing the conclusion of the sixth series, it was announced that the BBC had acquired the rights for the production of Agatha Christie adaptations, suggesting that ITV would be unable to make a seventh series of Marple.\n\n\nEpisode Descriptions Courtesy Of:\n\nThe On-Line Television Database\nAn Open Database for Television Fans &lt;a href=&quot;\nhttp://www.thetvdb.com/?tab=series&amp;id=78895&amp;lid=7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetvdb.com/?tab=series&amp;id=78895&amp;lid=7&lt;/a&gt;\n\n\n2005-02-05 - Sleeping Murder (Video:H264 704x400, 896kbps, 25fps - Audio:AAC 44.1kHz, 113kbps)\n\nMiss Marple helps Gwenda and Giles Reed to solve an old crime when they move into their new home and Gwenda thinks that she has witnessed a murder there years before.\n\n\n2006-02-12 - The Moving Finger (Video:H264 720x404, 897kbps, 25fps - Audio:AAC 44.1kHz, 116kbps)\n\nPoison pen letters are spread around a village, and result in suicides, but Miss Marple isn't convinced the writer has only contributed to their deaths by the letters.\n\n\n2006-02-19 - By The Pricking Of My Thumbs (Video:H264 704x396, 898kbps, 25fps - Audio:AAC 44.1kHz, 112kbps)\n\nWhen Tommy and Tuppence Beresford visit Tommy's elderly aunt at Sunny Ridge Nursing Home, Tuppence is told by another resident, Mrs. Lancaster, that the corpse of a child is hidden behind a fireplace. Tuppence realises there could be more to the old lady's words than she originally thought, especially when Tommy's aunt dies weeks later, and Mrs. Lancaster mysteriously disappears. With Tommy away on business, who better to help her than Miss Marple, who is visiting an old friend at the nursing home. With a cryptic painting on their hands, the two end up in the Norfolk village of Farrell St. Edmund to find the subject of their painting, a lone cottage in a wooded forest, while also trying to learn the closely-guarded secrets of the residents.\n\n\n2006-04-30 - The Sittaford Mystery (Video:H264 720x404, 894kbps, 25fps - Audio:AAC 44.1kHz, 112kbps)\n\nHeavy snow is falling in Dartmoor and the shadowy guests in the local hotel decide to take part in a seance in order to amuse themselves. But the evening takes on a more sinister edge when the table-turning suggests that Clive Trevelyan, an eminent politician, is in danger. Meanwhile, at Sittaford House, Miss Marple discovers that poisoned Turkish Delight has been sent to Trevelyan. John Enderby, Trevelyan's loyal right hand man, is so concerned for his friend's safety that he wants to check on him. Unfortunately, Trevelyan is staying at the hotel - six miles away and, with snow drifts blocking the roads, someone will have to make the journey on foot... \n\n","torrent":{"xt":"urn:btih:f75981bac47d0671f9364b3e1fed266f31372c5d","amp;dn":"Agatha+Christie%27s+Marple+%282005-2006%29+Series+02+-+4+SD+Episodes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f75981bac47d0671f9364b3e1fed266f31372c5d","infoHashBuffer":{"type":"Buffer","data":[247,89,129,186,196,125,6,113,249,54,75,62,31,237,38,111,49,55,44,93]},"announce":[],"urlList":[]}}