{"title":"EMPIRE: Deck Building Strategy v1.0.0","uid":9028717,"size":108237799,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f8212e484a656b49a7a1a80d637d848936e06054&amp;dn=EMPIRE%3A+Deck+Building+Strategy+v1.0.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":-1,"time":1381415133,"description":"\nThe barbarous tribes who fought amongst themselves for so many aeons are at last able to come together to found a wonderous civilization. Is yours the first of its kind in this world, or one of many? No man knows, but what all men know is that their Empire must not only survive, but flourish!\n\nThe world is full of terrible horrors, however, and they will wear away at your Empire from all sides. Natural resources have become more scarce. And perhaps worst of all, your powerful Empire has grown heavy and full of internal strife with its age. \n\nHow long can you stand the pressures of survival before your Empire finally comes crumbling back down into the desolated earth from which it grew?\n\nEMPIRE introduces the world's first &quot;Deck-Building 4X Strategy Game&quot;. EMPIRE is a quick, easy-to-learn yet difficult to master strategy/tactics game. FEATURES:\n- Procedurally generated worlds mean that no two games will be alike. \n\nWill you find valuable mountains to mine military materials from? Food-rich forests that will grow your Empire quickly?\n\n- A unique take on the deck building mechanism similar to those in Dominion, Puzzle Strike or Ascension. Your deck grows during the game, and it fills with both useful Action Cards, powerful Spell Cards, -- and also totally useless Strife Cards. Managing your deck is an important part of staying strong!\n- Dozens of interesting tactical cards featuring excellent art from concept artist Gilles Ketting.\n- A unique grid based tactical combat system. Use your Action and Spell cards to get the upper hand and destroy the enemy forces!\n- Unlike traditional 4X strategy games which not only take hours, but tend to become slow and boring late game, EMPIRE is a quick, elegant knife-fight of a game.\n- Designed by indie game design superstar Keith Burgun, creator of 100 Rogues.\n\nMore info:\n &lt;a href=&quot;\nhttps://play.google.com/store/apps/details?id=com.crazymonkeystudios.empire&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://play.google.com/store/apps/details?id=com.crazymonkeystudios.empire&lt;/a&gt;\n\n\nInstructions:\n\n1.Install the APK\n2.Copy 'com.crazymonkeystudios.empire' folder to 'Sdcard/Android/Obb'\n3.Launch the Game\n","torrent":{"xt":"urn:btih:f8212e484a656b49a7a1a80d637d848936e06054","amp;dn":"EMPIRE%3A+Deck+Building+Strategy+v1.0.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8212e484a656b49a7a1a80d637d848936e06054","infoHashBuffer":{"type":"Buffer","data":[248,33,46,72,74,101,107,73,167,161,168,13,99,125,132,137,54,224,96,84]},"announce":[],"urlList":[]}}