{"title":"Max and Paddy's Road To Nowhere","uid":13333861,"size":945709589,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f8788268a5116b1613b249d8881ed6ffea8725bd&amp;dn=Max+and+Paddy%27s+Road+To+Nowhere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7436746","files":6,"time":1453967448,"description":"http://www.imdb.com/title/tt0421033/\r\n\r\nHopeless doormen Max and Paddy leave clubland and embark on a series of wild and exciting adventures in their prized motorhome, &quot;Easy Rider&quot; style.\r\n \nhttps://www.wikiwand.com/en/Max_and_Paddy's_Road_to_Nowhere\r\n\r\nMax and Paddy's Road to Nowhere is a British comedy television show on Channel 4 starring and written by Peter Kay and Paddy McGuinness. All the episodes were also directed by Kay. It began on 12 November 2004 and ran for six 30 minute episodes up until 17 December 2004. This spin off from Peter Kay's Phoenix Nights follows the two Bolton doormen/bouncers Maxwell &quot;Max&quot; Bygraves (Kay) and Patrick &quot;Paddy&quot; O'Shea (McGuinness) as they wind their way around Britain in their campervan. The key reason why they are on the open road is never mentioned in the series: however, they took £8,000 from a woman in the second series of Peter Kay's Phoenix Nights to kill her husband, but never properly went through with the job. When she discovered this, they hit the road in the van to escape the possible consequences.\r\n\r\nAlthough this series was broadcast two years after Peter Kay's Phoenix Nights, the action seems to be set immediately afterwards. However, the Motor Home they purchased in Phoenix Nights is a Ford, and the Motor Home they use in Max and Paddy's Road to Nowhere is actually a Fiat. Peter Kay touched on this in the DVD commentary of Phoenix Nights, saying that he should have told the production company to buy a larger Motor Home than the Ford as he was going to use it in the spin off. Max is the older and more sensible of the two, roughly 40 years old, and usually pretending to have more life experience than he has actually had, including a stint in the army. Paddy is a cheeky and likely lad obsessed with sex, pornography, food, and several strange but funny catchphrases such as, &quot;Ding dang doo.&quot; Max often coldly stares at Paddy or anyone who has offended his tastes and often shouts &quot;H-how dare you!&quot;. He also calls people a clown or a melon if they've said something absurd. A second series of the show was initially planned for 2006, but Peter Kay instead confirmed a third series of Phoenix Nights (which as of September 2014, has not yet happened) However, on November 27, 2014 live shows were announced for comic relief, with the full cast returning","torrent":{"xt":"urn:btih:f8788268a5116b1613b249d8881ed6ffea8725bd","amp;dn":"Max+and+Paddy%27s+Road+To+Nowhere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8788268a5116b1613b249d8881ed6ffea8725bd","infoHashBuffer":{"type":"Buffer","data":[248,120,130,104,165,17,107,22,19,178,73,216,136,30,214,255,234,135,37,189]},"announce":[],"urlList":[]}}