{"title":"Holly Golightly and the Brokeoffs - You Can't Buy A Gun When You","uid":8455526,"size":233150242,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f94ee9b39626093f5f68fe3060fc9c89b1520562&amp;dn=Holly+Golightly+and+the+Brokeoffs+-+You+Can%27t+Buy+A+Gun+When+You&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":24,"time":1368099768,"description":"one of Dicks Americana collection\n\nArtist: Holly Golightly and the Brokeoffs\nRelease: You Can't Buy A Gun When You're Crying\nReleased: 2007\nLabel: Damaged Goods\nCatalog#: DAMGOOD283CD\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana,rock,country,folk\n\n\n\n\n01 - Devil Do\n02 - Just Around the Bend\n03 - Everything You Touch\n04 - Medicine Water\n05 - You Can't Buy a Gun\n06 - Crow Jane\n07 - So Long\n08 - Time To Go\n09 - Black Heart\n10 - Clean in Two\n11 - Jesus Don't Love Me\n12 - Let My Daddy Do That\n13 - Whoopie Ti Yi Yo\n14 - Devil Don't\n\nReview from All Music Guide:\n\nHolly Golightly exists in that rarefied class of performers who are regarded as legends of prolific measure, but whose adoration is restricted to a small, devoted following. The fact that her followers (and collaborators) include the likes of Jack White and Dan Melchior doesn't hurt matters. Her recent song &quot;There Is an End,&quot; a collaboration with Cincinnati, OH's the Greenhornes, was even included in the film Broken Flowers. However, being delightfully oblivious to the mainstream, Golightly has never altered her style or sound to appeal to a larger audience. In fact, she's stripped her sound down from her comparatively lush approximations of '60s girl group revelry and come up with a perfectly primitive bunch of songs for this 2007 release, You Can't Buy a Gun When You're Crying. Billed as the debut effort of Holly Golightly and the Brokeoffs, it's worth noting that, despite the pluralistic moniker, &quot;the Brokeoffs&quot; is actually a somewhat mysterious guy simply called Lawyer Dave, a one-man-band from Texas. The album is a barebones collections of duets culled from an eerie Americana backwater tradition that suits Golightly like a glove. Though they come from seemingly different worlds, the two singers mesh well, with Golightly's soft warble playing against Lawyer Dave's slurring drawl. There are elements of the haunted harmonies of the Carter Family in the mix, as well as traces of lonesome Delta twang, and Golightly's own otherworldly sensibility. At its best, the album sounds like leftovers from the cutting room floor of Alan Lomax. Built around a simple mantra of, &quot;Ain't nobody gonna love me like the devil do,&quot; repeated infinitely by Golightly in her quavering, slightly nasal, Victoria Williams-esque little girl voice, &quot;Devil Do&quot; is an understated highlight. &quot;Got me drunk on whisky/Drunk on wind/The lord don't like it/But the devil don't mind,&quot; sings Lawyer Dave during the cheeky verse of the backporch stomper. Later in the album comes the turn of the screw with the altered reprise &quot;Jesus Don't Love Me,&quot; and among the highlights is the aching balladry of &quot;Just Around the Bend&quot;: &quot;When you were planning and dreaming/Of how you would leave in the end/But you didn't see this coming/From just around the bend,&quot; sings Golightly coyly. The song is a steady waltz that builds an eerie, almost murder ballad-esque tension as it twirls along. Golightly's knack for turns of phrase and unique story angles harkens back to her early colleague, Billy Childish. Though now, perhaps more than on previous efforts, she seems to be coming into a bit more of her own personality. Just as it's difficult to listen Thee Headcoatees without feeling a little like you're listening to a play of some sort, it's difficult to listen to this album without getting the impression that Golightly's still sort of acting, playing the role of this archaic Appalachian songstress. Fortunately, the role becomes her.","torrent":{"xt":"urn:btih:f94ee9b39626093f5f68fe3060fc9c89b1520562","amp;dn":"Holly+Golightly+and+the+Brokeoffs+-+You+Can%27t+Buy+A+Gun+When+You","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f94ee9b39626093f5f68fe3060fc9c89b1520562","infoHashBuffer":{"type":"Buffer","data":[249,78,233,179,150,38,9,63,95,104,254,48,96,252,156,137,177,82,5,98]},"announce":[],"urlList":[]}}