{"title":"Man of Steel (Byrne)","uid":4253032,"size":50046149,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f9d98398dcb98df3efa6943d7289c1852b6f1584&amp;dn=Man+of+Steel+%28Byrne%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":8,"time":1214102429,"description":"By request from the forums, this torrent includes the six-issue mini series by John Byrne that attempted to redefine the post-crisis on infinite earths Superman Mythos.\n\nDC Comics retired the Silver Age version of Superman in 1986, after the publication of Crisis on Infinite Earths. Just before the character&amp;#039;s revamp, the Silver Age Superman was given a sendoff in the two-part story Whatever Happened to the Man of Tomorrow? published in Superman (Vol. 1) #423 and Action Comics #583, written by Alan Moore with art by Curt Swan. Although the new Modern Age version of Superman is said to have already been active for many years, most previous Superman appearances and elements were rendered out of continuity by John Byrne&amp;#039;s Man of Steel.\n\nIn Byrne&amp;#039;s version, Superman came from the planet Krypton which was re-imagined as a cold, sterile world in deep contrast to the wonderworld of the past 48 years. Once Kal-El&amp;#039;s rocketship (containing genetic materials and a birthing-matrix which resulted in him being &quot;born&quot; on Earth) reached Earth he was adopted by Martha and Jonathan Kent. Instead of bringing him to an orphanage only to adopt him later, the Kents pretended that he was their own son. In the new version, Clark&amp;#039;s powers developed gradually and he never assumed the identity of Superboy, and unlike most pre-existing versions, Ma and Pa Kent survived throughout Clark&amp;#039;s adult years and remain important supporting characters in the comics to this day.\n\nAlso, Superman&amp;#039;s powers were scaled down, removing several of his more fantastic abilities in an attempt to make the stories more exciting. Superman&amp;#039;s strength and speed were still immense, but there was a feeling of limits to them. In Metropolis, he faced a revised rogues gallery, including a new version of Lex Luthor who was recreated as an evil billionaire and philanthropist.\n\nDue perhaps to the elder Kents surviving into Clark&amp;#039;s adulthood, another Byrne change was the relationship between Superman and his &quot;normal&quot; alter-ego. In line with the majority of superheroes Byrne put the emphasis on Superman being a disguise for Clark Kent. Previously the theme had been that Kent was a &quot;secret identity&quot; for Superman: in an adventure published in the 1960s, Kent finds himself at a loose end when staff at the Daily Planet go on strike and seriously considers it a chance to try out a new identity in case he has &quot;to abandon [his] Clark Kent role permanently&quot;. His options include becoming a full-time policeman or ever a mere tramp &quot;whom no one would ever suspect of being the Man of Steel.&quot;[3]\n\nThere was also his relationships with other heroes, most notably Batman. From the 1940s to the 1970s, they had always been depicted as close friends and allies: the &quot;World&amp;#039;s Finest&quot;. From the 1980s, however, it was depicted it as an edgy and uneasy one: grudging respect and uneasy friendship due to their vast differences. After their first, tension-filled meeting, Batman considers that in &quot;another reality&quot; he and Superman may have been friends.[4]\n\nSome fans debated whether the more drastic changes were necessary, and some of the more traditional historical elements Byrne removed from the backstory were later restored. Byrne himself quit the books after a few years because he felt DC was not supporting the changes he made. But Byrne&amp;#039;s changes became the template for Superman&amp;#039;s origin and characterization for almost two decades. Most notably, his alterations to Lex Luthor, altering him from a scientifically oriented villain to a businessman, and having Ma and Pa Kent kept alive as supporting characters.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:f9d98398dcb98df3efa6943d7289c1852b6f1584","amp;dn":"Man+of+Steel+%28Byrne%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9d98398dcb98df3efa6943d7289c1852b6f1584","infoHashBuffer":{"type":"Buffer","data":[249,217,131,152,220,185,141,243,239,166,148,61,114,137,193,133,43,111,21,132]},"announce":[],"urlList":[]}}