{"title":"Democracy Now - 23 dec 2011","uid":6907756,"size":453282355,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fb49061a12cb6980413677029d01a15f50e9fbd3&amp;dn=Democracy+Now+-+23+dec+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1324662745,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Dec 23, 2011\n\n- Bradley Manning Pre-Trial Hearing Concludes\n- Bohener Relents on Tax Cut Deal, Pushes Keystone\n- 40 Killed in Damascus Suicide Attack\n- Egyptians Rally in Tahrir Against Military Rule\n- Pakistan Rejects U.S. Probe of Deadly NATO Bombing\n- U.S., Russia Spar Over Probe of Libyan Civilian Deaths\n- Massive Shell Oil Spill Approaches Nigerian Coast\n- Federal Judge Blocks Key Provisions in South Carolina Anti-Immigrant Law\n- Thousands Take Part in California Nurses' Strike\n- Police Clear Occupy Camps in Albany, Berkeley\n- U.S. Asks Science Journals to Withhold Study Findings\n\n\nSpecial reports\n\n- U.S. Troops Charged After Fellow GI, Hazing Victim Danny Chen Found Dead in Afghanistan\n\nThe family of 19-year-old Danny Chen has demanded an investigation after the Army Private was found dead in Afghanistan of what military authorities say was a self-inflicted gunshot wound to the head. Chen's family says before his death he reported being subjected to racist hazing, with soldiers throwing rocks at him and calling him ethnic slurs. Now the Army has charged eight soldiers involved in his death with crimes ranging from dereliction of duty to manslaughter. We speak to Danny's first cousin, Banny Chen, who says: &quot;We still don't know if [his death] was suicide or if someone else pulled the trigger.&quot; We're also joined by New York City Council Member Margaret Chin, who helped Chin's family obtain a meeting with the Pentagon and is demanding the military screen recruits for racial bias.\n\n\n- As Bradley Manning Hearing Concludes, Military Prosecutors Say WikiLeaks Disclosures Aided al-Qaeda\n\nLawyers made their closing arguments Thursday in the military pre-trial hearing for accused Army whistleblower Bradley Manning, which will determine whether he should face a court-martial for allegedly leaking classified video and diplomatic cables to WikiLeaks. &quot;[The defense] suggested that the original classification authorities for this classified information that Bradley Manning is accused of releasing actually take the stand... next time because they keep saying that there is a risk to national security and he would like to see them go under oath, and they would probably perjure themselves if they did,&quot; says Firedoglake blogger Kevin Gosztola, who was present at Manning's hearing. He notes that the prosecution &quot;linked Bradley Manning to aiding al-Qaeda ... that essentially is criminalizing national security journalism ... what they're saying is anybody who puts this information on the internet - if you do a report on a drone strike, if you do a report on anything related to military operations, and al-Qaeda reads it, you could be accused of aiding the enemy.&quot;\n\n\n- Newt Gingrich's Campaign Resurgence Funded by Secretive Coterie of Super PACs, Wealthy Backers\n\nWith the Iowa caucus less than two weeks away and the Republican presidential race still up for grabs, we take in an in-depth look at the state of politics and money and how last year's U.S. Supreme Court ruling in Citizens United v. Federal Election Commission has altered campaign fundraising since it opened the floodgates for unlimited corporate spending on election campaigns. Several recent exposes reveal how Newt Gingrich has skirted campaign finance rules to raise millions of dollars in unlimited donations from billionaire backers and big industry. McClatchy Newspapers recently reported Gingrich helped bankroll his resurrection as a candidate by exploiting a gap in federal campaign finance laws to create a political money machine that raised $54 million over five years. Meanwhile the Center For Public Integrity has published new details on how Gingrich has the backing of two so-called super PACs that raise unlimited donations, but legally must operate independently of the campaign. We speak with Peter Stone, a reporter with Center for Public Integrity who has covered lobbying and campaign finance issues for the past two decades, and McClatchy investigative reporter Greg Gordon.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:fb49061a12cb6980413677029d01a15f50e9fbd3","amp;dn":"Democracy+Now+-+23+dec+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb49061a12cb6980413677029d01a15f50e9fbd3","infoHashBuffer":{"type":"Buffer","data":[251,73,6,26,18,203,105,128,65,54,119,2,157,1,161,95,80,233,251,211]},"announce":[],"urlList":[]}}