{"title":"Guerrillas of Peace [mp3] Blase Bonpane - ScanSoft reads","uid":8365414,"size":182182455,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fb6735c60750e089466b146dd4f21f107bb85475&amp;dn=Guerrillas+of+Peace+%5Bmp3%5D+Blase+Bonpane+-+ScanSoft+reads&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"UnviolentPeacemaker","files":37,"time":1365751425,"description":"Blase Bonpane has lived and worked with the realities of liberation theology for more than a quarter of a century... (more below)...\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE UnviolentPeacemaker torrents.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?  Thanks.  UnviolentPeacemaker\n\n\nNOTICE: WHY SCREW THE PUBLISHERS, WRITERS, CREATORS?  When you have the $$$, buy this download, preferably from a locally owned store.  &quot;Universal Family&quot; is the ONLY Revolution.  Hypocrisy kills.\n\n\nNOTICE: This book is read by the HQ ELECTRONIC VOICE SCANSOFT DANIEL.  Don't like that?  Don't download it.  Don't complain.  Don't get in the way.\n\n\nThis book from the\n\nLIBRARY OF UNVIOLENT REVOLUTION - AGAPE, UNIVERSAL FAMILY\n\n'UnviolentPeacemaker' on ThePirateBay.\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/UnviolentPeacemaker/&lt;/a&gt;\n\nHundreds more like it, in that library UnviolentPeacemaker.\n\n\nTHOSE CLUELESS TO THE PLANETARY EMERGENCY OF IMPENDING ECOCIDE SHOULD GO ELSEWHERE.  These uploads were created for me, to equip me to Wage All-out Unviolent War for my current and future 204 billion children.  If you are looking for style over substance this site and these materials are not for you.  THE PRESENT AND FUTURE KIDS ARE SCREAMING AT US TO SAVE THEIR FUTURE, not whether there are typos, hugely rough parts, audio artifacts, pauses, footnote numbers, etc.  HAVE THE DECENCY NOT TO COMPLAIN.\n\n\nALSO, CUT ME SOME SLICK.  THIS UPLOAD WAS PREPARED ON 04.11.13, THIS DAY 14 OF MY 'ECOCIDE'S DEATH FAST, ZERO CALORIES,' RACING TO FINISH THIS PROJECT SO I CAN ABSTAIN FROM LIQUIDS AS WELL BY MIDNIGHHT SUNDAY NIGHT. GOOGLE 'start loving.' Also GOOGLE, 'tracking plan b'  So, I'm working with a 23,400 calorie deficit, and a sleep deficit the last 4 days of near 8 hrs x 4 = 32 hours, so I can get this done, before I am.  (Hmmm, you too are this committed to averting ecocide so out kids and grandkids have a Life, like you and I did, right?)\n\n\nWITHIN WEEKS I'LL BE GONE.  FOR CREATION'S SAKE, SEED THESE.  KEEP EVERY ONE, ESPECIALLY THE WEAKEST, ALIVE WHILE I'M GONE.  OK? STARTING NOW?\n\nOH! A final note.  This project, on now a 4 day near zero sleep sprint, may be A. one of the wonders of human endurance, or B. full of technical disasters, errors....  I've devoted my life to have it be the former.  If it is the latter, ROFL, I WON'T BE AROUND FOR YOU TO WHINE AT, RIDICULE, BLAME!!!!  FIX IT, BUILD ON IT. DO YOUR PART!  UnviolentPeacemaker\n\n-------\n\n...In Guerrillas of Peace, Bonpane takes the reader from the high country of Huehuetenango in Guatemala to intensive grass roots organizing in the United States. He shows that we cannot renew the face of the earth and coexist with the torturing, murdering governments of Guatemala and El Salvador, and their accomplices in Washington. We cannot say the Lord's Prayer and fail to do the will of God on earth.A new person is being formed. This person, this revolutionary person insists that human values be applied to government. This leads to a ruthless and revolutionary conclusion...children should not be free to die of malnutrition, no one should be allowed to die of polio or malaria, women should not be free to be prostitutes, no one should be free to be illiterate. The loss of these freedoms is essential for a people to make their own history. This is the Theology of Liberation, the kind of theology that made the early Church an immediate threat to the Roman Empire.from the IntroductionBlase Bonpane, former Maryknoll priest and superior, was assigned to an expelled from Central America. UCLA professor, contributor to the L.A. Times, N.Y. Times, commentator on KPFK, and author of many publications, he is currently Director of the Office of the Americas, a broad-based educational foundation dedicated to peace and justice in this hemisphere.\n\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Blase_Bonpane&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Blase_Bonpane&lt;/a&gt;\n\nBlase Bonpane is Director of the Office of the Americas (based in Los Angeles, California) which he co-founded with his wife Theresa in 1983. His attention has been primarily on human rights and identification of illegal and immoral aspects of domestic and foreign policies of the United States.\n\nBonpane served as a Maryknoll priest in Guatemala and was assigned by the Cardinal of Central America as National Advisor to Centro Capacitacion Social, a center for university and high school students working in the field with indigenous people on matters of health, literacy and labor organization. He was expelled from that country in 1967 in the midst of a revolution. (Washington Post, February 4, 1968, &quot;A Priest in Guatemala.&quot;)\n\n\n","torrent":{"xt":"urn:btih:fb6735c60750e089466b146dd4f21f107bb85475","amp;dn":"Guerrillas+of+Peace+%5Bmp3%5D+Blase+Bonpane+-+ScanSoft+reads","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb6735c60750e089466b146dd4f21f107bb85475","infoHashBuffer":{"type":"Buffer","data":[251,103,53,198,7,80,224,137,70,107,20,109,212,242,31,16,123,184,84,117]},"announce":[],"urlList":[]}}