{"title":"Hitch Hiking Hippies (1965)","uid":5903463,"size":568352822,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fc8fefb92d40201867bfbe09045e8f321fe9847a&amp;dn=Hitch+Hiking+Hippies+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"webchella","files":-1,"time":1287761678,"description":"Hitch Hiking Hippies (1965)\n &lt;a href=&quot;\nhttp://adnlt.com/movies/449350-1465047.hitch_hiking_hippies_1978.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://adnlt.com/movies/449350-1465047.hitch_hiking_hippies_1978.html&lt;/a&gt;\n\nStudio  Historic Erotica \nRelease Date  Sep 02, 1978\nCategory  Classic \nStarring: Katie Jerkins, Albert Rocks, Alicia Caterson, Angel Hastings, Bill Summers, Julian More, Tabitha Jone, Charles Mayson, Gabriel Medow, Samantha Depie, Abbey Ray, Leonarda Timis, Sherry Easse, Paul Jenner  \n\nScene 1\nIn this vintage porn clip, 2 hippie chicks hitchhike and are picked up in a Volkswagen van. They park, and the redheaded girl sucks one of the guys cocks in the back of the van. She plays with his balls while she blows him, and he thrusts his cock in and out of her mouth while the driver and blonde girl look on from the front seat. He gets closer to cumming as she sucks him off harder and faster, and she jerks out his hot load of cum all over her hand while he moans and smiles in pleasure. These hitch hikers know how to pay somebody back for a lift. \n\nKatie Jerkins, Albert Rocks \n\n\nScene 2\nHitch Hiking Hippies Having A ThreesomeHitch Hiking Hippies Having A ThreesomeHitch Hiking Hippies Having A ThreesomeHitch Hiking Hippies Having A ThreesomeHitch Hiking Hippies Having A ThreesomeHitch Hiking Hippies Having A ThreesomeDownload this Scene \nPlay this Scene \nView Screenshots \nAdd to Favorites Bill picked up Alicia Caterson and Angel Hastings who were hitch hiking. He took them back to his house and they started to party. The booze and weed flowed and soon they were naked and one of them was riding his cock while the other rode his face. He bent Alicia over and fucked her good from behind then he switched it up and bent Angel over. He went back and forth between them taking turns fucking them both then he laid back and let them both use their mouths and hands to make him cum. He shot his hot load and they licked him clean.\n\nAlicia Caterson, Angel Hastings, Bill Summers \n\n\nScene 3\nSexy Hitchhikers Put Out For A Free RideSexy Hitchhikers Put Out For A Free RideSexy Hitchhikers Put Out For A Free RideSexy Hitchhikers Put Out For A Free RideSexy Hitchhikers Put Out For A Free RideSexy Hitchhikers Put Out For A Free RideDownload this Scene \nPlay this Scene \nView Screenshots \nAdd to Favorites In this excellent 1970s fuck vid, a couple of pretty blond hitchhikers get taken back home by a pair of older studs for a hardcore foursome fuck. These eager blondes don't have any money, and they know that if they want to get a free ride, they're going to have to ride some cock! Most of this video is filmed in close-ups, either of the girls' faces or of the cocks sliding in and out of the hairy pussies, so it can be a little bit difficult to tell exactly what is going on. There is also an excellent soundtrack with plenty of hot groans and moans! Rest assured that both of these sweet pussies get fucked long, hard and deep.\n\nJulian More, Katie Jerkins, Tabitha Jone, Charles Mayson, Gabriel Medow \n\n\nScene 4\nThere are good and bad things about sex in the '60sThere are good and bad things about sex in the '60sThere are good and bad things about sex in the '60sThere are good and bad things about sex in the '60sThere are good and bad things about sex in the '60sThere are good and bad things about sex in the '60sDownload this Scene \nPlay this Scene \nView Screenshots \nAdd to Favorites This clip is a flashback to an earlier time in the mid to late 1960s when hippies like Samantha Depie were a part of the Free Love movement in the United States. The great news back then is that you could bang lots of slutty women who felt empowered by the fact that men wanted to have sex with them. The bad news is that back then hairy pussy was in fashion and that means having to spit out pubes any time you lick their twats.\n\nSamantha Depie \n\n","torrent":{"xt":"urn:btih:fc8fefb92d40201867bfbe09045e8f321fe9847a","amp;dn":"Hitch+Hiking+Hippies+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8fefb92d40201867bfbe09045e8f321fe9847a","infoHashBuffer":{"type":"Buffer","data":[252,143,239,185,45,64,32,24,103,191,190,9,4,94,143,50,31,233,132,122]},"announce":[],"urlList":[]}}