{"title":"Epica","uid":9541482,"size":2200291993,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fc9c91052b37d7e6409adbbb1ea65a5dfd0ef4ea&amp;dn=Epica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"pBtu6RHs","files":-1,"time":1391053468,"description":"Epica is a Dutch symphonic metal band, founded by guitarist and vocalist Mark Jansen subsequent to his departure from After Forever.\n\nThey are known for their symphonic sound and the use of female vocals and male growls, performed by Simone Simons and Mark Jansen respectively. All six members participate in composing their songs, whilst their lyrics are primarily written by Simons and Jansen. Their songs largely deal with philosophical topics, including science, religion, and world events.\n\nIn 2003, Epica's debut album The Phantom Agony was released through Transmission Records. Consign to Oblivion followed in 2005, and debuted at No. 12 in the Dutch charts. They moved labels to Nuclear Blast following Transmission's bankruptcy, and in 2007, released their third studio album The Divine Conspiracy, which charted at #9 in the Netherlands. 2009's Design Your Universe was met with yet greater success, debuting at #8 in the Dutch Albums Chart, and charting across Europe, also garnering much critical acclaim.\nEpica's fifth studio album Requiem for the Indifferent was released in 2012. Well received by critics, it met with international success, entering the USA's Billboard 200 at #104, and Japan's Oricon Albums Chart at #172.\n\nOn March 23, 2013, Epica celebrated their 10th anniversary with a huge live event, called Retrospect, at the Klokgebouw, Eindhoven, hosting a live orchestra from Hungary along with special guests Floor Jansen and former Epica members Ad Sluijter, Jeroen Simons, and Yves Huts. During the show a DVD release of the show was confirmed.","torrent":{"xt":"urn:btih:fc9c91052b37d7e6409adbbb1ea65a5dfd0ef4ea","amp;dn":"Epica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc9c91052b37d7e6409adbbb1ea65a5dfd0ef4ea","infoHashBuffer":{"type":"Buffer","data":[252,156,145,5,43,55,215,230,64,154,219,187,30,166,90,93,253,14,244,234]},"announce":[],"urlList":[]}}