{"title":"Crossed (v1 - v4 &amp; Wish You Were Here + Specials) (2008 - On","uid":11149160,"size":4873226047,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:fe326afea3decff965b963efd20e5b7cad5b9570&amp;dn=Crossed+%28v1+-+v4+%26amp%3B+Wish+You+Were+Here+%2B+Specials%29+%282008+-+On&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"nemesis43","files":213,"time":1412303451,"description":"Crossed (v1 - v4 &amp; Wish You Were Here + Specials) (2008 - Ongoing) (Digital) (Empire)\n\n\nThe story follows survivors dealing with a plague that causes its victims to carry out their most evil thoughts. Carriers of the virus are known as the Crossed due to a cross-like rash that appears on their faces. This contagion is primarily spread through bodily fluids, which the Crossed have used to great effect by treating their weapons with their fluids, as well as through other forms of direct fluidic contact such as rape and bites, assuming the victim lives long enough to turn. A major difference between the Crossed and other fictional zombie or insanity-virus epidemics (i.e. in the film 28 Days Later), is that while the Crossed are turned into homicidal violent psychopaths, they still retain a basic human-level of intelligence: thus they are still capable of using firearms, motor vehicles, tools like bows and arrows, and of setting complex traps.\n\nThe contagion spread across the entire world, with the Crossed killing, raping, engaging in cannibalism and maiming for fun, with governments and military overwhelmed; friends and family butcher each other with anything they lay their hands on, and cities are turned into vast charnel houses. Much of the Middle East is wiped out when Israel deploys nuclear weapons. The last organized act by the US government is to shut down as many nuclear power plants as possible and then kill the nuclear scientists &amp; technicians to prevent them from reactivating the plants. One by one the remaining military bases are overrun. Soon human civilization is all but gone, and mankind is an increasingly endangered species.","torrent":{"xt":"urn:btih:fe326afea3decff965b963efd20e5b7cad5b9570","amp;dn":"Crossed+%28v1+-+v4+%26amp%3B+Wish+You+Were+Here+%2B+Specials%29+%282008+-+On","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe326afea3decff965b963efd20e5b7cad5b9570","infoHashBuffer":{"type":"Buffer","data":[254,50,106,254,163,222,207,249,101,185,99,239,210,14,91,124,173,91,149,112]},"announce":[],"urlList":[]}}