{"title":"David Icke - The Master Collection (Audio)","uid":4957797,"size":638243232,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:feb3003c9d9bded01330e451e203cacb3a2a50b0&amp;dn=David+Icke+-+The+Master+Collection+%28Audio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eXPer1ence","files":30,"time":1245185254,"description":"________________________________________________________________________\n\nMore than 44 hours of David Icke lectures spanning fourteen years.\n\nFrom 1994 to 2008.\n\n1994 xx xx [The Robots Rebellion]\n1996 xx xx [Turning of the Tide]\n1999.12.xx [Ruled by the Gods]\n2003.06.xx [Secrets of the Matrix]\n2004.02.24 [Freedom Road]\n2005-07-23 [Live at Mount Shasta]\n2006-05-06 [Freedom or Fascism]\n2008-07-06 [Big Brother the Big Picture]\n2008-07-14 [Oxford Union]\n2008-09-xx [Beyond the Cutting Edge]\n\nThis collection does not include the Arizona Wilder interview or the\nCredo Mutwa &quot;Reptilian Agenda&quot; interview. Other official releases\nmight not be here, just let me know (post a comment on TPB if you\nknow of any other official or unofficial video of David Icke talking\nand I might reseed a new collection) \n\nThis collection is is meant to be David Icke on his own, just his info.\n\nAlso if you can fill in any of the &quot;xx&quot; dates it would be appreciated.\n\nMaybe one of the most amazing finds in all these files was in Robots\nRebellion back in 1994 where David Icke tells us that John Kerry (then\na Governor) is a member of the Skull &amp; Bones sociey. This was more than\nten whole years before people like Alex Jones eventually told us!\n\n________________________________________________________________________\n\nAll files are:\n\nFORMAT: | .MP3 |\nBITRATE: | 32kbps | 22,050Hz/24,000Hz | 16-bit | Mono |\nDURATION: | Varied |\n\n________________________________________________________________________\n\nAll fit easily onto a standard 700Mb CD for MP3 players.\n\nIn fact these will easily fit onto an ancient 650Mb CD.\n\nIf you are burning these to CD you should run this file:\n\n&quot;Create a CD folder.bat&quot;\n\n-------------------------------------------------------------------------\nDO NOT RUN THIS FILE IF YOU ARE DOWNLOADING THIS COLLECTION AS A TORRENT!\nWAIT FOR THE TORRENT TO COMPLETELY FINISH DOWNLOADING!\n-------------------------------------------------------------------------\n\nIf you run this file &quot;Create a CD folder.bat&quot; it will copy all the\nDavid Icke lectures to a new folder simply called &quot;CD&quot; and once it\nhas finished, will leave you with a nice easy managable folder full\nof MP3's that will be compatible on all MP3 capable CD players.\n\nThis file &quot;Create a CD folder.bat&quot; does all the hard work for you!\n\nNo need to go through renaming all the files to 8.3 standards. Once\nyou have created the CD folder and it has all 28 files named as\n00000001.MP3 and so on up to 00000028.MP3 you can than simply burn\nthose files (not the CD folder, the actual files themselves) onto\na CD for playback on MP3 players that take CD's.\n\nThese lectures will all be in the exact same order as the original\nfiles, so the file &quot;00000001.MP3&quot; will be &quot;The Robots Rebellion&quot;\nthen &quot;00000002.MP3&quot; will be &quot;Turning of the Tide&quot; and so on.\n\nI know from stupid MP3 players in the past, some CD-MP3 players\nwill not be able to &quot;see&quot; inside folders on the CD, but they will\nalways be able to play the files as long as the files are there\non the CD as soon as you open the CD.\n\nSome MP3 players will refuse to play a file that is longer than\n8 characters, especially older MP3 players.\n\nFor example the first file in this collection:\n\n[The-Robots-Rebellion]-[Neptune-Theatre]-[Liverpool]-[England]\n\nHas a massive long file name as do all the files, if you run the\nincluded .bat file then this MP3 would be copied and renamed to:\n\n00000001.MP3\n\n________________________________________________________________________\n\nThese files are at such a low bitrate in order to fit them all onto\none single CD. Because these lectures have no music, the clarity is\nquite unimportant and David Icke's voice is perfectly clear, even at\njust 32kbps and in mono.\n\nIt equates to you getting 60:00 minutes of audio for just 13.7 MB\nof disk space!\n\nMost of these MP3's came from video's that also have a slideshow\npresentation.\n\nIn parts David Icke points to the slides and with these MP3's you cannot\nsee this, for the best experience you should buy David Icke DVD's to\nsupport him. I personally think the guy has risked a lot and busted his\nass to bring this kind of info to everyone's attention - consistently.\nHe should get all the financial support possible. He is extremely\nintelligent and most of the time his DVD's just get pirated - this MP3\npackage gives you all the audio, but none of the video. David Icke never\nofficially released MP3's like this and all audio is ripped from the\nvideo's whether they are DVD or public domain.\n\nI also think though, that this info is NOT entertainment and that we\nall have a right to at least hear it, without being called &quot;pirates&quot;.\n\nConsidering that David Icke exposes many crimes of the elites, this is\na matter of public concern, its not Metallica folks, its serious.\n\nHopefully these MP3's can bring attention to David Icke and maybe some\ndonations or DVD sales that he would not have otherwise had.\n\n________________________________________________________________________\n\n","torrent":{"xt":"urn:btih:feb3003c9d9bded01330e451e203cacb3a2a50b0","amp;dn":"David+Icke+-+The+Master+Collection+%28Audio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"feb3003c9d9bded01330e451e203cacb3a2a50b0","infoHashBuffer":{"type":"Buffer","data":[254,179,0,60,157,155,222,208,19,48,228,81,226,3,202,203,58,42,80,176]},"announce":[],"urlList":[]}}