{"title":"Mannen van de Radio collectie (Dutch!)","uid":5370474,"size":449464027,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:fecef53f0ed1c01bc8a481544290779211102ba0&amp;dn=Mannen+van+de+Radio+collectie+%28Dutch%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"marcel_at_oxle","files":1,"time":1266365284,"description":"Hoogstaand radiocabaret!!\n\nVan Da Madman! http://mannen.madpalace.nl\n\n06-lijn   \t Telefoongesprek over blonde DD-cup meisjes.  \t   \t\n1 april \tGerard Niemeijer en een uit de hand gelopen grap. \t\t\n27 caravans \tIets leuks kopen van je gewonnen geld. \t\t\n3000-delig zakmes \tIn het zakmes van Henk zit vanalles. \t\t\n3000 visitekaartjes \tIemand krijgt totaal verkeerde kaartjes. \t\t\n87 nieren \tZoon met 87 nieren geeft zijn vader er geen. \t\t\n\nAanhangers \tMan is messias vanwege dronken uitspraken. \t\t\nAanrijdingen \tVaak ongelukken op dezelfde plek. \t\t\nAdelheid \tZweverige twentse man mist zijn vriendin. \t\t\nAleen op de\nGrebbeberg \tMeneer Beentjes liegt over de oorlog. \t\t\nCD  Album\nAls ze het\necht niet had gewild \t... dan zou ze het toch wel hebben gezegd. \t\t\nAmateuraborteur \tGunter Schuman vertelt hoe hij begonnen is. \t\t\nCD  Album\nAmsterdammer \tEen rasechte Amsterdammer ... geboren en getogen. \t\t\nAndere sirene \tGeweldig idee voor een sirene met Jenny Arean. \t\t\nArchitect \tInterview met man die korte antwoorden geeft. \t\t\nAssepoester \tDuitse rock-opera over het historische thema. \t\t\nAstma \tTrudie Olieslagers is aan de kant gezet. \t\t\nAubergines \tEen enorme stapel van deze bederfelijke vrucht. \t\t\nCD  Album\n\nBaantjes \tOngeschikt vanwege de fascinatie voor het vak. \t\t\nBaby \tWat moet je tegenwoordig tegen een baby zeggen? \t\t\nBald Gefkens \tEen liedje voor de razende Bald Gefkens. \t\t\nBallonnen vouwen \tHans Geldrop is kunstenaar. \t\t\nCD  Album\nBelletje trekken \tEen oude vrouw de hele nacht lastig vallen. \t\t\nBen Hur \tRob de Lunger gaat nederlands vervolg maken. \t\t\nBespiegelen \tIets over de toekomst uit de doeken doen. \t\t\nBij de vrouwtjes \tIk lig gewoon goed bij de vrouwtjes. \t\t\nBijna dood-ervaring \tIn de verte dacht hij een tunnel te zien ... \t\t\nBoek over robots \tGijs Walraven is bang van robotten. \t\t\nBonvivant \tKees van Asperen is een echte levensgenieter! \t\t\nBoontjes doppen \tUitdrukkingen die veranderd zijn. \t\t\nBoswandeling \tVerdwaald tijdens een boswandeling in Noorwegen. \t\t\nBrullend hert \tKinderboek Brullend Hert belooft enorm succes. \t\t\nBuitenlandse man \tHij is clown en neemt soms kinderen mee naar huis. \t\t\nBusreizen \tLoterij voor busreizen met alle risico's van dien. \t\t\n\nCalamiteitenman \tCalamiteit is gerelateerd aan struikrovers. \t\t\nCD  Album\nCamel Trophy \tHard scheuren door de ongerepte natuur en dorpjes. \t\t\nCarnaval \tEugÃƒÂ¨ne viert graag carnaval alleen ... thuis! \t\t\nCD  Album\nCD presentatie \tLive uitreiking door Theo Maassen. \t\t\nChris Oakland \tDe invloedrijke muziek van Max Boer uit Sittard. \t\t\nClint Eastwood \tAuto-biografie over een man die alleen TV kijkt. \t\t\n\nDarter \tVervelend incident tijdens open kampioenschappen. \t\t\nDas waar \tJa, dat is ook waar wat je zegt. \t\t\nDe dood \tMevr. Van Rinsweek stond oog in oog met de dood. \t\t\nDe wereld rondgelopen \tVreemde snuiter voelt zich herboren. \t\t\nDromen \tMannen vertellen over hun waanzinnige dromen. \t\t\nDrugsgebruiker \tDrugsgebruikers kei hard stampen in het gezicht. \t\t\nDruiper \tFrancois LeGrand wil in zijn nakie lopen. \t\t\nDuivel\nin al zijn vormen \tPastoor Dunkers weet hoe de duivel eruit kan zien. \t\t\nDuiven \tVoor het repeteren even een paar duiven gooien. \t\t\n\nEÃƒÂ©n Europa \tDuitser kijkt terug op 50 jaar bevrijding. \t\t\nEen Wijf \tZe zeien tegen me dat ik ook een wijf moest. \t\t\nEigen mening \tDe stem slaat over als je echt iets serieus wil zeggen. \t\t\nElvis Presley \tFenomeen redt man na aankoop lamp. \t\t\nEmigrant \tAlbert Vossemarkt en zijn club in Canada. \t\t\nEtenstijd \tNatte pap eten met een houten lepel. \t\t\nEtiquette en hygiene \tMan lapt regels van hygiene aan zijn laars. \t\t\n\nFamilie \tNegatief gevoel bij diverse onthullingen. \t\t\nFan van de koningin \tTico de Bladder rijdt mensen aan. \t\t\nCD  Album\nFatima \tEen boer die een waarzegster bezoekt op de kermis. \t\t\nFilm \tEen record-subsidie voor anderhalf uur fist-fucken. \t\t\nFluitende geit \tJoost de Pont heeft zijn geit Egbert leren fluiten. \t\t\nFotograaf \tVoorbereidingen op de komst van een fotograaf. \t\t\nFrisdrank \tGulst met haring en spruitjes-smaak. \t\t\nCD  Album\n\nGangmaker \tJozef gooit hoge ogen in de discotheek. \t\t\nGarcia Lopez \tEen oproep tot rehabilitatie voor Garcia Lopez. \t\t\nGemiste kansen \tEÃƒÂ©n man van de radio bereid je voor op de nacht. \t\t\nGestolen cello \tNa veel treurigheid wederom ellende door een neger. \t\t\nGevoel \tHet doet wel pijn, maar het is ontzettend fijn! \t\t\nGevoeligheden \tHet ligt aan het weer en aan de diameter. \t\t\nGevonden voorwerpen \tProgramma dat gevonden spullen behandeld. \t\t\nGoede voornemens \tLive interview deel 1 door Pieter Bouwman. \t\t\n\tLive interview deel 2 door Pieter Bouwman. \t\t\n\tLive interview deel 3 door Pieter Bouwman. \t\t\n\tLive interview deel 4 door Pieter Bouwman. \t\t\n\tLive interview deel 5 door Pieter Bouwman. \t\t\n\tLive interview deel 6 door Pieter Bouwman. \t\t\nGoeie humor \tGeen leven zonder goeie humor. \t\t\nGoeie ouwe tijd \tToen was het totaal anders als nu. \t\t\nGolden\nVoices in Paradise \tErik en Frans met Disco Mania. \t\t\nGrootvader \tFan van de holocaust kon je ziel pijnlijk raken. \t\t\nGruwelijke\ndingen dichter \tMan heeft zich flink laten gaan. \t\t\n\nHallo \tMan komt naar De Avonden maar er is niemand. \t\t\nHaydn \tDe persoon Hayd is een misselijk ventje. \t\t\nHelderziende \tOplichter maakt misbruik van wanhopige mensen. \t\t\nCD  Album\nHele makkelijke \tAls ze niet doen wa ik wil ben ik een hele lastige. \t\t\nHells Angels \tDisciminatie in het restaurant van J. Braakhekke. \t\t\nHenk belt Bert \tHallo Bert. Ik versta je luid en duidelijk. Hallo Henk? \t\t\nCD  Album\nHij zit erin \tWat doe jij als hij er helemaal in zit? \t\t\nHittegolf \tDe rol van hittegolf spelen in een film. \t\t\nCD  Album\nHoe\ngaat het met jou? \tHet gaat niet zo goed als Jo doet voorkomen. \t\t\nHompen kaas \tDe kaas d'r in stompen met een hamer. \t\t\nHondje \tAli is een heel erg bang hondje. \t\t\nHongerstaking \tHet is eigenlijk ook wel rustig zo. \t\t\nHopsy Flopsy \tEen programma voor jullie: bier, worst en pap eten. \t\t\nHuidprobleem \tDe huid is helemaal rood met putten en bulten. \t\t\nHuidziekte \tToekomst van een man die alles open krabt. \t\t\nHuurbazen \tAgressie tegens de huurbaas van een dame. \t\t\n\nIn de kont \tIk dacht dat je er alleen van voor d'r in kon. \t\t\nCD  Album\nIn de rats \tFlink in de rats door eigen schuld. \t\t\nIn de reet \tPeter heeft Irene in de reet geneukt. \t\t\nIn het onderwijs \tEen man wil na 2 jaar LTS en een uitkering. \t\t\nIncompetente arts \tHet maakt niet uit dat ie zwart was... \t\t\nIndianencultuur \tEen lezer van boeken over indianen. \t\t\nIndruk \tJaloers op Adje van de Tillaar en Teuntje de Bok. \t\t\nIrritatie \tRelatie beschouwing. \t\t\n\nJaap Stobbe \tEen levensgroot kunstwerk van papier mache \t\t\nCD  Album\nJeugdherinneringen \tAls kind... \t\t\nJezus \tHet voelt goed om in Jezus te geloven. \t\t\nCD  Album\nJongleursact \tRudy is een spastische jongleur met messen. \t\t\nJoost \tEen antwoord op al je vragen ... \t\t\n\nKamer reserveren \tOnno Vesd belt met het Carlton Crown hotel. \t\t\nKaraoke wedstrijd \tIemand die een karaoke wedstrijd wil doen. \t\t\nKarl May \tVerwarring rondom boeken en lachfilms. \t\t\nKinderen \tGenieten als ze met hun blote reet op hun muil vallen. \t\t\nKlaarkomen \tWijven zijn niet blij met diverse soorten vocht. \t\t\nKleine meisjes \tOpwinding van een leraar over de uitdaging. \t\t\nKniesoor \tEen man legt bergen zout op alle slakken. \t\t\nKudde \tHet spel van dieren sturen met een helicopter. \t\t\n\nLakeien \tMusical met tegenpolen Bart en Robert. \t\t\nLekker \tOndeugende vragen over wat iemand lekker vindt. \t\t\nLens \tEen lens achter de oogbal. \t\t\nLied \tMisschien zingt Bob nog eens een mooi lied... of niet! \t\t\nLift \tGezellig vast in een lift met een ouwe mevrouw. \t\t\nLijk \tMan laat zich gaan op begrafenis. \t\t\nLouis van Gaal \tEen gesprek met de miskende ÃƒÂ©chte Louis van Gaal. \t\t\nLuciferdoosjes \tPaul Dillen heeft geen verzameling luciferdoosjes. \t\t\nLustrum \tLustrum voor ontuchtpleger. \t\t\n\nMannen\nover vrouwen \tWaar blijven de vrouwtjes in de winter? \t\t\nMannen\nover vrouwen 2 \tVan sommige type vrouwen moet ik zelfs kotsen. \t\t\nMarmotten\nen geiten \tArend-Jan heeft dieren als hobbie. \t\t\nCD  Album\nMensonterend \tIemand die mensonterend behandeld is. \t\t\nMenukaart \tWat hebben ze bij die Italiaanse pizzeria? \t\t\nCD  Album\nMesopotamier \tDe kenmerken van een met uitsterven bedreigd ras. \t\t\nMirakelman \tEen echte superheld die door muren heen kan kijken. \t\t\nMissisippy Boys \tRob had veel over voor de repetities van de Boys. \t\t\nMoeilijke stoelgang \tTwee mannen praten over hun probleem. \t\t\nMongolenorkest \tEen orkest van mensen met het syndroom van down. \t\t\nMoppenwedstrijd \tDe finale tussen Arie en Marco. \t\t\nMuil openbeuken \tHet gezegde: &quot;Iemand z'n muil open beuken&quot; \t\t\nMuziekinstrumenten \tTheo Velzeboer heeft een talent ontwikkelt. \t\t\n\nNa 20 jaar huwlijk \tMan is uitgekeken op zijn vrouw. \t\t\nNabespreking \tTerugblik op een gesprek met een gast. \t\t\nNachtmerrie \tPiet Lunshof zet een kind in een brandend huis. \t\t\nNaimami indianen \tLevensbeschouwing over een geschift indianen volk. \t\t\nNeuker \tMan heeft ontzettend veel vrouwen geneukt. \t\t\nNiemand\nbegrijpt me \tMan kan niet uitleggen waarom. \t\t\nNieuwe ziekte \tRob Kampenaar is gauw op de teentjes getrapt. \t\t\nCD  Album\nNSDAP \tOnrust over nieuwe politieke partij. \t\t\n\nOmvangrijk oevre \tVan streekroman tot horror-porno voor kinderen. \t\t\nOndankbare plant \tRupert wordt gepest door een gevonden plant. \t\t\nCD  Album\nOnderwijsmethode \tDoorbreken van de afkeer om te leren. \t\t\nOntdekker \tDeze man heeft echt veel mensen ontdekt. \t\t\nOnterechte kritiek \tOnterechte kritiek is zo ontzettend onterecht. \t\t\nOorlog \tHet is weer eens tijd voor oorlog! \t\t\nOpgesloten \tZeven jaar in de meterkast als kind. \t\t\nOproep aan Anita \tEen oproep aan het meisje uit de trein. \t\t\nOpticiens \tOpticiens kapot stampen... en bijten. \t\t\nOtto \tDie nieuwe leerling moet ik niet. \t\t\nOuders zijn ballast \tAls ze over houdbaarheids-datum zijn... \t\t\nOud-\nhollandse spelen \tWat een mooie oud hollandse spelen ... \t\t\nOutlaw \tBilly kan niet veel maar gaat in een western spelen. \t\t\nCD  Album\nOuwe vrijster \tOp avontuur met Parkinson en de gevolgen daarvan. \t\t\nCD  Album\n\nPaard en wagen \tEen kadootje dat graag gewild is voor de verjaardag. \t\t\nPantonime \tHet treurige leven van een pantonimespeler. \t\t\nParanormale wereld \tPositieve instaling voor het komende jaar. \t\t\nParty Time \tHet beste radioprogramma dat ooit gemaakt is. \t\t\nParty Time afscheid \tVanwege een ongeval valt definitief het doek. \t\t\nParty Time goocheldoos \tHenk gaat truukjes doen tijdens de uitzending. \t\t\nParty Time pilletje \tHenk zit met XTC op in de uitzending. \t\t\nPashokjesvoyeur \tLevendige handel in pashokjes video's. \t\t\nPater\nBieman: klieren \tErgernissen in het openbaar vervoer. \t\t\nPater\nBieman: vrije slag \tVerval in normen en waarden tegen gaan. \t\t\nPater\nBieman: vrouw holle \tHet verhaal van de put van vrouw holle. \t\t\nPete Sampras \tAlbert zet gezin en boerderij in voor tenniswedstrijd. \t\t\nPiercings \tMan vertelt over de ellende van zijn piercings. \t\t\nCD  Album\nPijnstraffen \tAlles in Nederland is goed zolang het geen pijn doet. \t\t\nPincode \tJohan Boekhals kent alle pincodes uit zijn hoofd. \t\t\nPlatenzaak \tMannetje van de platenzaak krijgt klap op zijn kop. \t\t\nPolitiek \tTerugblikken op 35 jaar politiek. \t\t\nPretpark\nBloemenland \tIntiem klein en duur bloemenpark. \t\t\nPrins\nWillem-Alexander \tOver het veranderen van kikker/pad in prins. \t\t\nProduct \tVan de ene op de andere dag ben je een product. \t\t\nPuist \tKan jij mijn puist uitknijpen?. \t\t\nPuntmuts \tEen kabouter van meer dan 2 meter. \t\t\n\nRaadsel \tHet is grijs ... \t\t\nRadio Bergeijk: goulash kroket \tOphef over een goulash-kroket dat een shoarma-rol blijkt te zijn omdat ie in het verkeerde hokje ligt. \t\t\nRadio Bergeijk: ruilbeurs \tDe tweede grote internationale bergeijkse ruilbeurs. \t\t\nRechtszaak \tAanklacht tegen het idee van liefdesliedjes. \t\t\nRelatie \tDuidelijkheid tegen elkaar is het belangrijkst. \t\t\nRespect\nvoor vrouwen \tSommige vrouwen zijn eigenlijk sloeries. \t\t\nRobert \tHeel erg geirriteerd van Robert. \t\t\nRobert Stoltz \tDe persoon in zijn composities. \t\t\nRoggebrood \tOnno Blikma ontkent het bestaan van roggebrood. \t\t\nRuimtewezens \tVeel verschillende rassen ruimtewezens gezien. \t\t\nRuud Meijer \tOver het pesten in militaire dienst. \t\t\n\nSave your soul \tGerard heeft een rock-nummer geschreven. \t\t\nScheidsrechter \tDick Rademakers wil eigen uitzendrechten. \t\t\nSchuinsmarcheerders \tOver de ervaringen met klaplopers en raddraaiers. \t\t\nSexy lingerie \tClaudia is niet de jongste meer. \t\t\nSollicitatie \tVernederde sollicitant krijgt uiteindelijk toch baan. \t\t\nSpeelgoed afpakken \tHoera roepen terwijl je over het speelgoed plast. \t\t\nSprookjesland \tOnbestaand sprookjesland komt als een schok. \t\t\nSS Mariska Veres \tMeneer Mulshoop verliet het schip voor de storm. \t\t\nCD  Album\nStatiegeld \tStatiegeld van een fles bewaren voor de toekomst. \t\t\nStemmingswisselingen \tVan de goede zin &gt;plop&lt; in de slechte zin. \t\t\nStraffen \tStraffen is niet iets wat je zomaar doet. \t\t\nStrontluisteraars \tPieter vindt de luisteraars sukkels. \t\t\nStruikrover \tMan met groene vingers verkeerd begrepen. \t\t\nSuikerkunst \tKunstenaar gebruikt enkel suiker in zijn werken. \t\t\n\nTandarts \tEen scheetje laten bij de tandarts. \t\t\nTederheid \tGunta en het vormgeven van de tederheid. \t\t\nTegen de natuur \tDe natuur is egoistisch en kan niet tegen zijn verlies. \t\t\nThe making of ... \tDe man die dacht dat ie een zak zand had. \t\t\nTherapie \tFred is een totaal ander mens. \t\t\nThuis \tErvaringen met een renovatie. \t\t\nTrainer \tAfgezette voetbaltrainer. \t\t\nTroubadour \tMet een aapje door het land, muziek maken. \t\t\nTrui \tKoos Verbrugge kan geen trui krijgen. \t\t\nCD  Album\nTV serie \tDocumentaire over jongeren zonder toekomst. \t\t\nTypmachine \tNieuwe typmachine met alleen de letter A. \t\t\n\nUit huis gezet \tOpzwepende muziek met als thema de jeugd. \t\t\nUitvinding \tRonald heeft 6 jaar gewerkt aan zijn soort kommetje. \t\t\n\nVaders kontje \tMan vindt dat zijn vader een lekker kontje heeft. \t\t\nVakantiekiekjes \tSmerige foto's van kinderen op de camping. \t\t\nVan Gend en Loos \tOver de strijd met hun rivaal, de PTT. \t\t\nVee\naan stukken rijden \tMan vertelt smakelijk over zijn aanrijdingen. \t\t\nVerkankerd \tMensen die ons koude kikkerlandje verpesten. \t\t\nVerliefd \tVerliefd op Koningin Beatrix. \t\t\nVerloren dagboeken \tHet avontuur van Elbert Pips. \t\t\nVernielzucht \tPuur recreatief agressief gedrag. \t\t\nVerras je tegenstander \tMerkwaardige taktiek van een voetbal coach. \t\t\nVerstoppertje \tGerard speelt verstoppertje met de radio. \t\t\nVervolgverhaal \tAflevering 6134 van de broek van Ans. \t\t\nVideoclip \tOmstreden beelden van &quot;Love in your heart&quot;. \t\t\nVliegen \tGuido van der Smisse is vernederd door de KLM. \t\t\nVoetbalhomo \tHomo's actief in de nederlandse voetbal wereld? \t\t\nVogels \tOver vogels die iets verkeerds gegeten hebben. \t\t\nVoorhuid afgenomen \tBelg vertelt hoe het is zonder voorhuid. \t\t\nVooroordelen \tMathieu bestrijd vooroordelen over negers. \t\t\nVorige levens \tMan geeft overzicht van zijn rotlevens. \t\t\nVork vast \tSpastici proberen de vork vast te houden. \t\t\nVrij hebben \tHeerlijk kuieren door de stad in je gewone kloffie. \t\t\nCD  Album\n\nWartaal en imitaties \tKrassenvakkapuge of prrrrrt en enkele imitaties. \t\t\nWC sketch \tMeer dan een sketch over een wc-juffrouw. \t\t\nWeerter Boys \tVoetbaltrainer heeft zo zijn eigen methodes. \t\t\nWelterusten \tWel... truste! \t\t\nCD  Album\nWereldkampioen ganzenborden \tRob vertelt over de opoffering in zijn leven die uiteindelijk toch niet voor niets zijn geweest. \t\t\nWF Hermans \tFons is eerder jaloers dan bewonderaar. \t\t\nWie van de drie \tBert Postma kwam erachter dat hij niet is wie hij is. \t\t\nWriter's block \tMan is schrijver maar kan niks geschreven krijgen. \t\t\nCD  Album\n\nYo God! \tHiphop band maakt aardige muziek over god. \t\t\n\nZand en schelpjes \tWillem wil erg graag iets doen met zand en schelpjes. \t\t\nCD  Album\nZelfmoord \tMan praat over de zelfmoord van zijn kinderen. \t\t\nZiedend \tMan is al 4 jaar ziedend maar voelt zich toch prima. \t\t\nZonnebank \tMan lijkt chinees na lang onder de zonnebank liggen. \t\t\nZuivelproducten \tBestaan van zuivelproducten die bruin zijn?","torrent":{"xt":"urn:btih:fecef53f0ed1c01bc8a481544290779211102ba0","amp;dn":"Mannen+van+de+Radio+collectie+%28Dutch%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fecef53f0ed1c01bc8a481544290779211102ba0","infoHashBuffer":{"type":"Buffer","data":[254,206,245,63,14,209,192,27,200,164,129,84,66,144,119,146,17,16,43,160]},"announce":[],"urlList":[]}}