{"title":"Our Superheroes, Ourselves","uid":8745061,"size":2168627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ff274626636ecb0db86e5dafddf370b2e5f0d27a&amp;dn=Our+Superheroes%2C+Ourselves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1374901392,"description":"\nRobin S. Rosenberg, &quot;Our Superheroes, Ourselves&quot;\nEnglish | ISBN: 0199765812 | 2013 | EPUB | 232 pages | 2 MB\n\nSuperhero fans are everywhere, from the teeming halls of Comic Con to suburban movie theaters, from young children captivated by their first comic books to the die-hard collectors of vintage memorabilia. Why are so many people fascinated by superheroes?\n\nIn this thoughtful, engaging, and at times eye-opening volume, Robin Rosenberg--a writer and well-known authority on the psychology of superheroes--offers readers a wealth of insight into superheroes, drawing on the contributions of a top group of psychologists and other scholars. The book ranges widely and tackles many intriguing questions. How do comic characters and stories reflect human nature? Do super powers alone make a hero super? Are superhero stories good for us? Most contributors answer that final question in the affirmative. Psychologist Robert J. Sternberg, for instance, argues that we all can learn a lot from superheroes-and what we can learn most of all is the value of wisdom and an ethical stance toward life. On the other hand, restorative justice scholar Mikhail Lyubansky decries the fact that justice in the comic-book world is almost entirely punitive, noting extreme examples such as &quot;Rorschach&quot; in The Watchmen and the aptly named &quot;The Punisher, who embrace a strict eye-for-an-eye sense of justice, delivered instantly and without mercy. ","torrent":{"xt":"urn:btih:ff274626636ecb0db86e5dafddf370b2e5f0d27a","amp;dn":"Our+Superheroes%2C+Ourselves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff274626636ecb0db86e5dafddf370b2e5f0d27a","infoHashBuffer":{"type":"Buffer","data":[255,39,70,38,99,110,203,13,184,110,93,175,221,243,112,178,229,240,210,122]},"announce":[],"urlList":[]}}