{"title":"Clawfinger Discography [MP3.256k.HighEnd]","uid":7582311,"size":818151030,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff2f36e35f1b77e510491c3fd28938ed510a8aba&amp;dn=Clawfinger+Discography+%5BMP3.256k.HighEnd%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Good.Old.David","files":-1,"time":1346285046,"description":"CLAWFINGER DISCOGRAPHY\n\nThis Collection is coded with LAME MP3 Coder in best possible quality setting\nVBR0 averaging at about 256kbit/sec - This setting comes very, very near to\n320kbit Constant Bit Rate setting, which represents the highest possible setting.\n\n\nBIOGRAPHY\n\nThe Scandinavian heavy metal four-piece Clawfinger formed in 1988 when Jocke Skog and Zak Tell met while working together at the Rosenlunds Hospital in nearby Stockholm. Bard Torstensson and Erlend Ottem joined them in 1990 and the four realized they all had similar interests in music. Post working hours became time spent exploring their musical hobby, playing around, making up songs and compositions while naturally becoming a band. By the mid-'90s, Clawfinger self-released their debut Deaf Dumb Blind and their unique blend of metal and hip-hop was critically acclaimed in Swedish press, not to mention the album having sold over 600,000 copies worldwide. They've played at countless European festivals including Holland's Dynamo Festival, Roskilde in Denmark, and Rock in Reim in Germany, and achieved innumerable awards. Clawfinger took home two Grammies at the Swedish Grammy Awards in 1994 for Best Hardrock Band and Best Video. In 1995, the band recorded a sophomore effort, Use Your Brain, and maintained momentum with constant touring, notably participating in Ozzy Osbourne's Monsters of Rock Festival in South America and rocking alongside American metal counterparts like Megadeth, Faith No More, and Alice Cooper. Two years later, after a well-deserved break, Clawfinger resurfaced with their eponymous third album. ","torrent":{"xt":"urn:btih:ff2f36e35f1b77e510491c3fd28938ed510a8aba","amp;dn":"Clawfinger+Discography+%5BMP3.256k.HighEnd%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff2f36e35f1b77e510491c3fd28938ed510a8aba","infoHashBuffer":{"type":"Buffer","data":[255,47,54,227,95,27,119,229,16,73,28,63,210,137,56,237,81,10,138,186]},"announce":[],"urlList":[]}}