{"title":"Sleep Parade - Inside/Out (2013) [FLAC]","uid":8683367,"size":331539158,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ff5f6ffb268d41a950f3af33418285124367b73d&amp;dn=Sleep+Parade+-+Inside%2FOut+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1373743787,"description":"\n  Sleep Parade - Inside/Out (2013) [FLAC]\n\n  Genre: Pop/Rock\n  Style: Alternative, Progressive Rock\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Devil's Door\n  02 Dancing With The Enemy\n  03 Collision\n  04 2:09\n  05 Footsteps\n  06 Oxygen\n  07 Mirrors\n  08 The River\n  09 Home\n  10 Open Your Eyes\n  11 Inside/Out\n\n  Review\n\n  Sleep Parade certainly aren't the first band in recent times to move towards a softer, more &quot;indie&quot; sound, nor is it likely that they'll be the last. The dizzy-eyed, multi-layered, shimmering sound of semi-whispered vocals, glimmering keyboards and evocative lyrics is one that has become fiercely popular over recent years, and Sleep Parade would seem to be just the latest to jump on the bandwagon. Almost entirely ditching the progressive-oriented, guitar-based, hard-rocking aesthetic of their debut Things Can Always Change, Inside/Out is almost certainly going to be a fan-alienating release. But is that an excuse to disregard it? Definitely not.\n\n  The tracklisting of the album certainly reflects a desire from the band to ease both old and new listeners into their new style, as the three hard-rocking, guitar-led songs that relate most to their old style are placed at the beginning of the album, and the more pop- and indie-focused tracks follow thereafter. However, this leads to a slight problem in that songs of the same style are lumped together in groups of three or more rather than being spread out throughout the album's duration, which leads to a tangible feeling of repetition or &quot;same-ness&quot; that betrays the amount of experimentation present; a problem which could be easily solved by spreading the songs of different styles present throughout the album. This is, however, just a small nitpick in the grand scheme of things.\n\n  Opener &quot;Devil's Door&quot; is a fun, pounding number that begins the album on a high and shows that the band have not entirely forsaken their roots, a vibe followed up on by track three &quot;Collisions&quot;. It is immediately clear that vocalist Leigh Davies has made monumental progress since Things Can Always Change in 2008. While in the past, he stuck mostly to the same pitch and tone and occasionally became a detriment to the music, on Inside/Out he has matured into a confident and versatile performer, utilising his familiar mid-range pitch alongside an unexpectedly effective falsetto and an almost John Frusciante-esque lower range. He is also noticeably singing a lot more from the heart this time around; the absence of which was a noticeable downside to Things Can Always Change, especially for an album themed around Davies' father's mental illness. Instrumentally, Sleep Parade reveal themselves to have embraced the tropes of indie rock to their fullest ability - lush keyboards and echoey guitars build a tangible atmosphere throughout the album's runtime that perfectly suits its direction and ambition.\n\n  Once the first three songs on the album have rocked themselves out, the band movesinto their new style with second single &quot;2:09&quot;, a slow-building and reserved track that stands as one of the highlights of the album. From here on, Sleep Parade doesn't look back, delivering track after track of catchy yet sophisticated, joyful yet reminiscent indie rock. Not until track #8 does a deviation from this norm occur, with album standout &quot;The River&quot;. With its acoustic guitar, tapping feet, backing &quot;whoa-oh&quot;s and even harmonica sections, the song strongly recalls the Dear Hunter's Green EP, yet surprisingly manages to provide the album's most heartwarming and affectionate moment when Davies lovingly croons &quot;Hey my father where are you, I really hope you're doing well, the deepest ocean runs between, someday we'll see eye to eye&quot;.\n\n~ Greets ~\n\nMy mates: sundox, eppo, Murlok, Wildcard, caylus, krosis, togachu, sid, chew, random, suzi, stepherd, HTorrentz, and findy.\n\nMy fellow uploaders: SmashAndGrab, DicktheSpic, KitLope, Ausy, Bubanee, eika256, horrorhound, zombiRG, HiGH\n\nThe TPB Crew and to anyone who downloads, seeds, and enjoys good music.","torrent":{"xt":"urn:btih:ff5f6ffb268d41a950f3af33418285124367b73d","amp;dn":"Sleep+Parade+-+Inside%2FOut+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff5f6ffb268d41a950f3af33418285124367b73d","infoHashBuffer":{"type":"Buffer","data":[255,95,111,251,38,141,65,169,80,243,175,51,65,130,133,18,67,103,183,61]},"announce":[],"urlList":[]}}